{
  "title": "Why I Season My Cutting Board, NOT My Steak",
  "video_published_at": "2019-05-09T18:00:00Z",
  "start_at": null,
  "end_at": null,
  "video_id": "02tRxM_1VsE",
  "published_at": "2020-08-19T04:35:20Z",
  "description": "Just like a dry sponge absorbs water, meat will (to an extent) absorb liquid as it cools. So, instead of flavoring your steak before you cook it (or in the pan while it cooks), you can simply flavor the cutting board with seasoning, citrus, herbs, butter — anything you'd like. Rest the steak on the board, then slice it thin and toss it in its own juices and your flavorings. The meat will suck everything up and deliver the goodness TO YOUR BELLY.\n\nHere's the classic J. Kenji López-Alt article I mentioned in the video about why you should season your steak at least 40 minutes in advance, IF you're going to season in advance: https://www.seriouseats.com/2011/03/the-food-lab-more-tips-for-perfect-steaks.html\n\nMY COOKING PHILOSOPHY: I don't like weighing or measuring things if I don't have to, and I don't like to be constantly checking a recipe as I cook. I don't care that volume is a bad way of measuring things — it's usually easier. I like for a recipe to get me in the ballpark, and then I like to eyeball and improvise the rest. If you're like me, my goal with these videos is to give you a sense of how the food should look and feel as you're cooking it, rather than give you a refined formula to reproduce.",
  "thumbnails": {
    "default": {
      "height": 90,
      "url": "https://i.ytimg.com/vi/02tRxM_1VsE/default.jpg",
      "width": 120
    },
    "medium": {
      "height": 180,
      "url": "https://i.ytimg.com/vi/02tRxM_1VsE/mqdefault.jpg",
      "width": 320
    },
    "high": {
      "height": 360,
      "url": "https://i.ytimg.com/vi/02tRxM_1VsE/hqdefault.jpg",
      "width": 480
    },
    "standard": {
      "height": 480,
      "url": "https://i.ytimg.com/vi/02tRxM_1VsE/sddefault.jpg",
      "width": 640
    },
    "maxres": {
      "height": 720,
      "url": "https://i.ytimg.com/vi/02tRxM_1VsE/maxresdefault.jpg",
      "width": 1280
    }
  }
}