{
  "title": "Best Crispy Garlic Pork made with 6 Basic Ingredients 蒜香炸猪扒 Chinese Pork Chop / Pork Belly Recipe",
  "video_published_at": "2020-11-07T00:48:39Z",
  "start_at": null,
  "end_at": null,
  "video_id": "07JKx-P5L4Q",
  "published_at": "2020-11-19T17:13:22Z",
  "description": "This Crispy Garlic Pork is perfect for any meal or as finger food for your beer buddies (I mean alcoholic buddies). Making this crispy garlic pork recipe is really easy. If you want your pork to be juicier, don’t cut them too thinly and they’ll be perfect. You can also use pork belly instead of pork loin. Can’t take pork? You can replace pork with chicken as well. Easy easy!\n\nSee the ingredient list below for your easy reference. \n\nHope you can recreate this yummy dish in the comfort of your home. Happy cooking! \n\nThanks for dropping by our channel. Please subscribe to stay tuned to our home cooking videos. \n\nStalk us! \nYoutube: www.youtube.com/spicenpans \nFacebook www.facebook.com/spicenpans/ \nInstagram www.instagram/spicenpans \nWebsite: www.spicenpans.com \nChat with us! info@spicenpans.com \n\nThanks for watching! \nSee you soon. \n------------------ \n\nCrispy Garlic Pork蒜香炸猪扒 Ingredients: \nServes 4 pax \n------- \n220g pork loin (sliced thinly)\n1 bulb garlic – grated\n1 tablespoon light soy sauce\n1 teaspoon salt\n2 tablespoons water\nA few dashes of white pepper\nSome sweet potato flour or cornflour (cornstarch)\n1 bulb garlic (washed, lightly smashed with skin intact)\n\n=== \nDon't know where to get the ingredients or don't know how they look like? See the links below. \n\nLight soy sauce https://amzn.to/3dBZuBY \nGrounded white pepper https://amzn.to/2I2wFFo\nCornflour (Cornstarch) https://amzn.to/38f0zkn\n---------- \nLooking for similar cooking equipment like the one we used in the video? These might interest you: \nCast iron wok https://amzn.to/3mUyPFK\n\nFYI – the one we used in the video is La Gourmet Cast Iron Wok\n------------- \nFilming equipment: iPhone 11 Pro Max (Get from Amazon https://amzn.to/3eA24tz) \nMicrophone: Sennheiser AVX digital wireless microphone system \n\nGet Sennheiser wireless microphone in Singapore: https://singapore.sennheiser.com/products/avx-mke2-set-3-uk?_pos=2&_sid=adb86a9d8&_ss=r \n\nGet Sennheiser wireless microphone from Amazon: https://amzn.to/2NILqMR \n----------------------------------- \nIf you like this recipe, you might like these too: \n\nEasier than Sweet & Sour Pork • Tasty Honey Pork Recipe 蜜糖咕噜肉\nhttps://youtu.be/1b6QWJjWAAg\nSECRET REVEALED! Din Tai Fung Pork Chop (Fried Rice) Recipe 鼎泰丰排骨(猪扒) Chinese Pork Recipe\nhttps://youtu.be/C9ioE3SbdD0\n\nSuper Crispy Hainanese Pork Chop Recipe 香脆海南猪扒 Hainanese Curry Rice Series\nhttps://youtu.be/O4lXens4kKs\n\n----------------------------------- \nDisclaimer: Spice N' Pans is not related to these products and cannot guarantee the quality of the products in the links provided. Links are provided here for your convenience. We can only stand by the brands of the products we used in the video and we highly recommend you to buy them. Even then, preference can be subjective. Please buy at your own risk. Some of the links provided here may be affiliated. These links are important as they help to fund this channel so that we can continue to give you more recipes. Cheers!",
  "thumbnails": {
    "default": {
      "height": 90,
      "url": "https://i.ytimg.com/vi/07JKx-P5L4Q/default.jpg",
      "width": 120
    },
    "medium": {
      "height": 180,
      "url": "https://i.ytimg.com/vi/07JKx-P5L4Q/mqdefault.jpg",
      "width": 320
    },
    "high": {
      "height": 360,
      "url": "https://i.ytimg.com/vi/07JKx-P5L4Q/hqdefault.jpg",
      "width": 480
    },
    "standard": {
      "height": 480,
      "url": "https://i.ytimg.com/vi/07JKx-P5L4Q/sddefault.jpg",
      "width": 640
    },
    "maxres": {
      "height": 720,
      "url": "https://i.ytimg.com/vi/07JKx-P5L4Q/maxresdefault.jpg",
      "width": 1280
    }
  }
}