{
  "title": "Extra-Flaky Chinese Scallion Pancakes Recipe [葱油饼]",
  "video_published_at": "2017-10-04T14:01:08Z",
  "start_at": null,
  "end_at": null,
  "video_id": "0EgspSFnORo",
  "published_at": "2020-05-20T04:11:48Z",
  "description": "Scallion pancake is a pan-fried flatbread. So easy to make but very delicious. We usually eat this with plain porridge.  It is a cheap Chinese food but so delicious. In This video, you will learn how to make a perfect scallion pancake which is multilayered and delicately flaky\n\n🥢BUY MY WOK \nUSA - https://amzn.to/39iHIWd\nCANADA - https://www.amazon.ca/dp/B07RJ39JVL?ref=myi_title_dp \nAUSTRALIA - https://www.amazon.com.au/dp/B07RJ39JVL\nEU (including UK)  - https://soupeduprecipes.com/carbon-steel-wok-with-flat-bottom/ (Note: Amazon pay is not suitable for EUR orders. Please use stripe to pay.)\nRest of the World - https://forms.gle/r2YBBgtZbCejToVk8\n\n🥢PRINTABLE RECIPE -  https://soupeduprecipes.com/scallion-pancakes/\n\n🥢MY AMAZON INFLUENCER/AFFILIATE PAGE - https://www.amazon.com/shop/influencer-078efbf8 (I share ingredients and recommended products there)\n\n🥢SUPPORT ME ON PATREON - https://www.patreon.com/soupeduprecipes\n\n🥢RECIPE - Note: The product links below are affiliate links. I may earn a commission if you purchase an item on a linked website within 24 hours.\n\n**LIST OF INGREDIENTS**\n10 ounces [283 grams] of all-purpose flour \n7 ounces [198 grams] of warm water\n1 tsp of salt or to taste\n2 tbsp of all-purpose flour\n1 tsp of black pepper\n1/4 cup of vegetable oil\nSome green onion\n\n**HOW TO MAKE SCALLION PANCAKES**\n\n- Mix 10 ounces of all-purpose flour with 1 tsp of salt. Pour in 7 ounces of warm water in batches. In the same time use chopsticks stir it.\n\n- knead it for 5-8 minutes or until it becomes a soft dough. Feel free to use some dry flour so it will be easier to handle.\n\n- Put this in a bowl which is brushed with some oil in advance. Turn the dough over a few times inside the bowl until the surface is coated lightly with the oil. Cover it with a plastic film. It needs to touch the dough directly. Push out all the air. Because we are going to let this sit in the fridge overnight. If you have a little bubble of air in it, then there will be a spot with a layer of dry skin tomorrow. Be careful with that. \n\n- Let’s make the flour-oil. In a small sauce bowl, add 1.5 tbsp of all-purpose flour, 1 tsp of black pepper. Heat up 1/4 cup of vegetable and pour it in. Mix it up carefully. This just a basic oil. If you want to be creative, you can add some chili flakes, Sichuan peppercorn, or cumin. \n\n- Shape it into an even long piece. Cut it into 6 even pieces. Each one should be about 3 ounces. \n\n- Roll each piece into a thin sheet. Try to get it into a rectangle shape. But doesn’t have to be so perfect. \n\n- Brush the thin sheet with some flour oil and sprinkle some scallion on it. \n\n- Roll it from one side like this. Then roll it into a cake shape. \n\n- Use your rolling pin to roll the cake into a round sheet. Once you get it about 7-8 inches across. You can start to pan fry it.\n\n- Put some oil in the pan, just a little bit to cover the bottom. Put your scallion pancake in and fry it on medium heat. 3-5 minutes on each side or until it is golden brown. Do it one by one and you are done.\n\n**HOW TO SAVE IT**\n- Wrap it with plastic film before frying and put it in a sealable bag. It will last 30 days in the freezer. Whenever you want to eat them again. Take it out, don’t need to defrost. Just directly pan fry it. Now I am going to show you how to do this.\n\n\nEnjoy your meal! If you have any questions about the recipes, just post a comment, will help you out as soon as possible!\n\n...and if you've read this far, might as well subscribe. More recipes coming soon =)",
  "thumbnails": {
    "default": {
      "height": 90,
      "url": "https://i.ytimg.com/vi/0EgspSFnORo/default.jpg",
      "width": 120
    },
    "medium": {
      "height": 180,
      "url": "https://i.ytimg.com/vi/0EgspSFnORo/mqdefault.jpg",
      "width": 320
    },
    "high": {
      "height": 360,
      "url": "https://i.ytimg.com/vi/0EgspSFnORo/hqdefault.jpg",
      "width": 480
    },
    "standard": {
      "height": 480,
      "url": "https://i.ytimg.com/vi/0EgspSFnORo/sddefault.jpg",
      "width": 640
    },
    "maxres": {
      "height": 720,
      "url": "https://i.ytimg.com/vi/0EgspSFnORo/maxresdefault.jpg",
      "width": 1280
    }
  }
}