{
  "title": "Jamie's Ministry of Food | Mini Shell Pasta | Channel 4",
  "video_published_at": "2008-10-16T12:33:38Z",
  "start_at": null,
  "end_at": null,
  "video_id": "1YNY7n079HU",
  "published_at": "2012-11-15T01:36:13Z",
  "description": "This is one of the dishes I cook for my kids, but to be honest, it's so good that me and Jools always eat it too! Mini pasta shells are actually meant to be added to soups, but they're quick and easy to cook, which makes them a good thing to serve with pasta sauces. \r\nAll in all this should take you no more than five and a half minutes to cook. However, if you decide to go for a bigger type of pasta, remember that it will need more time to cook than these mini shells. \r\n\r\nTo prepare your pasta.\r\n\r\nFinely slice the bacon.\r\nPick the mint leaves and discard the stalks. Finely grate the Parmesan. \r\n\r\nTo cook your pasta.\r\n\r\nBring a large pan of salted water to the boil. \r\nAdd the mini shells and cook according to the packet instructions. \r\nGet a large frying pan over a medium heat and add a good lug of olive oil and the butter. \r\nAdd the bacon to the pan, sprinkle a little pepper over and fry until golden and crisp. \r\nMeanwhile, finely chop your mint leaves \r\nAs soon as the bacon is golden, add your frozen peas and give the pan a good shake. \r\nAfter a minute or so, add the crème fraîche and chopped mint to the bacon and peas. \r\nDrain the pasta in a colander over a large bowl, reserving some of the cooking water. \r\nAdd the pasta to the frying pan \r\nHalve your lemon and squeeze the juice over the pasta. \r\nWhen its all bubbling away nicely, remove from the heat.\r\nIts really important that the sauce is creamy, silky and delicious but if its too thick for you, add a splash of the reserved cooking water to thin it out a bit. \r\nAdd the grated Parmesan and give the pan a shake to mix it in.\r\n\r\nTo serve your pasta.\r\n\r\nDivide your pasta between plates or bowls, or put it on the table in a large serving dish and let everyone help themselves. \r\n\r\nLovely with a simply dressed green salad! \r\n\r\nWatch Jamie's Ministry of Food FREE on 4oD http://vodapp.grid.channel4.com/c4links-web/VODLink.do?t=season&i=2756088\r\n\r\nDownload Jamie's Ministry of Food on iTunes http://clkuk.tradedoubler.com/click?p=23708&a=1409847&url=http%3A%2F%2Fphobos.apple.com%2FWebObjects%2FMZStore.woa%2Fwa%2FviewTVSeason%3Fi%3D293747233%26id%3D292214257%26s%3D143444%26partnerId%3D2003\r\n\r\nVisit the official website http://www.jamiesministryoffood.com/content/c4/home.html?intcmp=homepage_flash",
  "thumbnails": {
    "default": {
      "height": 90,
      "url": "https://i.ytimg.com/vi/1YNY7n079HU/default.jpg",
      "width": 120
    },
    "medium": {
      "height": 180,
      "url": "https://i.ytimg.com/vi/1YNY7n079HU/mqdefault.jpg",
      "width": 320
    },
    "high": {
      "height": 360,
      "url": "https://i.ytimg.com/vi/1YNY7n079HU/hqdefault.jpg",
      "width": 480
    },
    "standard": null,
    "maxres": null
  }
}