{
  "title": "Tomato, Egg, and Prosciutto Tart - Everyday Food with Sarah Carey",
  "video_published_at": "2013-09-25T13:33:49Z",
  "start_at": null,
  "end_at": null,
  "video_id": "4Huzx4PeUe4",
  "published_at": "2014-10-24T02:26:15Z",
  "description": "You already know how much I love making breakfast food for dinner, and that's why today's recipe is quickly becoming one of my new favorites. It's a savory prosciutto tart that's layered with sweet grape tomatoes and a just-set baked egg. These flaky squares are not only gorgeous to look at but they're dead simple to prepare (store-bought puff pastry makes this recipe a cinch to arrange). You can also easily increase this recipe just by rolling out another pastry sheet. Give your meat-and-potatoes meals a break and try these delicate treats for dinner instead.\n\nSarah's Tip of the Day: \nMake quick work of halving cherry tomatoes by placing them between two plastic lids and slicing them down the center. Watch Sarah demonstrate this method in today's video!\n\nSubscribe for more easy and delicious recipes: http://full.sc/P8YgBt\n\n---------------------------------------------------------------\n\nPREP: 20 MINS TOTAL TIME: 30 MINS\nYIELD:Makes 8\n\nGET MORE\nSubscribe to Martha Stewart Living\nSign Up to Receive Video Recipes Daily\n \nINGREDIENTS\n\n1 (17.3 ounce) box frozen puff pastry, thawed\n2 cups cherry tomatoes, halved\n1 tablespoon olive oil\n1 teaspoon chopped fresh thyme\nCoarse salt and pepper\n9 large eggs\n1/2 cup grated fontina (1 1/2 ounces)\n8 thin slices prosciutto\n\nDIRECTIONS\nSTEP 1\nPreheat oven to 400 degrees. Unfold each sheet of puff pastry onto a parchment-lined baking sheet and cut each into 4 squares. With a paring knife, lightly score a border 1/4 inch from edges. Freeze 10 minutes.\nSTEP 2\nMeanwhile, combine tomatoes, olive oil, and thyme, and season with salt and pepper.\nSTEP 3\nLightly beat 1 large egg and brush border of each pastry square. Pile some fontina, tomato mixture, and a slice of prosciutto onto each square. Bake until tarts are golden brown and tomatoes have softened, 15 to 20 minutes.\nSTEP 4\nUse a spoon to create a well for each egg, then carefully crack 1 egg onto each tart. Bake until whites are just set and yolks are runny, 10 to 12 minutes.\n\n---------------------------------------------------------------\n\nGet the Full Recipe: http://full.sc/18Z3aol\n \nMore Breakfast Recipes: http://full.sc/V70546\n\n---------------------------------------------------------------\n\nWant more? Sign up to get my video recipe email, served daily.\nGet recipe emails: http://www.marthastewart.com/edf\nLike Everyday Food: http://www.facebook.com/EverydayFood\nFollow Everyday Food: https://twitter.com/everydayfood\nEveryday Food Pinterest: http://pinterest.com/everydayfood\n\nSarah Carey is the editor of Everyday Food magazine and her job is to come up with the best ways to make fast, delicious food at home. But she's also a mom to two hungry kids, so the question \"What's for dinner?\" is never far from her mind -- or theirs, it seems! Her days can get crazy busy (whose don't?), so these videos are all about her favorite fast, fresh meals -- and the tricks she uses to make it all SO much easier.\n\nTomato, Egg, and Prosciutto Tart - Everyday Food with Sarah Carey\nhttp://www.youtube.com/user/everydayfoodvideos",
  "thumbnails": {
    "default": {
      "height": 90,
      "url": "https://i.ytimg.com/vi/4Huzx4PeUe4/default.jpg",
      "width": 120
    },
    "medium": {
      "height": 180,
      "url": "https://i.ytimg.com/vi/4Huzx4PeUe4/mqdefault.jpg",
      "width": 320
    },
    "high": {
      "height": 360,
      "url": "https://i.ytimg.com/vi/4Huzx4PeUe4/hqdefault.jpg",
      "width": 480
    },
    "standard": {
      "height": 480,
      "url": "https://i.ytimg.com/vi/4Huzx4PeUe4/sddefault.jpg",
      "width": 640
    },
    "maxres": null
  }
}