{
  "title": "Melt In Your Mouth Duck by Chinese Masterchef • Taste Show",
  "video_published_at": "2019-07-31T10:00:00Z",
  "start_at": null,
  "end_at": null,
  "video_id": "53ug4vhuBY0",
  "published_at": "2021-06-03T05:00:06Z",
  "description": "Masterchef John Zhang shares the tips on how to make this popular authentic cantonese dish, Crispy Fried Duck with Taro, 荔芋香酥鴨, to experience 4 layers of different texture that melts in your mouth all in one bite.\n\n#duck #cantonese #chinesecooking\n\nThe recipe features moist duck wrapped in a blanket of mashed taro root. The whole thing then gets deep-fried to provide flavor and crunchiness. The nuttiness lent by the mashed taro gives an extra layer of flavor to the boneless duck. It's crispy on the outside and soft on the inside that melts in your mouth.\n\nTraditional Cantonese cooking is celebrated in China for its subtle and refined flavors. This is the real Kung Fu dish and takes a lot of time to prepare. To embrace the authentic Chinese cuisine, we hope the techniques and recipes can be pass down from generation to generation. \n\nSubscribe for more awesome Chinese recipes:\nhttps://www.youtube.com/c/TasteShow?sub_confirmation=1\n\nMore delicious duck recipes: \nhttps://www.youtube.com/playlist?list=PL00a0G6_TRLX_f275duxhHtyha0vXdZej\n\nAre you a foodie craving Chinese food? Look no further.\n\nHere we have the best Chinese recipes, prepared by award-winning chefs to showcase authentic, traditional Chinese cooking.\n\nWhether you want to know how to make Chinese dishes at home, or learn how to master cooking with a wok, we've got you covered.",
  "thumbnails": {
    "default": {
      "height": 90,
      "url": "https://i.ytimg.com/vi/53ug4vhuBY0/default.jpg",
      "width": 120
    },
    "medium": {
      "height": 180,
      "url": "https://i.ytimg.com/vi/53ug4vhuBY0/mqdefault.jpg",
      "width": 320
    },
    "high": {
      "height": 360,
      "url": "https://i.ytimg.com/vi/53ug4vhuBY0/hqdefault.jpg",
      "width": 480
    },
    "standard": {
      "height": 480,
      "url": "https://i.ytimg.com/vi/53ug4vhuBY0/sddefault.jpg",
      "width": 640
    },
    "maxres": {
      "height": 720,
      "url": "https://i.ytimg.com/vi/53ug4vhuBY0/maxresdefault.jpg",
      "width": 1280
    }
  }
}