{
  "title": "Science: White Sugar vs Brown Sugar — What You Use Can Dramatically Change Texture in Baked Goods",
  "video_published_at": "2012-10-26T22:05:16Z",
  "start_at": null,
  "end_at": null,
  "video_id": "7gnfOwb8lKU",
  "published_at": "2017-05-25T01:50:40Z",
  "description": "Buy Cook's Science today: http://amzn.to/212U0nC\nThe Science of Good Cooking: http://amzn.to/1O8oGw7\n\nWatch Test Cook Dan Souza illustrate Concept #48, \" Sugar Changes Texture (and Sweetness),\" with an in-depth kitchen experiment. Hope you like cookies.\n\nEach week, the cast of America's Test Kitchen brings the recipes, testings, and tastings from Cook's Illustrated magazine to life on our public television series. With more than 2 million viewers per episode, we are the most-watched cooking show on public television.\nhttp://www.americastestkitchen.com\n\nMore than 1.3 million home cooks rely on Cook's Illustrated and Cook's Country magazines to provide trusted recipes that work, honest ratings of equipment and supermarket ingredients, and kitchen tips.\nhttp://www.cooksillustrated.com\nhttp://www.cookscountry.com\n\nABOUT US: Located in Boston’s Seaport District in the historic Innovation and Design Building, America's Test Kitchen features 15,000 square feet of kitchen space including multiple photography and video studios. It is the home of Cook’s Illustrated magazine and Cook’s Country magazine and is the workday destination for more than 60 test cooks, editors, and cookware specialists. Our mission is to test recipes over and over again until we understand how and why they work and until we arrive at the best version.\n\nIf you like us, follow us:\nhttp://cooksillustrated.com\nhttp://facebook.com/cooksillustrated\nhttp://twitter.com/testkitchen\nhttp://instagram.com/cooksillustrated\nhttp://pinterest.com/testkitchen",
  "thumbnails": {
    "default": {
      "height": 90,
      "url": "https://i.ytimg.com/vi/7gnfOwb8lKU/default.jpg",
      "width": 120
    },
    "medium": {
      "height": 180,
      "url": "https://i.ytimg.com/vi/7gnfOwb8lKU/mqdefault.jpg",
      "width": 320
    },
    "high": {
      "height": 360,
      "url": "https://i.ytimg.com/vi/7gnfOwb8lKU/hqdefault.jpg",
      "width": 480
    },
    "standard": {
      "height": 480,
      "url": "https://i.ytimg.com/vi/7gnfOwb8lKU/sddefault.jpg",
      "width": 640
    },
    "maxres": {
      "height": 720,
      "url": "https://i.ytimg.com/vi/7gnfOwb8lKU/maxresdefault.jpg",
      "width": 1280
    }
  }
}