{
  "title": "Binging with Babish: Strudel from Inglourious Basterds",
  "video_published_at": "2017-01-23T18:02:57Z",
  "start_at": null,
  "end_at": null,
  "video_id": "7H3z3J50XCs",
  "published_at": "2017-03-20T18:59:30Z",
  "description": "Hans Landa is the sherlock-pipe-smokin', famous-actress-chokin', Brad-Pitt-pokin' SS detective we all love to hate.  Sure he massacred Shosanna's family right in front of her, but hey, guy knows not-so-terrible strudel when he sees it.  Follow along this week as we make old-school Viennese apfelstrudel, and don't forget the cream.\n\nMusic - \"Cream on Chrome\" by Ratatat\n\nRecipe: https://www.bingingwithbabish.com/recipes/2017/8/22/ingloriousbasterds\n\nWatch in Spanish here: https://www.youtube.com/watch?v=fvY--Jdj68k\n\nBinging With Babish Website: http://bit.ly/BingingBabishWebsite\nBasics With Babish Website: http://bit.ly/BasicsWithBabishWebsite\nPatreon: http://bit.ly/BingingPatreon\nInstagram: http://bit.ly/BabishInstagram\nFacebook: http://bit.ly/BabishFacebook\nTwitter: http://bit.ly/BabishTwitter\n\n--\n\nRECIPE\n\n*Ingredients*\n\n1 1/2 cups bread flour (plus more for dusting, sprinkling, filling)\n4 tbsp vegetable oil\n2 egg whites\n1/2 tsp salt\n1/2 tbsp lemon juice\n1/4 cup warm water (110F)\n4 baking apples, peeled and sliced thinly\n1/2 cup sugar\nZest of one lemon\n1/2 cup raisins\n1 tbsp cinnamon\n1/2 cup finely chopped walnuts, hazelnuts, or almonds\n1 stick butter, melted, plus more as needed\n1 egg, beaten\n1 cup heavy cream\n1 tbsp sugar\nPowdered sugar for garnish\n\nPlace flour in a large bowl - create a well in the center with your fingers, and fill with vegetable oil, egg whites, salt, and lemon juice.  Mix with fingers until just combined, and sprinkle with water.  Knead until a sticky dough forms.  Turn out onto a lightly floured tabletop, and knead rigorously (slap onto the table about 100 times), until the dough is soft and supple.  Place in a lightly oiled bowl and let rest for 30 minutes.\n\nCombine apples, sugar, lemon zest, raisins, and cinnamon.  Set aside and let liquid weep from apples.\n\nCover a large table with a cotton tablecloth, and liberally dust with flour.  Roll out dough on tablecloth until about 24\" in diameter, and using floured fists, stretch dough out as large as possible without tearing.  Back on the tablecloth, gently tug at edges of dough until it's a rectangle thin enough to see the pattern of the tablecloth underneath.  Trim off torn/thick edges.  Drizzle with melted butter, and brush until evenly coated.  Sprinkle with chopped nuts.\n\nPlace about 3/4 of apple mixture on one side of the dough rectangle, and using the tablecloth, roll the apples over onto the dough square.  Brush the newly-exposed dough covering the apples with melted butter.  Roll apples over again, and repeat, until apples are at the center of a long, closed roll.  Pinch ends together to seal contents inside, and place seam-side down on a parchment-lined baking sheet.  Brush liberally with a beaten egg.\n\nBake for about an hour, basting with melted butter every 10-15 minutes, as soon as the crust begins to look dry.  Remove from oven when golden brown.  Allow to cool at least one hour before slicing, dusting with powdered sugar, and serving.\n\nIn a small bowl, combine cream and sugar.  Beat to stiff peaks, and pipe into a bowl, served alongside strudel.",
  "thumbnails": {
    "default": {
      "height": 90,
      "url": "https://i.ytimg.com/vi/7H3z3J50XCs/default.jpg",
      "width": 120
    },
    "medium": {
      "height": 180,
      "url": "https://i.ytimg.com/vi/7H3z3J50XCs/mqdefault.jpg",
      "width": 320
    },
    "high": {
      "height": 360,
      "url": "https://i.ytimg.com/vi/7H3z3J50XCs/hqdefault.jpg",
      "width": 480
    },
    "standard": {
      "height": 480,
      "url": "https://i.ytimg.com/vi/7H3z3J50XCs/sddefault.jpg",
      "width": 640
    },
    "maxres": {
      "height": 720,
      "url": "https://i.ytimg.com/vi/7H3z3J50XCs/maxresdefault.jpg",
      "width": 1280
    }
  }
}