{
  "title": "Quick and Easy Pasta With Cherry Tomato Sauce",
  "video_published_at": "2016-08-28T15:54:12Z",
  "start_at": null,
  "end_at": null,
  "video_id": "7zS5Wj7ZfIY",
  "published_at": "2017-05-23T20:22:07Z",
  "description": "This is the fastest, easiest way to make pasta sauce from scratch. The secret is using cherry tomatoes. Cherry tomatoes are almost always sweeter, riper, and higher in pectin than larger tomatoes at the supermarket. All of these factors means that cherry tomatoes are fantastic for making a rich, thick, flavorful sauce. Even better: it only takes four ingredients and about 10 minutes start to finish - less time than it takes to cook the pasta you're gonna serve it with.\n\nRECIPE:\n\nINGREDIENTS\n\n1 pound dry pasta\nKosher salt\n4 medium cloves garlic, thinly sliced\n6 tablespoons extra-virgin olive oil, divided\n1 1/2 pounds cherry tomatoes (about 2 pints; 750g)\n1 ounce fresh basil leaves, roughly chopped (about 1 cup; 30g)\nFreshly ground black pepper\nParmesan cheese, for serving\n\nDIRECTIONS\n\n1. Place pasta in a large skillet or sauté pan and cover with water and a big pinch of salt. Bring to a boil over high heat, stirring occasionally. Boil until just shy of al dente, about 1 minute less than the package instructions.\n\n2. Meanwhile, heat the garlic and 4 tablespoons olive over in a 12-inch skillet over medium heat, stirring frequently, until garlic is softened but not browned, about 3 minutes. Add tomatoes and cook, stirring, until tomatoes begin to burst. You can help them along by pressing on them with the back of a wooden spoon as they soften.\n\n3. Continue to cook until sauce is rich and creamy, about 5 minutes longer. Stir in basil and season to taste with salt and pepper.\n\n4. When pasta is cooked, drain, reserving a cup of pasta water. Add pasta to sauce and increase heat to medium-high. Cook, stirring and tossing constantly, and adding pasta water as necessary to adjust consistency to a nice, creamy flow. Remove from heat, stir in remaining olive oil, and grate in a generous shower of Parmesan cheese. Serve immediately, passing extra Parmesan at the table.\n\nMusic: Bensound.com",
  "thumbnails": {
    "default": {
      "height": 90,
      "url": "https://i.ytimg.com/vi/7zS5Wj7ZfIY/default.jpg",
      "width": 120
    },
    "medium": {
      "height": 180,
      "url": "https://i.ytimg.com/vi/7zS5Wj7ZfIY/mqdefault.jpg",
      "width": 320
    },
    "high": {
      "height": 360,
      "url": "https://i.ytimg.com/vi/7zS5Wj7ZfIY/hqdefault.jpg",
      "width": 480
    },
    "standard": {
      "height": 480,
      "url": "https://i.ytimg.com/vi/7zS5Wj7ZfIY/sddefault.jpg",
      "width": 640
    },
    "maxres": {
      "height": 720,
      "url": "https://i.ytimg.com/vi/7zS5Wj7ZfIY/maxresdefault.jpg",
      "width": 1280
    }
  }
}