{
  "title": "Gordon Ramsay Guides Katy Perry In Cooking But Only With His Voice | Season 1 Ep. 3 | THE F WORD",
  "video_published_at": "2017-06-15T01:34:39Z",
  "start_at": null,
  "end_at": null,
  "video_id": "7zYsUFSqqfg",
  "published_at": "2017-06-21T23:21:09Z",
  "description": "A divider stands between Katy's and Gordon's kitchen so Katy has to cook by listening to Gordon's directions.\n\nSubscribe now for more The F Word clips: http://fox.tv/Subscribe_TheFWord\n\nWatch the latest episodes on our official site: http://fox.tv/WATCHthefword\n\nLike The F Word on Facebook: http://fox.tv/TheFWord_FB\nFollow The F Word on Twitter: http://fox.tv/TheFWord_TW\nFollow The F Word on Instagram: http://fox.tv/TheFWord_IG\n\nLike FOX on Facebook: ‪http://fox.tv/FOXTV_FB‬‬\nFollow FOX on Twitter: ‪http://fox.tv/FOXTV_Twitter‬‬\n\nFOX has ordered THE F WORD, a bold new food variety show from award-winning chef and series host Gordon Ramsay. Based on his hit U.K. series of the same name, each distinctive and fast-paced hour will combine good food and good cooking with Ramsay’s passion, energy and humor into a one-of-a-kind LIVE series. THE F WORD is scheduled to premiere in 2017 on FOX.\n\nOn THE F WORD, foodie families from across the U.S. will battle it out in an intense, high-stakes cook-off. In addition to impressing Ramsay, each team must win over the hearts and taste buds of the diners, celebrities and VIP guests whom they’re serving.\nThroughout each hour-long episode, cooking competition meets variety show as Ramsay chats with surprise guests and VIPs in the dining room, hosts live remotes with people from across the country, and appears weekly in unique field segments with fans, foodies and culinary experts.\n\nGordon Ramsay Guides Katy Perry In Cooking But Only With His Voice | Season 1 Ep. 3 | THE F WORD\nhttps://www.youtube.com/c/TheFWordFOX\n\n#TheFWord #GordonRamsay",
  "thumbnails": {
    "default": {
      "height": 90,
      "url": "https://i.ytimg.com/vi/7zYsUFSqqfg/default.jpg",
      "width": 120
    },
    "medium": {
      "height": 180,
      "url": "https://i.ytimg.com/vi/7zYsUFSqqfg/mqdefault.jpg",
      "width": 320
    },
    "high": {
      "height": 360,
      "url": "https://i.ytimg.com/vi/7zYsUFSqqfg/hqdefault.jpg",
      "width": 480
    },
    "standard": {
      "height": 480,
      "url": "https://i.ytimg.com/vi/7zYsUFSqqfg/sddefault.jpg",
      "width": 640
    },
    "maxres": {
      "height": 720,
      "url": "https://i.ytimg.com/vi/7zYsUFSqqfg/maxresdefault.jpg",
      "width": 1280
    }
  }
}