{
  "title": "Chicken Pot Pie (As Made By Wolfgang Puck)",
  "video_published_at": "2016-02-25T22:23:40Z",
  "start_at": null,
  "end_at": null,
  "video_id": "_eOA-zawYEA",
  "published_at": "2018-03-12T03:01:01Z",
  "description": "Read more! - http://bzfd.it/1XPgzLN\n\nRecipe!\n\n2 pounds cooked boneless, skinless chicken, shredded\nSalt\nFreshly ground black pepper\n4 tablespoons vegetable oil\n4 tablespoons unsalted butter, at room temperature\n4 tablespoons all purpose flour \n1/2 pound red-skinned potatoes, cut into 1/2-inch pieces\n1/2 pound carrots, peeled and cut into 1/2-inch pieces\n1 medium yellow onion, peeled and diced\n2 garlic cloves, minced\nPinch cayenne (optional) \n2 cups good-quality canned chicken broth \n1-2 tablespoons heavy cream\n1/2 cup shelled fresh peas or frozen peas\napproximately 1/2 pound frozen puff pastry, defrosted following package instructions\n1 large egg\n\nMelt the butter in a large, tall saucepan. Add flour and whisk to ensure there are no lumps before adding the chicken stock. Cook out this mixture for 5-10 minutes while continuously stirring. Check the consistency by dipping the back of a spoon into the sauce and running your finger along the spoon. You want the sauce to cling to the spoon and not run over the swipe you made. \n\nContinue to cook and stir the sauce over medium heat until you reach the correct consistency. Season with the salt, pepper, and cayenne (if using). Taste the sauce and see if your sauce needs more seasoning. Add the cream now and stir to combine. Next, add the shredded chicken potatoes, carrots, onion, and garlic to the sauce. Cook the vegetables in the sauce for 2-3 minutes. Transfer the filling into a clean bowl and chill in the fridge for 1 hour, or until cool. \n\nPreheat the oven to 400˚F / 200 ˚C. \n\nRoll out the puff pastry, using a bit of extra flour to ensure the pastry doesn’t stick to your work surface. Use a bowl or plate about an inch larger than the dish you are cooking your pot pie in as a guide to cut out your pastry. \n\n\nCarefully spoon in your chilled filling into your dish.\n\n Break the egg in a small dish and add a tablespoon of water or cream. Whisk with a fork and brush this egg wash on the edges of your dish. Brush a little of your egg wash on the rim of your dish. Lay your pastry over the top, being careful not to stretch the pastry. Seal the edges of the pastry by lightly pushing it onto the rim of your dish to make sure it is secure. Then brush the top and sides with more egg wash. Place your pot pies on a large baking sheet and bake for 25-35 minutes. Until your pastry is a nice golden, dark brown and there are no more greyish raw patches. \n\nLet cool for 5 minutes before serving. All Tasty music provided by Audio Network and Warner Chappell Inc.  Used with permission",
  "thumbnails": {
    "default": {
      "height": 90,
      "url": "https://i.ytimg.com/vi/_eOA-zawYEA/default.jpg",
      "width": 120
    },
    "medium": {
      "height": 180,
      "url": "https://i.ytimg.com/vi/_eOA-zawYEA/mqdefault.jpg",
      "width": 320
    },
    "high": {
      "height": 360,
      "url": "https://i.ytimg.com/vi/_eOA-zawYEA/hqdefault.jpg",
      "width": 480
    },
    "standard": {
      "height": 480,
      "url": "https://i.ytimg.com/vi/_eOA-zawYEA/sddefault.jpg",
      "width": 640
    },
    "maxres": {
      "height": 720,
      "url": "https://i.ytimg.com/vi/_eOA-zawYEA/maxresdefault.jpg",
      "width": 1280
    }
  }
}