{
  "title": "Jiggly cake — homemade giant Castella",
  "video_published_at": "2020-09-10T18:00:05Z",
  "start_at": null,
  "end_at": null,
  "video_id": "_vfdupZNKqo",
  "published_at": "2021-01-05T03:49:51Z",
  "description": "Thanks to Native for sponsoring this video! Save 33% on your first Native Deodorant Pack — normally $36, but you’ll get it for $24. Use my code, ADAMRAGUSEA → http://bit.ly/nativeadamragusea\n\n***RECIPE***\n\nBy weight, 4 part eggs to 1 part oil (or melted butter), 1 part milk, 1 part cake flour, 1 part sugar. (A large egg minus its shell is generally ~50 grams.) Additionally, 1/2-1g salt per egg, vanilla (or some other extract), cream of tarter (~1g for every four eggs), 1/10th the weight of the flour in corn starch (optional).\n\nMake one egg's worth of batter for every 22 inches (360 cm) of pan volume (sorry I said “area” in the vid and gave the wrong cm figure!), where volume is width x length x height.\n\nYou'll need big pan and an even bigger pan you can nest it into. With the pans nested, pour enough water into the bigger pan to come at least halfway up the sides of the smaller pan. Take the smaller pan out, and put the bigger pan (with the water) into your oven. Start the oven heating to 325 F (160 C) — no convection fan, unless you prefer a dry, cracked top. (If using convection, probably lower the heat to 300 F, 150C.)\n\nCoat all interior sides of the smaller pan with parchment paper. Leave enough excess that you can grab to sling the cake out when it's done.\n\nSeparate all the eggs into two large bowls. Into the bowl with the yolks, put the oil (or melted butter), milk, flour, salt, cornstarch (if using — it makes the interior crumb finer), and a big glug of vanilla or any extract you're using. Weigh out the sugar in a separate bowl — I like to use a little more than 1 part sugar, but all of these proportions can be altered to various effects.\n\nPut the cream of tarter into the egg whites and beat them until they're very fluffy. Beat in the sugar in a couple installments until you have medium peaks — or stiff peaks if you want an even puffier cake, though that will likely result in a cracked top. Beat the yolk mixture until smooth. Gradually combine the white mixture and the yolk mixture until homogenous.\n\nPour the batter into the parchment-lined cake pan, and drop the pan into the water bath in the oven. (Don't worry if it splashes — steam is good for cakes.) Bake until a skewer to the center comes out clean — probably at least an hour, though it will depend on the size.\n\nWhen the cake is done, use the parchment as a sling to lift it out before slicing with the longest knife you have.",
  "thumbnails": {
    "default": {
      "height": 90,
      "url": "https://i.ytimg.com/vi/_vfdupZNKqo/default.jpg",
      "width": 120
    },
    "medium": {
      "height": 180,
      "url": "https://i.ytimg.com/vi/_vfdupZNKqo/mqdefault.jpg",
      "width": 320
    },
    "high": {
      "height": 360,
      "url": "https://i.ytimg.com/vi/_vfdupZNKqo/hqdefault.jpg",
      "width": 480
    },
    "standard": {
      "height": 480,
      "url": "https://i.ytimg.com/vi/_vfdupZNKqo/sddefault.jpg",
      "width": 640
    },
    "maxres": {
      "height": 720,
      "url": "https://i.ytimg.com/vi/_vfdupZNKqo/maxresdefault.jpg",
      "width": 1280
    }
  }
}