{
  "title": "The Food Lab: How to Roast the Best Potatoes of Your Life | Serious Eats",
  "video_published_at": "2016-12-05T22:55:55Z",
  "start_at": null,
  "end_at": null,
  "video_id": "_wx__fEyDj0",
  "published_at": "2017-04-09T03:04:24Z",
  "description": "In this video, Kenji López-Alt teaches you how to roast the best potatoes of your life. These roast potatoes maximize the crisp-to-creamy contrast in each chunk of potato. We've tested and retested every variable, from cut size to potato type to boiling and roasting methods. The result is this recipe, which we firmly and un-humbly believe will deliver the greatest roast potatoes you've ever tasted: incredibly crisp and crunchy on the outside, with centers that are creamy and packed with potato flavor. We dare you to make them and not love them. We double-dare you.\n\nFull recipe: https://www.seriouseats.com/recipes/2016/12/the-best-roast-potatoes-ever-recipe.html\n\nYou might also like...\nKenji's Kimchi-Brined Fried Chicken Sandwich: https://youtu.be/Tu5FEVUMWVU\nHow to Butter-Baste a Steak: https://youtu.be/0sQjXR5SFYo\nHow to Make the Best Roast Beef: https://youtu.be/oIsgSzYC6Nk\n\nSubscribe to Serious Eats!\nhttps://bit.ly/2BIlM59\n\nFollow Us Elsewhere:\nhttps://facebook.com/seriouseats\nhttps://twitter.com/seriouseats\nhttps://instagram.com/seriouseats\nhttps://reddit.com/r/seriouseats \n\nSerious Eats is a leading resource for all things food and drink: meticulously tested recipes that really work; in-depth, science-based explanations of cooking techniques; detailed reviews of cooking equipment; and guides to ingredients, dishes, and cuisines. We bring a democratic yet scientific approach to cooking the best dishes, busting food myths, and delivering strong opinions on what you should eat next, where, when, and why.",
  "thumbnails": {
    "default": {
      "height": 90,
      "url": "https://i.ytimg.com/vi/_wx__fEyDj0/default.jpg",
      "width": 120
    },
    "medium": {
      "height": 180,
      "url": "https://i.ytimg.com/vi/_wx__fEyDj0/mqdefault.jpg",
      "width": 320
    },
    "high": {
      "height": 360,
      "url": "https://i.ytimg.com/vi/_wx__fEyDj0/hqdefault.jpg",
      "width": 480
    },
    "standard": null,
    "maxres": null
  }
}