{
  "title": "Dan Dan Noodles | Kenji's Cooking Show",
  "video_published_at": "2020-04-29T13:13:58Z",
  "start_at": null,
  "end_at": null,
  "video_id": "AFE-MzzuGmc",
  "published_at": "2020-05-05T03:15:14Z",
  "description": "There are a million versions of Dan Dan Noodles, the one dish you should eat if you want to understand the ma-la (numbing-hot) flavor profile. I have four or five recipes for them myself, like this one: https://www.youtube.com/watch?v=uhYEy3PA0RI\n\nOr this one: https://www.youtube.com/watch?v=XcTNQwj6lHo\n\nOr this one: https://www.seriouseats.com/recipes/2013/02/vegan-dan-dan-noodles-recipe.html\n\nOr even this one: https://www.seriouseats.com/recipes/2011/04/dan-dan-noodles-recipe.html\n\nI do not follow any of these recipes - or any recipe at all - when I'm making them at home.\n\nIn the short time I spent in Chengdu, I found that dan dan noodles are to Sichuan what the hamburger is to the U.S.: They're ubiquitous, there are certain expectations, but there are no hard and fast rules other than the main ingredients (noodles, chili oil, Sichuan peppercorns, and vinegar) and the manner in which they're served (fast and cheap). Beyond that they can be soupy or not, they may or may not have sesame or peanuts, they might have greens, or not. Sometimes they have raw garlic or even a sprinkle of sugar on top, etc etc.\n\nIn other words, get the chili oil and Sichuan peppercorn bit right, and the rest is really up to you.\n\nPLEASE READ!\n\nThe coronavirus has hit many folks hard, including first responders and hospital workers, individuals and families who were already food insecure, and service industry employees who are, for the large part, currently out of a job.\n\nMy goal is to help fix both these problems in the best way I know how to contribute: organizing people, and cooking food.\n\nIf you would like to donate to our free meal fund, head to https://www.toasttab.com/wursthall/ where you can buy a boxed meal for someone in need. These boxes go directly to the frontline workers and food insecure families who have been hit hardest by the coronavirus pandemic. They also allow me to hire back my kitchen team to cook and pack these meals (in a safe, clean way). So far we have served nearly 500 meals, and the number goes up every week.\n\nIf you would like to make a monthly recurring donation of any size, head to my Patreon account at https://www.patreon.com/kenjilopezalt. 100% of the proceeds go directly to the free meal fund. You can also help by buying my books at bookshop.org/shop/kenjilopezalt where 100% of my sales commission goes to the free meal fund, and an additional 10% goes to independent book stores around the country.\n\nFinally, stay safe. Here is my guide to food safety and the coronavirus, written with the consultation of virologists, food safety experts, and infectious disease specialists, and kept up to date as new research emerges: https://www.seriouseats.com/2020/03/food-safety-and-coronavirus-a-comprehensive-guide.html#comment-anchor-452226",
  "thumbnails": {
    "default": {
      "height": 90,
      "url": "https://i.ytimg.com/vi/AFE-MzzuGmc/default.jpg",
      "width": 120
    },
    "medium": {
      "height": 180,
      "url": "https://i.ytimg.com/vi/AFE-MzzuGmc/mqdefault.jpg",
      "width": 320
    },
    "high": {
      "height": 360,
      "url": "https://i.ytimg.com/vi/AFE-MzzuGmc/hqdefault.jpg",
      "width": 480
    },
    "standard": {
      "height": 480,
      "url": "https://i.ytimg.com/vi/AFE-MzzuGmc/sddefault.jpg",
      "width": 640
    },
    "maxres": {
      "height": 720,
      "url": "https://i.ytimg.com/vi/AFE-MzzuGmc/maxresdefault.jpg",
      "width": 1280
    }
  }
}