{
  "title": "Roast goose with Christmas spices, black cherry gravy, goose-fat roast potatoes and mustard greens",
  "video_published_at": "2020-12-10T19:00:01Z",
  "start_at": null,
  "end_at": null,
  "video_id": "aonZ5whtMRg",
  "published_at": "2020-12-11T03:59:09Z",
  "description": "Thanks to Squarespace for sponsoring this video! Go to Squarespace.com for a free trial, and when you’re ready to launch, go to http://squarespace.com/ragusea and add code “RAGUSEA\" at checkout to save 10% off your first purchase of a website or domain.\n\n***RECIPE, SERVES 6-8***\n\n1 10-12 lb (4.5-5.5 kg) goose\n3 lb (1.36 kg) small waxy potatoes, skin on\n1 lb (454g) mustard greens, washed and chopped\n1 quart (946mL) black cherry juice\n1 quart (946mL) chicken stock\n1 bunch fresh sage\nflour\nChristmassy spices (I used ground cinnamon, ginger, nutmeg and cloves)\ndried chili flakes (or any dried spicy chili product, like cayenne)\nsalt\npepper\n\nPut the goose in a deep roasting tray. Take everything out of the cavity — chunks of fat, the neck, any giblets — and lay it around the goose on the tray. Use a sharp knife to score a diamond pattern over the goose's entire skin and fat layer. Season all sides heavily with the Christmas spices and salt, and be sure to rub the spices into the scored skin. \n\nPosition the bird breast-side up in the pan, and put it in a cold oven. Turn the heat on 300ºF (150ºC).\n\nWhile the bird is roasting, boil the potatoes until they're just fork-tender. Drain them and lay them out on a roasting tray or lipped baking sheet in a single layer.\n\nRoast the goose until the internal temperature of the breast is a few degrees short of your desired doneness. If you want it pink, cook the breast to 135-140ºF (57-60ºC), which took me about 45 minutes, but be aware the USDA says cooking any poultry short of 165ºF (74ºC) entails some risk of foodborne illness.\n\nTake the bird out of the oven and cut off both sides of the breast whole. Cover them and set them aside. Flip the goose around so that the thighs are facing up — you can stabilize the bird by letting its leg bones hang over the edge of the tray.\n\nLadle enough rendered goose fat onto the potatoes to thoroughly coat them and the bottom of their tray. Season the potatoes heavily with salt and pepper.\n\nPut the bird and the potatoes in the oven, and turn the heat up to 400ºF (200ºC). Roast the bird until the thigh reads at least 175ºF (80ºC), which took me another 45 minutes. Take the goose and the potatoes out. Use a glass to crush each potato until you feel the skin pop open, and put them back in the oven.\n\nTake the goose out of the roasting tray and put it aside to rest. Use a ladle to remove as much of the rendered fat from the tray as possible, while leaving behind all of the solids. Put the fat aside — you'll need it later, and whatever you don't use you can freeze.\n\nTurn the burners under the roasting tray on medium heat, and stir enough flour into the remaining fat to make a loose paste. Fry it until it looks and smells brown, then gradually stir in the cherry juice, deglazing the pan as you go. Stir in enough chicken stock to give you the thickness you want, keeping in mind that the flour won't fully thicken the liquid until it boils. Season with salt, pepper and chili flakes to taste. Simmer the gravy for as long as you can to extract flavor from the solids, stirring every now and then to make sure nothing sticks and burns.\n\nCheck on the potatoes — when their bottoms are brown, flip each of them over and return them to the oven.\n\nCut the wings and leg quarters off the goose. Separate the legs from the thighs, and the drumettes from the wing tips. Feel around for any other bits of meat on the carcass you can tear off, then bag up the carcass and the wings tips for stock/soup and put them away.\n\nStrain all the solids out of the gravy and throw them away. If the gravy is too thick, water it down a bit. Set it aside somewhere to keep warm.\n\nWhen the potatoes are brown and crispy all over, toss them with fresh sage and set them aside somewhere to keep warm.\n\nRight before you want to eat, heat a thick layer of goose fat over medium-high heat in your widest pan. Put the goose breasts in the pan, skin-side down, and fry them until the skin is crispy and the meat is re-heated. Take them out and do the same with the thighs, legs and drumettes. Take them out, then put in the mustard greens.\n\nYou'll probably need to wilt down some of the greens before you can add more in. Pouring a little water in the pan will help to get the greens cooking and deglaze the pan. Once all the greens are wilted, stir in salt and pepper to taste. Set the greens aside somewhere to keep warm.\n\nCarve your meat and eat! Merry Christmas (if you're into that)!",
  "thumbnails": {
    "default": {
      "height": 90,
      "url": "https://i.ytimg.com/vi/aonZ5whtMRg/default.jpg",
      "width": 120
    },
    "medium": {
      "height": 180,
      "url": "https://i.ytimg.com/vi/aonZ5whtMRg/mqdefault.jpg",
      "width": 320
    },
    "high": {
      "height": 360,
      "url": "https://i.ytimg.com/vi/aonZ5whtMRg/hqdefault.jpg",
      "width": 480
    },
    "standard": {
      "height": 480,
      "url": "https://i.ytimg.com/vi/aonZ5whtMRg/sddefault.jpg",
      "width": 640
    },
    "maxres": {
      "height": 720,
      "url": "https://i.ytimg.com/vi/aonZ5whtMRg/maxresdefault.jpg",
      "width": 1280
    }
  }
}