{
  "title": "Award Winning Pickled Eggs - Kansas 2 time winner",
  "video_published_at": "2017-01-22T20:43:32Z",
  "start_at": null,
  "end_at": null,
  "video_id": "aR77JU-VVMY",
  "published_at": "2021-05-19T04:32:50Z",
  "description": "My \"Award winning\"  pickled eggs are easy to make and super yummy with beer.  I won Blue ribbons 2 different years for my eggs and Jerky...Yep...Local county fair.  Also don't forget the 1/2 fresh squeezed lime per quart.  Forgot in video but it's in the description.  The Lime takes these eggs to the MOON.  Ready to eat in 24 hours and by 48 hours.  \n\nThe 4 day thing is for the Unwashed Farm Fresh eggs we use.  Eggs straight from a chicken are hard to peel so they need to sit a few days so the egg's sulphur can soften the shell a bit.  Store bought eggs can be used immediately and should be kept cold.  Unwashed Farm Fresh eggs have a natural \"bloom\" coating allowing them to be stored at room temperature for weeks.  \n\nThis recipe is NOT meant for long term storage like traditional canning methods.  Store them a couple days at room temp...or put them in the refrigerator for a week or so.  Still tastes good...just a little rubbery.  \n\nMy eggs are great beer snacks food that make horrible farts with good hang time.  Perfect for the car!  In our house a quart doesn't last two days.  Our downtown pool hall has a 2 gallon jar of pickled eggs on the counter and I know for a fact they are 6 Months Old.  They got that Jar in December and it's now May 12 with a couple dozen remaining to sell.  The pool hall eggs sit at the bottom in cloudy flat vinegar right next to the Jars of Turkey Gizzards and Pigs Feet.  All sitting on the counter NOT refrigerated.  Those Three delicacies are self service with metal tongs hanging on a hook.\n\nWe Midwest folks (including Texas) love our traditional Cowboy food.  We fight over who's first in line at our Lions Club Mountain Oyster feast.  All you can Eat $12 with Pig and Cow testicales served with hot pickles and white bread.",
  "thumbnails": {
    "default": {
      "height": 90,
      "url": "https://i.ytimg.com/vi/aR77JU-VVMY/default.jpg",
      "width": 120
    },
    "medium": {
      "height": 180,
      "url": "https://i.ytimg.com/vi/aR77JU-VVMY/mqdefault.jpg",
      "width": 320
    },
    "high": {
      "height": 360,
      "url": "https://i.ytimg.com/vi/aR77JU-VVMY/hqdefault.jpg",
      "width": 480
    },
    "standard": null,
    "maxres": null
  }
}