{
  "title": "Glazed braised short ribs",
  "video_published_at": "2020-02-20T19:00:01Z",
  "start_at": null,
  "end_at": null,
  "video_id": "BFaQbSlDM0k",
  "published_at": "2021-02-23T04:33:04Z",
  "description": "Thanks to Squarespace for sponsoring this video! Go to Squarespace.com for a free trial, and when you’re ready to launch, go to http://squarespace.com/ragusea and add code “RAGUSEA\" at checkout to save 10% off your first purchase of a website or domain.\n\n***RECIPE, SERVES 4***\n\n4 lb (2 kg) beef short ribs (about 10 — at least two meaty ones per person)\n1 red onion\n2-3 carrots\n1-2 celery stalks\n1 tbsp (15 ml) tomato paste\n1 bottle (750 ml) dry white wine (anything cheap is fine, or use stock + 50-100 ml balsamic vinegar)\n1 star anise (a lot of people don't like this flavor — use with caution, or use another spice)\n1 tsp coriander seeds\noil\nsalt\npepper\nvinegar\n2-3 big potatoes for mash\nmilk\nfresh rosemary\nfrozen peas\nbutter\n\nPut a little oil in a large lidded pot on moderate heat and slowly brown the short ribs on all sides. Do not let anything burn. If you're doubling this recipe, brown the ribs in two batches. Take them them out, and throw in the roughly chopped onion, carrots and celery. Let the veggies brown for a minute, then stir in the tomato paste. Right before the tomato paste burns (it'll happen in a minute), deglaze with the wine. Put in the anise, coriander, pepper and a big pinch of salt. Put the ribs back in, reduce the heat to a bare simmer, cover, and let cook until they're as soft as you want them. I like them very soft, so I cook them for 8 hours.\n\nVery carefully remove the delicate meat to a plate. Strain the braising liquid and discard the solids. Either de-fat the liquid with a gravy separator, or cool it down with some ice cubes and throw it in the fridge — you can easily lift the solidified fat out the next day. When the meat is cool enough to handle, remove the bones and gently scrape off any outer bits of connective tissue or fat you don't want to eat. If you're chilling your braising liquid, cover the meat and throw it in the fridge.\n\nAfter you've de-fatted your braising liquid, reserve the fat and throw the liquid into a wide pan. Bring it to a boil and reduce it to a glaze — about a half hour. Stir it constantly and maybe reduce the heat toward the end to keep it from sticking and burning. Taste the glaze, and give it some more seasoning and maybe some vinegar to taste (it should taste too strong on its own). Reduce the heat to warm and carefully toss the meat in the glaze — don't break the pieces up — then cover and let the meat re-heat. It can hold like that for hours — if the glaze dries out, just mix in some water.\n\nWhile the sauce is reducing, peel, chunk up and boil your potatoes until easily pierced with a fork. Drain them off, put in a glug of milk, a big pinch of salt, and the reserved fat from the beef. Mash, stir and taste. Add more milk and salt until you like it. Chop up the fresh rosemary and stir it into the mash right before you eat.\n\nThaw some frozen peas and add butter and salt to taste. When you get everything on the plate, be sure to spoon some extra glaze over the beef.",
  "thumbnails": {
    "default": {
      "height": 90,
      "url": "https://i.ytimg.com/vi/BFaQbSlDM0k/default.jpg",
      "width": 120
    },
    "medium": {
      "height": 180,
      "url": "https://i.ytimg.com/vi/BFaQbSlDM0k/mqdefault.jpg",
      "width": 320
    },
    "high": {
      "height": 360,
      "url": "https://i.ytimg.com/vi/BFaQbSlDM0k/hqdefault.jpg",
      "width": 480
    },
    "standard": {
      "height": 480,
      "url": "https://i.ytimg.com/vi/BFaQbSlDM0k/sddefault.jpg",
      "width": 640
    },
    "maxres": {
      "height": 720,
      "url": "https://i.ytimg.com/vi/BFaQbSlDM0k/maxresdefault.jpg",
      "width": 1280
    }
  }
}