{
  "title": "Five-Ingredient Biscuits and Sausage Gravy | Kenji’s Cooking Show",
  "video_published_at": "2020-10-08T23:50:39Z",
  "start_at": null,
  "end_at": null,
  "video_id": "BoFkDmTm2uc",
  "published_at": "2020-10-13T02:37:31Z",
  "description": "Ingredients:\n\nFor every 3 biscuits:\n\n1 cup (5 oz.; 150g) all purpose or soft wheat flour\n1.5 teaspoons (about 5g) baking powder\n1/4 teaspoon (about 3g) kosher salt (if using table salt, that’s 1/8th teaspoon)\n5 ounces (about 2/3rds of a cup) heavy cream\n\nFor the sausage gravy:\n4 ounces (120g) breakfast sausage (plus a little butter or oil if it’s too lean)\n1 tablespoon flour\n1 cup heavy cream (milk will also work)\nFreshly ground black pepper and salt\n\n1. Preheat an oven to 425F. Combine the flour, baking powder, and salt in a bowl. Add the heavy cream and mix into a shaggy dough. Do not knead it. Dump it onto a floured work surface and for it into a rough log about 3 inches wide and 9 inches long. Cut it into three biscuits with a sharp knife. Transfer to a baking sheet and bake until golden brown, about 15 minutes. (You can brush them with heavy cream or melted butter before baking for darker and more even browning, if you wish.)\n\n2. Meanwhile make the gravy: cook the sausage in a medium skillet over medium-high heat, breaking it up with a wooden spoon until it’s not longer pink. If the pan is very dry, add a couple teaspoons of oil or butter to moisten it. Add 1 tablespoon of flour and stir to incorporate. Whisk in the heavy cream or milk. Bring to a simmer while stirring frequently and adjust the consistency with more heavy cream or milk if it’s too thick. Season aggressively with black pepper and salt.\n\n3. When the biscuits are done, transfer to a plate and smother with the sausage gravy.  Serve.",
  "thumbnails": {
    "default": {
      "height": 90,
      "url": "https://i.ytimg.com/vi/BoFkDmTm2uc/default.jpg",
      "width": 120
    },
    "medium": {
      "height": 180,
      "url": "https://i.ytimg.com/vi/BoFkDmTm2uc/mqdefault.jpg",
      "width": 320
    },
    "high": {
      "height": 360,
      "url": "https://i.ytimg.com/vi/BoFkDmTm2uc/hqdefault.jpg",
      "width": 480
    },
    "standard": {
      "height": 480,
      "url": "https://i.ytimg.com/vi/BoFkDmTm2uc/sddefault.jpg",
      "width": 640
    },
    "maxres": {
      "height": 720,
      "url": "https://i.ytimg.com/vi/BoFkDmTm2uc/maxresdefault.jpg",
      "width": 1280
    }
  }
}