{
  "title": "Pan-Seared Chicken Breasts with Pan Sauce and Spring Vegetables; Kenji's Cooking Show",
  "video_published_at": "2020-04-22T08:48:46Z",
  "start_at": null,
  "end_at": null,
  "video_id": "Bt8YgEr-9is",
  "published_at": "2021-05-03T21:17:25Z",
  "description": "Hi. I've decided to call this series Kenji's Cooking Show because \"The Cooking Show\" was already taken, and this show is about me, cooking. There is not much else other than a 2-3 second introduction and a whole lot of rambling.\n\nIn this episode I'm cooking airline chicken breasts with a morel mushroom pan sauce and glazed spring vegetables. You can use regular mushrooms, any old chicken breast, and whatever vegetables you like. You don't have to make it exactly like I do, or even make it at all.\n\nPLEASE READ!\n\nThe coronavirus has hit many folks hard, including first responders and hospital workers, individuals and families who were already food insecure, and service industry employees who are, for the large part, currently out of a job.\n\nMy goal is to help fix both these problems in the best way I know how to contribute: organizing people, and cooking food.\n\nIf you would like to donate to our free meal fund, head to https://www.toasttab.com/wursthall/ where you can buy a boxed meal for someone in need. These boxes go directly to the frontline workers and food insecure families who have been hit hardest by the coronavirus pandemic. They also allow me to hire back my kitchen team to cook and pack these meals (in a safe, clean way). So far we have served nearly 500 meals, and the number goes up every week.\n\nIf you would like to make a monthly recurring donation of any size, head to my Patreon account at https://www.patreon.com/kenjilopezalt. 100% of the proceeds go directly to the free meal fund. You can also help by buying my books at bookshop.org/shop/kenjilopezalt where 100% of my sales commission goes to the free meal fund, and an additional 10% goes to independent book stores around the country.\n\nFinally, stay safe. Here is my guide to food safety and the coronavirus, written with the consultation of virologists, food safety experts, and infectious disease specialists, and kept up to date as new research emerges: https://www.seriouseats.com/2020/03/food-safety-and-coronavirus-a-comprehensive-guide.html#comment-anchor-452226",
  "thumbnails": {
    "default": {
      "height": 90,
      "url": "https://i.ytimg.com/vi/Bt8YgEr-9is/default.jpg",
      "width": 120
    },
    "medium": {
      "height": 180,
      "url": "https://i.ytimg.com/vi/Bt8YgEr-9is/mqdefault.jpg",
      "width": 320
    },
    "high": {
      "height": 360,
      "url": "https://i.ytimg.com/vi/Bt8YgEr-9is/hqdefault.jpg",
      "width": 480
    },
    "standard": {
      "height": 480,
      "url": "https://i.ytimg.com/vi/Bt8YgEr-9is/sddefault.jpg",
      "width": 640
    },
    "maxres": {
      "height": 720,
      "url": "https://i.ytimg.com/vi/Bt8YgEr-9is/maxresdefault.jpg",
      "width": 1280
    }
  }
}