{
  "title": "Chipotle-glazed shrimp with garlic lime rice",
  "video_published_at": "2020-06-18T18:00:02Z",
  "start_at": null,
  "end_at": null,
  "video_id": "C2LfTg_Ft-w",
  "published_at": "2020-08-19T04:43:19Z",
  "description": "Thanks to Squarespace for sponsoring this video! Go to Squarespace.com for a free trial, and when you’re ready to launch, go to http://squarespace.com/ragusea and add code “RAGUSEA\" at checkout to save 10% off your first purchase of a website or domain.\n\n\"Sear, Sauce, and Serve,\" by Tony Rosenfeld: https://www.runningpress.com/titles/tony-rosenfeld/sear-sauce-and-serve/9780762442270/\n\n***RECIPE, SERVES 2-4***\n\nFor the shrimp\n\n1 lb (.5 kg) peeled shrimp on the large side\n1/2 of a standard 7.5 oz (212 g) can chipotle peppers in adobo sauce, finely chopped\n1/3-1/2 cup (100 ml)  honey\n1 tbsp (15 ml) tomato paste\n1-2 limes, or 1-2 tbsp (30 ml) vinegar\nsalt\n\nFor the rice\n\n1 1/2 cups (300 g) basmati rice\n2 1/4 cups (530 ml) water\n3-4 garlic cloves, peeled and chopped\n1 (5 g) teaspoon salt\n1 lime\n1 bunch cilantro\nolive oil\n\nStart the rice by putting a little olive oil in a pot on medium heat. Stir in the dry rice and let it toast for a minute (rinse the rice first if you want fluffy, separate grains). Stir in the garlic and let it fry for a minute. Put in the water, salt, and the zest of the lime. Bring to a boil, then cover and reduce the heat to a bare simmer. When the rice is done, tear in as much cilantro as you'd like and squeeze in some lime juice (go easy at first). Stir, taste, and adjust.\n\nStart the shrimp by combining the glaze ingredients — the honey, finely chopped chipotles with adobo sauce, and tomato paste. If you don't want to squeeze lime over your shrimp at the table, put the juice of a lime or some vinegar into the glaze. Put the peeled shrimp on skewers.\n\nPut an oven rack at the highest position and turn the broiler (grill) on maximum. Put the shrimp skewers on an oven-safe rack positioned over a lipped baking sheet. Use a pastry brush to glaze the top-facing side of the shrimp, and then sprinkle salt on them. \n\nPut the whole rig under the broiler for a few minutes. Pull it out, glaze the top side again, and broiler for a few minutes more until the top side looks cooked. Pull it out, flip the skewers, glaze them again, and sprinkle salt on this side. If the run-off into the baking sheet is starting to burn, pour some water into it. Broil for a few minutes, then glaze again. Broil this fourth and final coat until you have some nice color — total cooking will probably be 10-15 minutes, depending on the size of your shrimp and the strength of your broiler.\n\nServe a skewer with some rice and a lime wedge for squeezing over the shrimp.",
  "thumbnails": {
    "default": {
      "height": 90,
      "url": "https://i.ytimg.com/vi/C2LfTg_Ft-w/default.jpg",
      "width": 120
    },
    "medium": {
      "height": 180,
      "url": "https://i.ytimg.com/vi/C2LfTg_Ft-w/mqdefault.jpg",
      "width": 320
    },
    "high": {
      "height": 360,
      "url": "https://i.ytimg.com/vi/C2LfTg_Ft-w/hqdefault.jpg",
      "width": 480
    },
    "standard": {
      "height": 480,
      "url": "https://i.ytimg.com/vi/C2LfTg_Ft-w/sddefault.jpg",
      "width": 640
    },
    "maxres": {
      "height": 720,
      "url": "https://i.ytimg.com/vi/C2LfTg_Ft-w/maxresdefault.jpg",
      "width": 1280
    }
  }
}