{
  "title": "Smoked Oxtails | Beef Oxtail Recipe Smoked on UDS Smoker",
  "video_published_at": "2017-10-13T14:28:10Z",
  "start_at": null,
  "end_at": null,
  "video_id": "cmzErnIysV4",
  "published_at": "2021-03-01T02:41:38Z",
  "description": "Smoked Beef Oxtail Recipe \n\nFor more barbecue and grilling recipes visit: http://howtobbqright.com/\n\nDon’t let the name scare you; Oxtails are some serious Soul Food that’s guaranteed to excite your taste buds!  In the south we braise oxtails for hours in a rich broth and serve them with hearty sides like rice, mashed taters, or even collard greens.  \n\nThe Oxtail is a cut of beef taken from the tail of a cow. It has plenty of heavily marbled meat surrounding the bone; and when it’s cooked Low and Slow, it reminds me of an extra-rich tasting short rib or pot roast.  \n\nYou want need a lot of special ingredients for this recipe; just grab some Oxtail and a few veggies from the supermarket and let’s get to smokin’!\n\nRemove any excess fat from the outside of each piece of oxtail and season with a good dose of your favorite BBQ seasoning.  I’m using my Killer Hogs Hot Rub for a little extra kick and it gives the bark a nice color.  \n\nGo ahead and fire up your smoker and bring the temp to 275⁰.  For this cook I have my Gateway Drum rolling right along with a little Pecan wood and lump.  You can use any pit for this cook just hold the temp steady.\n\nPlace the Oxtail pieces on the cooking grate and smoke them for about 2 hours. You’ll want to flip them half way through to get color on both sides. \n\nWhile the smoke is rolling go ahead and put together the braising liquid. I start with fresh carrots, celery, onion, and garlic sautéed for just a few minutes. Then add the liquids: Worcestershire, Balsamic Vinegar, Red Wine, and a heaping tablespoon of tomato paste.  Reduce this mixture to concentrate the flavors and then add 3 cups of beef broth and a tablespoon of beef bouillon base.  Let the liquid simmer for about 10 minutes and remove from heat.  \n\nOnce the oxtail pieces develop a dark color on the smoker, remove them from the heat and place in a large cast iron pot (dutch oven).  Pour the braising liquid in with them and cover with foil.  Place the pot on the smoker and let it roll until the Oxtails are practically falling apart.  I use a fork to check their progress and when the meat easily separates, it’s done.  \n\nRemove the dutch oven from the smoker and carefully transfer each piece of oxtail to a platter.  Cover loosely with aluminum foil and pour the braising liquid through a strainer.  Give it a few minutes to settle and spoon any fat off the top.  \n\nTo serve this dish I go family style. Cook a cup or two of long grain rice according to the package directions and spread it out on a big platter.  Arrange the pieces of Oxtail over the rice and ladle the strained braising liquid over the top for a sauce.  \n\nGarnish it with a little green onion slices or fresh parsley and you’re ready to serve.  This is a hearty dish that will stick to your ribs and put a smile on your face; I hope you give it a try!\n\nFor Killer Hogs BBQ Sauce, Rub and Competition BBQ equipment, visit: https://h2qshop.com/",
  "thumbnails": {
    "default": {
      "height": 90,
      "url": "https://i.ytimg.com/vi/cmzErnIysV4/default.jpg",
      "width": 120
    },
    "medium": {
      "height": 180,
      "url": "https://i.ytimg.com/vi/cmzErnIysV4/mqdefault.jpg",
      "width": 320
    },
    "high": {
      "height": 360,
      "url": "https://i.ytimg.com/vi/cmzErnIysV4/hqdefault.jpg",
      "width": 480
    },
    "standard": {
      "height": 480,
      "url": "https://i.ytimg.com/vi/cmzErnIysV4/sddefault.jpg",
      "width": 640
    },
    "maxres": {
      "height": 720,
      "url": "https://i.ytimg.com/vi/cmzErnIysV4/maxresdefault.jpg",
      "width": 1280
    }
  }
}