{
  "title": "Hometown Hero: The Legend of New York's Chopped Cheese",
  "video_published_at": "2016-11-16T16:00:04Z",
  "start_at": null,
  "end_at": null,
  "video_id": "cugl5mmfcxY",
  "published_at": "2017-06-16T04:49:24Z",
  "description": "First We Feast is proud to present our first documentary, \"Hometown Hero: The Legend of New York's Chopped Cheese.\"\n\nTo understand the real New York, you've got to understand the chopped cheese. So, what exactly is a chopped cheese?\n\nOn the surface, that would seem simple. The bodega specialty gets its name from the \"chopping\" of hamburger patties, which occurs on the griddles in delis throughout Queens, Brooklyn, the Bronx, and Harlem. The minced meat is covered in cheese, slipped into a roll or hero, and dressed with standard-issue condiments.\n\nBut when we began to peel back the layers and ask questions about its origin story, how it became so popular, and why it's so difficult to find one in lower Manhattan, we were introduced to a much deeper tale fueled by borough rivalries, hip-hop mythology, and hard-to-swallow truths, giving us a more meaningful glimpse into what makes this city tick.\n\n\"Hometown Hero: The Legend of New York's Chopped Cheese\" gives you a chance to hear directly from New Yorkers—such as cooking collective Ghetto Gastro, rapper Bodega Bamz, and humorist Jeffrey Almonte—who want to protect the sandwich from outsiders, re-mix it in professional kitchens, or simply remind you that there's more to this sandwich than meets the eye. \n\nHometown Heroes won Best Short Film, Audience Choice, and Best Filmmaker at the 2017 NYC Food Film Festival.\n\nSubscribe to First We Feast on YouTube: http://goo.gl/UxFzhK\n\nCheck out more of First We Feast here:\nhttp://firstwefeast.com/\nhttps://twitter.com/firstwefeast\nhttps://www.facebook.com/FirstWeFeast\nhttp://instagram.com/firstwefeast\n\nFirst We Feast videos offer an iconoclastic view into the culinary world, taking you behind-the-scenes with some of the country's best chefs and finding the unexpected places where food and pop culture intersect.",
  "thumbnails": {
    "default": {
      "height": 90,
      "url": "https://i.ytimg.com/vi/cugl5mmfcxY/default.jpg",
      "width": 120
    },
    "medium": {
      "height": 180,
      "url": "https://i.ytimg.com/vi/cugl5mmfcxY/mqdefault.jpg",
      "width": 320
    },
    "high": {
      "height": 360,
      "url": "https://i.ytimg.com/vi/cugl5mmfcxY/hqdefault.jpg",
      "width": 480
    },
    "standard": {
      "height": 480,
      "url": "https://i.ytimg.com/vi/cugl5mmfcxY/sddefault.jpg",
      "width": 640
    },
    "maxres": {
      "height": 720,
      "url": "https://i.ytimg.com/vi/cugl5mmfcxY/maxresdefault.jpg",
      "width": 1280
    }
  }
}