{
  "title": "How To Make Birria Tacos - 100k Celebration Recipe #MrMakeItHappen #TacoRecipe #BirriaTacos",
  "video_published_at": "2021-01-17T16:00:19Z",
  "start_at": null,
  "end_at": null,
  "video_id": "cx6_tuq2ePA",
  "published_at": "2021-02-24T16:19:57Z",
  "description": "Birria is traditionally made for celebrations, so what better way to bring in 100k Subscribers than this? This dish is super popular, and for good reason! it's absolutely fantastic! Let's #MakeItHappen\n\n****MY ALL-PURPOSE SEASONING IS FINALLY HERE! GET YOURS NOW! ****\nhttps://make-it-happen-media.myshopify.com/products/make-it-happen-ap-all-purpose-seasoning\n\nDon't forget to Subscribe, enable notifications, and give this video a thumbs up! Please take a moment to SHARE my channel to your friends and family! Thanks for your support. \n\nShop all of my Recipe E-Books - on sale now! www.mrmakeithappen.blog/shop\n\nAmazon Store: https://www.amazon.com/shop/mrmake1thappen\n\nFOLLOW ME!!!!!!\nInstagram: @_MrMakeItHappen_\nTwitter: @MrMake1tHappen\nTikTok: @MrMakeItHappenCooks\nBlog: www.mrmakeithappen.blog\nSupport The Show: https://www.patreon.com/Mrmakeithappen​ (I host weekly cooking classes virtually)\nPurchase Merch here - https://www.bonfire.com/make-it-happen​\n\nMusic By: Website: www.MarcDBeats.com\nSoundcloud: www.soundcloud.com/urkeljuice\n\nShopping List:\n2.5 lb Chuck Roast (or boneless short ribs)\n8 Arbol Chilis \n2 Ancho Chilis\n1 can chipotle chilis in Adobo Sauce\n2 tbps Tomato Paste\n2 tbsp brown sugar\n1 cinnamon stick\n1 white onion\n2 cups beef stock\n2 tbsp garlic paste\nsalt, pepper, garlic, onion powder, marjoram, thyme, cumin, chipotle chile powder\nCorn Tortillas\n2 bay leaves\n8oz Queso Melt Shredded cheese\nCilantro\n\nDirections:\nBegin by allowing your meat to come up to room temperature. Remove seeds and stem from chilis and rehydrate by adding them to boiling water and letting them simmer for 10-15 minutes. Remove from water and add to blender along with 1 can of chipotle chiles in adobo. Add about 1/2 to 1 cup of the water from the chiles to the blender as well. Next, add brown sugar, marjoram, thyme, chipotle chili powder, salt, and cumin. Blend mixture until it forms a paste/sauce consistency. Taste and adjust flavor to your preference. (Dice onion)\n\nCut chuck roast into equal size pieces and season heavily with kosher salt. Heat dutch oven or skillet to high with avocado oil. Sear meat on all sides until a nice crust develops. Remove meat and turn heat to low. Add diced onion and cook until tender. Add garlic and tomato paste and mix to incorporate. Next, add in 1 cup beef stock and combine. Add meat back to the pot and then cover with your sauce. Stir to combine. Season with salt, pepper, garlic, onion powder as needed. Add cinnamon stick and bay leaves. Cover and place in the oven at 325 for 3-4 hours (time will vary depending on size and cut of meat and temp used. 350 will cook faster - meat is done when it shreds easily with a fork)\n\nOnce meat is for tender, remove from sauce and fish out cinnamon stick and bay leaves. Add more beef stock to thin the sauce and make your consomme. Simmer for 10 minutes or so and skim the fat off as needed. next, shred your cheese and get your skillet hot. Add some cooking oil to the hot skillet. Dip your tortilla into the sauce on both sides and place onto hot skillet. Cook for 30-60 seconds and flip (looking for color). Add cheese, beef, and more cheese and then fold tortilla over and press down. Flip once and cook for an additional 30-60 seconds and remove. Serve with consomme for dipping and top with cilantro.",
  "thumbnails": {
    "default": {
      "height": 90,
      "url": "https://i.ytimg.com/vi/cx6_tuq2ePA/default.jpg",
      "width": 120
    },
    "medium": {
      "height": 180,
      "url": "https://i.ytimg.com/vi/cx6_tuq2ePA/mqdefault.jpg",
      "width": 320
    },
    "high": {
      "height": 360,
      "url": "https://i.ytimg.com/vi/cx6_tuq2ePA/hqdefault.jpg",
      "width": 480
    },
    "standard": {
      "height": 480,
      "url": "https://i.ytimg.com/vi/cx6_tuq2ePA/sddefault.jpg",
      "width": 640
    },
    "maxres": {
      "height": 720,
      "url": "https://i.ytimg.com/vi/cx6_tuq2ePA/maxresdefault.jpg",
      "width": 1280
    }
  }
}