{
  "title": "Three More \"Over Rice\" Recipes (下饭菜)",
  "video_published_at": "2021-02-28T00:25:36Z",
  "start_at": null,
  "end_at": null,
  "video_id": "D2BSrIXrpNU",
  "published_at": "2021-02-28T04:35:09Z",
  "description": "Xia fan cai, or \"over rice\" dishes! These don't necessarily have to be smothered over rice, per se - you can also eat them mixed in with the rice, or eaten alongside of rice. \n\nTEOCHEW FERMENTED OLIVE GREENS (橄榄菜)\n\nThese are available on Amazon, but as is the case with this sort of thing... it's *way* overpriced. Support your local Chinese/Asian supermarket, they'll be much cheaper: \n\nhttps://www.amazon.com/PS-Olive-Vegetables-HK-%E9%A6%99%E6%B8%AF%E8%93%AC%E7%9B%9B%E6%A9%84%E6%AC%96%E8%8F%9C/dp/B0088LLRI2\n\nNow, the way to eat this is to sort of mix it into the rice as you go. Having a big ol spoonful of them would be a bit too salty. If you're using this as your 'over rice' component, definitely steam an egg alongside your rice and *definitely* make yourself some greens. \n\nSTEAMED EGG WITH PORK TOPPING (臊子蒸蛋)\n\nNOTE: We use pork belly, and mince it by hand. For this dish, you can also use ground pork or ground beef - same 100g quantity - something like 80/20 pack of it. When frying, it's not going to release as much oil as the pork belly is, so do add more oil to start your meat off with - at least a tablespoon, lard preferably. You'll need to break it up quite a bit, and patiently fry it til crisp and golden brown.\n\n* Eggs, 4\n\n* Seasoning for the egg: 1/2 tsp salt, 1/4 tsp sugar, sprinkle (~1/16 tsp) white pepper powder (白胡椒粉), 1/8 tsp chicken bouillon powder (鸡粉). The chicken powder can also be replaced by MSG if you prefer, and if you're using stock you don't need either.\n\n* Water -or- stock, 250mL. Use stock if you're feeling fancy.\n\n* Pork belly (五花肉), 100g. Or the equivalent amount of ground pork or beef; see the note above.\n\n* Scallions, sliced. To make everything all pretty.\n\nAfter frying the pork, keep the oil. Use 2 tsp to top the egg. If needed, supplement with toasted sesame oil.\n\n1. Mince the pork, if applicable. To mince, first slice into thin sheets, then into thin slivers, and finally into a fine dice. Go at it with two cleavers and chop it down into a mince; ~3 minutes.\n\n2. Crack, whisk, and season the eggs. Crack four eggs; whisk in a zip-zag pattern so that air does not get incorporated.  Once you've beaten until no stray strands of egg white remain, add in the seasoning and the water. Quick whisk to incorporate.\n\n3. Strain into the steaming bowl. \n\n4. Steam the egg, covered, for six minutes. Then shut off the heat and let it sit there for another six minutes.\n\n5. While the egg is steaming, fry the pork. If using belly like us, fry over a medium-low flame to slowly render out the lard - almost like you were making cracklins. If using ground meat, start with a bit more oil, and fry it to *past* done, until it gets a bit crispy. Save at least 2 tsp of the oil from frying.\n\n6. Remove the egg, top it with your crispy meat, the 2 tsp oil, and the sliced scallions.\n\nGUIZHOU PICKLED GREENS & BEANS (酸菜烩豆米)\n\nNOTE: The most authentic way to make this dish would be to use dried beans, not canned beans. \n\nIf you would like to do it that way, use dried lima (or kidney) beans and soak overnight. Then over a medium low flame, simmer them for ~2 hours, or until they're soft enough to mash - there's a visual over at the pickled greens & beans hotpot video: https://youtu.be/88DcJkFmsUc?t=427\n\n* Suan cai pickled mustard greens (酸菜) -or- kimchi, 100g. Suan cai is available on Amazon but like always severely overpriced - the same package'll cost, like a buck or two at an Asian supermarket: https://www.amazon.com/Asian-Taste-Mustard-Pickled-Vegetable/dp/B00IR5HVH0 I tested kimchi with this too, and it's totally different but equally delicious.\n\n* Canned kidney beans (腰豆), 240g. Or, one can.\n\n* Aromatics: 3 cloves garlic, ~1 inch ginger (姜), ~3 scallions, 5 dried chilis (干辣椒/干朝天椒). Smash the garlic and the ginger. Deseed the chilis. Separate the white and green part of the scallion, slice each.\n\n* Liaojiu a.k.a. Shaoxing wine (料酒/绍酒), ~1 tsp.\n\n* Seasoning: 1/2 tsp salt, 1/4 tsp sugar, 1 tsp soy sauce (生抽), ~1/8 tsp MSG (味精), 1/2 tsp dark Chinese vinegar (陈醋/香醋)\n\n* Water, 1 cup\n\n1. Soak the suan cai pickled greens, ~5 minutes, then squeeze out the liquid. Rinse the canned beans to remove the brine.\n\n2. Mash ~1/4 of the tinned beans, ~60g worth. Finely mince the suan cai pickled greens. \n\n3. Stir fry. Longyau with ~1 tbsp of lard or oil. Medium flame, add the garlic and ginger, fry til fragrant. And the scallion white and dried chilis, ~30 second fry. Add the suan cai pickled greens, fry for ~2 min until wilted and popping. Mashed beans, in, quick mix. Swirl in Shaoxing wine. Add beans and water. Up the flame to high. \n\n4. Season with the sugar and soy sauce. Boil on high for 3-4 min til thickened to your liking. Taste, add salt if needed. Season with vinegar and MSG, and add the scallion greens.\n\nAnd check out our Patreon!\nhttp://www.patreon.com/ChineseCookingDemystified\n\nOutro Music: คิดถึงคุณจัง by ธานินทร์ อินทรเทพ\nFound via My Analog Journal (great channel): https://youtu.be/GHaL5H-VYRg",
  "thumbnails": {
    "default": {
      "height": 90,
      "url": "https://i.ytimg.com/vi/D2BSrIXrpNU/default.jpg",
      "width": 120
    },
    "medium": {
      "height": 180,
      "url": "https://i.ytimg.com/vi/D2BSrIXrpNU/mqdefault.jpg",
      "width": 320
    },
    "high": {
      "height": 360,
      "url": "https://i.ytimg.com/vi/D2BSrIXrpNU/hqdefault.jpg",
      "width": 480
    },
    "standard": {
      "height": 480,
      "url": "https://i.ytimg.com/vi/D2BSrIXrpNU/sddefault.jpg",
      "width": 640
    },
    "maxres": {
      "height": 720,
      "url": "https://i.ytimg.com/vi/D2BSrIXrpNU/maxresdefault.jpg",
      "width": 1280
    }
  }
}