{
  "title": "Devil's Food Bundt Cake - Everyday Food with Sarah Carey",
  "video_published_at": "2013-06-14T10:02:46Z",
  "start_at": null,
  "end_at": null,
  "video_id": "E8U4kt_jm08",
  "published_at": "2014-11-06T01:51:19Z",
  "description": "For today's recipe, you'll make a batter from flour, salt, baking powder, baking soda, cocoa powder, eggs, vanilla, and boiling water. Stir in mini chocolate chips and pour everything into a Bundt pan before placing in a 325 degree oven. After 20 minutes, drizzle with a heavy cream and melted chocolate chip glaze. The end result is delicious, gorgeous, and exactly what Dad will want this weekend!\n\nSarah's Tip of the Day: This one goes out to my dad, Marty Carey, an artist by trade but a chocolate lover at heart! It's a cake that's incredibly rich but still wonderfully moist -- and it's one of the best ways to show your dad how much he means to you this Father's Day.\n\nSubscribe for more easy and delicious recipes: http://full.sc/P8YgBt\n\n---------------------------------------------------------------\n\nPrep Time: 20 Minutes\nTotal Time: 1 Hour 40 Minutes, Plus Cooling\nServes 4\n\nIngredients:\nFor Cake\nVegetable oil cooking spray\n1 1/2 cups (3 sticks) unsalted butter, room temperature, plus more for pans\n1 cup unsweetened cocoa powder, plus more for pans\n1 cup boiling water\n1 cup sour cream\n3 cups all-purpose flour (spooned and leveled)\n1/4 teaspoon fine salt\n1 teaspoon baking powder\n1 teaspoon baking soda\n2 1/4 cups sugar\n4 large eggs\n1 tablespoon pure vanilla extract\n1 1/4 cups mini chocolate chips\n\nFor Glaze\n1 cup heavy cream\n8 ounces chopped semi sweet chocolate\nPinch of salt\n\nDirections:\n\nPreheat oven to 325 degrees. Spray a 12 cup bundt pan with cooking spray. In a medium bowl, whisk boiling water into cocoa powder until smooth; whisk in sour cream. In a large bowl, whisk together flour, salt, baking powder, and baking soda. Using an electric mixer, beat butter and sugar until light and fluffy. Beat in eggs, one at a time, until incorporated. Then beat in vanilla. Add flour mixture in three additions, alternating with 2 additions of cocoa mixture and beat until combined. Stir in chocolate chips.\n\nScrape batter into prepared pan and bake until tops springs back when lightly touches, 1 hour to 1 hour 30 minutes. Transfer to a wire rack set over a parchment paper lined baking sheet. Let cool 15 minutes, then turn our onto rack and let cool completely.\n\nBring cream to a boil in a medium pot. Add chocolate and let stand 5 minutes. Add salt and stir until smooth. Let stand 10 minutes, then pour over cake allowing the glaze to drip down sides and cover cake. Let set 3 hours at room temperature or 1 hour in refrigerator.\n\n\n---------------------------------------------------------------\n\nGet the Full Recipe: http://full.sc/19zB8W1\n\nNutritional Info: per serv (makes 16): 550 cal; 32 g fat; 7 g protein; 65 g carb; 4 g fiber\n\nMore Sweet Treat Recipes: http://full.sc/Q9cvnf\n\n---------------------------------------------------------------\n\nWant more? Sign up to get my video recipe email, served daily.\nGet recipe emails: http://www.marthastewart.com/edf\nLike Everyday Food: http://www.facebook.com/EverydayFood\nFollow Everyday Food: https://twitter.com/everydayfood\nEveryday Food Pinterest: http://pinterest.com/everydayfood\n\nSarah Carey is the editor of Everyday Food magazine and her job is to come up with the best ways to make fast, delicious food at home. But she's also a mom to two hungry kids, so the question \"What's for dinner?\" is never far from her mind -- or theirs, it seems! Her days can get crazy busy (whose don't?), so these videos are all about her favorite fast, fresh meals -- and the tricks she uses to make it all SO much easier.\n\nDevil's Food Bundt Cake - Everyday Food with Sarah Carey\nhttp://www.youtube.com/user/everydayf...",
  "thumbnails": {
    "default": {
      "height": 90,
      "url": "https://i.ytimg.com/vi/E8U4kt_jm08/default.jpg",
      "width": 120
    },
    "medium": {
      "height": 180,
      "url": "https://i.ytimg.com/vi/E8U4kt_jm08/mqdefault.jpg",
      "width": 320
    },
    "high": {
      "height": 360,
      "url": "https://i.ytimg.com/vi/E8U4kt_jm08/hqdefault.jpg",
      "width": 480
    },
    "standard": {
      "height": 480,
      "url": "https://i.ytimg.com/vi/E8U4kt_jm08/sddefault.jpg",
      "width": 640
    },
    "maxres": null
  }
}