{
  "title": "1892 Galt Cookbook Yeasted Coffee Cake Old Cookbook Show Glen And Friends Cooking Coffee Cake Recipe",
  "video_published_at": "2021-02-14T13:00:26Z",
  "start_at": null,
  "end_at": null,
  "video_id": "eaSzvlrjXuE",
  "published_at": "2021-02-16T17:52:36Z",
  "description": "1892 Galt Cookbook Yeasted Coffee Cake - Old Cookbook Show - Glen And Friends Cooking\nThe first edition of the Galt Cookbook published in 1892, is a great look into what was happening in Southern Ontario and Canadian Cooking in this time period. It is a community cookbook and gathered recipes from people who both lived in rural settings and in the larger cities and towns. This coffee cake recipe is really more of a bread - well it is a bread - and shares the same basic ingredients and style enriched celebration breads. If you like old cookbooks, old recipes, 100 year old recipes and tasting history through historical foods; you are in the right place\n\n\n\nCoffee Cake\nMiss Roos, Waterloo.\nThree coffee-cupfuls milk slightly warm, one coffee-cupful butter, melt the butter in the milk, one coffee-cupful sugar, two cakes Fleischmann’s yeast, one teacupful stoned raisins. Make a sponge in the evening, let it rise overnight: in the morning stiffen with flour and knead about half an hour. When risen again roll out an inch thick and put in pans, then when light melt butter and thicken with flour and spread on cakes. Bake. Before serving sprinkle with cinnamon and sugar.\n\n\nI translated a coffee-cupful as being equal to 150 mL\n\n\n\n#LeGourmetTV #GlenAndFriendsCooking #oldCookbookShow\n\n\n\nCheck out the ‘Merch’ in our TeeSpring store- T-Shirts, Mugs and more: https://teespring.com/stores/glen-friends-cooking\n\n\n\n\nGlen & Friends Cooking,recipe,old cookbook show,recipes from the 1800s america,historical recipes,historic food recipes,historic recipes,coffee cake recipe,yeasted coffee cake recipe,enriched bread recipe,sweet bread recipe,dessert person coffee cake,dessert person,19th century,homemade coffee cake,bread recipe,raisin bread recipe",
  "thumbnails": {
    "default": {
      "height": 90,
      "url": "https://i.ytimg.com/vi/eaSzvlrjXuE/default.jpg",
      "width": 120
    },
    "medium": {
      "height": 180,
      "url": "https://i.ytimg.com/vi/eaSzvlrjXuE/mqdefault.jpg",
      "width": 320
    },
    "high": {
      "height": 360,
      "url": "https://i.ytimg.com/vi/eaSzvlrjXuE/hqdefault.jpg",
      "width": 480
    },
    "standard": {
      "height": 480,
      "url": "https://i.ytimg.com/vi/eaSzvlrjXuE/sddefault.jpg",
      "width": 640
    },
    "maxres": {
      "height": 720,
      "url": "https://i.ytimg.com/vi/eaSzvlrjXuE/maxresdefault.jpg",
      "width": 1280
    }
  }
}