{
  "title": "SPECIAL GRILLED STUFFED BONELESS 8 TREASURE CHICKEN",
  "video_published_at": "2017-02-03T15:23:16Z",
  "start_at": null,
  "end_at": null,
  "video_id": "emKwh0m5cBE",
  "published_at": "2019-08-27T04:45:18Z",
  "description": "Hello Everybody,\nToday I'll be showing you a Chinese New Year Special, which can be cooked also for normal days. This dish is called SPECIAL 8 TREASURE CHICKEN. Follow the video instructions, the recipe is mentioned in the video. Let's start cooking!\n\n\nHere is the full recipe for cooking my 8 TREASURE CHICKEN\n\nFirstly you need 1 whole chicken weight about 1,35kg with full intact skin. Debone the chicken alternatively you can cook without deboning the chicken but serving it will be quite messy. Then tie the openings  with cooking string , on the leg and bottom opening to prevent the fillings from oozing out while cooking.\n\nMeantime prepare the stuffing.\nHeat a wok at medium heat , with about 2 tbsp oil and fry 1 tbsp garlic, 1 tbsp shallots and 1 stalk scallion cut in rings till fragrant. Then add 30gm washed and soaked dried shrimps followed by 30gm shitake mushrooms soaked and cut into pieces, stir fry till fragrant and add 1 cup glutinous rice ( soaked for 2 hours) stir to combine well, also add\n30g soaked lotus seeds , 30gm precooked gingko nuts, 30 to 50gm of cooked Chestnuts  and 30gm of a mixture of red dates and dried longans, stir to combine.\nFinally add 1 cup of water or chicken stock. Bring to boil and cover with a lid and cook till water is well absorbed.\nFinally add 15gm Goji Berries and Salt and Sugar to taste, mix well into the cooked rice.\nLeave to cool. Once stuffing is cooled, stuff chicken and seal all openings as shown in video\n\nMix in a bowl 1 tbsp caramellised dark soya sauce, 1 tsp chinese 5 spice powder, 1 tbsp wine and 1 tsp salt and brush all over the chicken leave to marinate for about 10 minutes (this part of video was missing, I had a camera mishap. Camera malfunction)\nHeat a pan with oil and deep fry the chicken on all sides shortly.\nThis is to strengthen the skin for further cooking and to seal the juice inside the chicken. Remove chicken and place over a steaming plate lined with 4 stalks of scallion.\n\nIn a fresh wok, add  1 1/2 litre water and add 1 tsp dark caramelized soya sauce, 2 tbsp cooking wine, 2 tbsp oyster sauce, 1tbsp Sichuan pepper,  1 tbsp Star anise powder, 2 tbsp brown sugar (or syrup) and a dash of sesame oil. Bring to boil. \nThen scoop about 1 litre of  boiled soup over the chicken.\n\nYou can steam over high steam for roughly over 1 hour depending on the size of your chicken till soft or broil/bake  it for 1 hour in the oven at 150C (sorry under stress with Malfunction of camera again so said the wrong temperature) and basting it with the sauce till golden brown, till chicken is soft enough. Remove chicken and place over serving plate. \nPour the sauce of chicken from the baking tray into the wok and bring to a boil and thicken the sauce with 1 tbsp cornflour mixed with 3 tbsp water. Scoop and pour enough sauce over the Chicken .\nGarnish with strips of scallion greens and red chillie strips.\n\nYour 8 TREASURE CHICKEN is ready for Serving.\n\nBON APPETITE!!! ENJOY.\nPlease note: If your chicken is bigger than 1,35kg then you need to adjust the amount of stuffing and steaming/roasting time.\nYou can cook this dish for any Occasions!!!\nAlso please adjust roasting temperature according to your oven. Each oven have different roasting time and temperature so adjust accordingly. Tq\n\nHAPPY COOKING!!!\nTHANK YOU FOR WATCHING!!!\nTHANK YOU FOR YOUR SUPPORT AND THUMBS UP FOR MY VIDEOS!!!\n\nBEFORE CAMERA SUFFER TOTAL MAL FUNCTION THERE WILL BE ANOTHER VIDEO TO SHOW YOU HOW I DEBONE MY CHICKEN.... COMING UP SOON!!\n:)  :)",
  "thumbnails": {
    "default": {
      "height": 90,
      "url": "https://i.ytimg.com/vi/emKwh0m5cBE/default.jpg",
      "width": 120
    },
    "medium": {
      "height": 180,
      "url": "https://i.ytimg.com/vi/emKwh0m5cBE/mqdefault.jpg",
      "width": 320
    },
    "high": {
      "height": 360,
      "url": "https://i.ytimg.com/vi/emKwh0m5cBE/hqdefault.jpg",
      "width": 480
    },
    "standard": {
      "height": 480,
      "url": "https://i.ytimg.com/vi/emKwh0m5cBE/sddefault.jpg",
      "width": 640
    },
    "maxres": {
      "height": 720,
      "url": "https://i.ytimg.com/vi/emKwh0m5cBE/maxresdefault.jpg",
      "width": 1280
    }
  }
}