{
  "title": "Chicken thighs under a brick, with noodled vegetables",
  "video_published_at": "2020-10-29T18:00:02Z",
  "start_at": null,
  "end_at": null,
  "video_id": "EMXcrMBA4ys",
  "published_at": "2020-10-30T00:43:36Z",
  "description": "Thanks to Magic Spoon for sponsoring this video! Use the promo code RAGUSEA at checkout to get free shipping → https://magicspoon.thld.co/raguseaoct\n\n***RECIPE, SERVES TWO***\n\nTwo large skin-on chicken thighs\n3 large carrots\n1 zucchini\n1 bunch green onions\n3-4 garlic cloves\n1 red chili\n1 lemon\nolive oil\nsalt (I used smoked salt)\npepper\n\nIf the thighs still have bones in them, cut them out per the instructions in the video.\n\nPeel the carrots and discard the outer peels. Then use your peeler to cut as many thin ribbons as possible out of the carrots, discarding the core. Do the same with the zucchini. \n\nCut the root ends off the green onions, as well as the dry green tops, and peel off any undesirable outer layers. Bisect each onion and pull the layers apart from each other. Peel and slice/chop the garlic, and thinly slice the chili.\n\nSeason the chicken with salt and pepper, and make sure you've got a brick wrapped in aluminum foil handy.\n\nHeat a cast iron or nonstick pan on medium, and coat the bottom with olive oil. When it's shimmering, lay in the thighs, skin-side down. Place the brick on top, mashing them into the pan surface. \n\nReduce the heat, possibly all the way to low. Use your nose to perceive whether the skin is burning, since you probably can't yet check it visually without it sticking and tearing.\n\nAfter about 10 minutes, remove the brick, and flip the chicken pieces to cook the raw side, about 5 additional minutes to make sure the interior is thoroughly cooked. (If the skins aren't brown enough to your liking, you could always turn up the heat right at the end and brown them some more.) Remove to a plate to rest.\n\nDump your vegetables into the pan, turn the heat up to medium-high, and stir constantly to get everything coated in chicken fat and cooked evenly. After about 5 minutes, the vegetables should be almost tender. Taste for seasoning, and stir in any needed salt, plus the juice of half a lemon.\n\nPut the vegetables on fresh plates, transfer over your chicken thighs, and put on a wedge from your remaining lemon half. At the last second, brush some of the juices from the plate where you rested the chicken onto the chicken skin. Squeeze lemon over the chicken and eat.",
  "thumbnails": {
    "default": {
      "height": 90,
      "url": "https://i.ytimg.com/vi/EMXcrMBA4ys/default.jpg",
      "width": 120
    },
    "medium": {
      "height": 180,
      "url": "https://i.ytimg.com/vi/EMXcrMBA4ys/mqdefault.jpg",
      "width": 320
    },
    "high": {
      "height": 360,
      "url": "https://i.ytimg.com/vi/EMXcrMBA4ys/hqdefault.jpg",
      "width": 480
    },
    "standard": {
      "height": 480,
      "url": "https://i.ytimg.com/vi/EMXcrMBA4ys/sddefault.jpg",
      "width": 640
    },
    "maxres": {
      "height": 720,
      "url": "https://i.ytimg.com/vi/EMXcrMBA4ys/maxresdefault.jpg",
      "width": 1280
    }
  }
}