{
  "title": "How to Cook Authentic Cantonese Char Siu Roast Pork from scratch (蜜汁叉烧)",
  "video_published_at": "2017-05-23T06:34:23Z",
  "start_at": null,
  "end_at": null,
  "video_id": "g2-FFux9EbU",
  "published_at": "2020-07-15T03:06:35Z",
  "description": "We're making Cantonese Char Siu BBQ pork!  This is an awesome dish, and a worldwide favorite.\n\nWe wanted to show you guys the traditional way to make the Char Siu sauce from scratch, which was actually surprisingly difficult for us to figure out.  So forgive our quick one minute backstory, we just wanted to let you guy know why our recipe might be so different to some others you've seen :)\n\nHowever you cook this though - using either Lee Kum Kee or homemade sauce, either the oven or a charcoal grill - you'll end up getting a real tasty result.  \n\nAs always, a detailed recipe and ingredient list is at a reddit comment in /r/cooking here:\n\nhttps://www.reddit.com/r/Cooking/comments/6ctoj9/recipe_how_to_make_authentic_cantonese_char_siu/\n\nOne more thing - at 0:40 in the video, we wanted to include a section of a Chinese Char Siu cooking video.  A special thank you to the YouTube channel 'Manaweblife' (actually Malaysian!) for providing that awesome video.  Their channel's got a bunch of cool stuff, but check out the original video here:\n\nhttps://www.youtube.com/watch?v=llK8Z1Gt40U\n\nABOUT US\n-----------------------------------------------------------------------------------------\nI'm Chris Thomas from the United States and I've been living as an expat in China now for upwards of nine years, most of which in Shenzhen. I love living here, and the food is absolutely incredible. I read and speak some Chinese, and have been trying to religiously recreate the most authentic versions of the food I've eaten and loved here.\n\nMy partner in these videos is Stephanie Li, my similarly food-and-travel-obsessed long term girlfriend. She's a translator from Guangzhou and is an incredible home cook. Sometimes I'll be behind the wok but usually it'll be her cooking.",
  "thumbnails": {
    "default": {
      "height": 90,
      "url": "https://i.ytimg.com/vi/g2-FFux9EbU/default.jpg",
      "width": 120
    },
    "medium": {
      "height": 180,
      "url": "https://i.ytimg.com/vi/g2-FFux9EbU/mqdefault.jpg",
      "width": 320
    },
    "high": {
      "height": 360,
      "url": "https://i.ytimg.com/vi/g2-FFux9EbU/hqdefault.jpg",
      "width": 480
    },
    "standard": {
      "height": 480,
      "url": "https://i.ytimg.com/vi/g2-FFux9EbU/sddefault.jpg",
      "width": 640
    },
    "maxres": {
      "height": 720,
      "url": "https://i.ytimg.com/vi/g2-FFux9EbU/maxresdefault.jpg",
      "width": 1280
    }
  }
}