{
  "title": "Shepherd's Pie in a cast iron pan | lamb and peas filling, cheesy potato topping",
  "video_published_at": "2021-01-14T19:00:06Z",
  "start_at": null,
  "end_at": null,
  "video_id": "gAG3S55D9C4",
  "published_at": "2021-01-16T06:20:53Z",
  "description": "Thanks to Magic Spoon for sponsoring this video! Use the promo code RAGUSEA at checkout to get $5 off your order today → https://magicspoon.thld.co/raguseajan2021\n\n***RECIPE, SERVES 6-8°°°\n\n2 lb (907g) ground lamb\n3-4 carrots\n1 large onion\nHalf a bottle (3 cups, 375mL) white wine\n2 teaspoons dried thyme\n1 teaspoon dried sage\n1 teaspoon garlic powder\n1 teaspoon mustard powder\n1/2 cup (118mL) Worcestershire sauce \n1/4 cup (60mL) tomato paste\n1/4 (30g) flour (use more if you want your filling more solid)\nwater or stock\nsalt \npepper\na stock cube, or a spoonful of stock concentrate (like Better Than Bouillon), or a few ice cubes of homemade demi-glace from this recipe: https://youtu.be/IERauv-k5wo\nfresh rosemary (very optional)\n10 oz bag (280g) frozen peas\n\n2 lb floury potatoes\n1 stick (4 oz, 110g) butter\nmilk\n2 egg yolks\n2 oz (50g) cheddar cheese\nsalt\nchives (very optional)\n\nThis recipe is calibrated for a 12-inch (30 cm) oven-safe skillet, but you could cook the filling in any pan and simply transfer it to a suitable baking dish.\n\nPut the lamb into the pan and flatten it into a disk across the entire surface. Turn the heat on high underneath. While it heats up and starts to cook, grate or finely chop the carrots and onion. When the lamb is brown on the bottom, stir in the carrots and onion with a wooden spoon, scraping the bottom and breaking up the meat as you go. \n\nKeep cooking and stirring until much of the water has evaporated, 5-10 min. When you notice the pan starting to dry out, reduce the heat to medium. When things start sticking to the bottom of the pan again, stir in the tomato paste and flour, and cook for another minute or two, until burning of the fond is imminent. Deglaze with the wine.\n\nStir in the Worcestershire, herbs and spices (except for salt), stock concentrate or demi-glace, and enough water to cover. Reduce heat to a simmer and cook until reduced and quite thick, at least half an hour.\n\nPeel the potatoes and cut them into big chunks. Cover them in water and boil them until very fork-tender. Drain. Put in the butter and let it melt in the heat of the potatoes. Mash the potatoes, stirring in enough milk to get a slightly looser texture than you'd normally want for mashed potatoes. Grate in the cheese, put in the egg yolks, stir until smooth, then taste for seasoning and add as much salt as you want. (The egg yolks might not be totally cooked at this stage, so if you need to be cautious about pathogens, taste for seasoning before you mix in the eggs.) Keep the mash warm until you're ready to put it on the pie.\n\nGet your oven heating to 400ºF, 200ºC, ideally convection.\n\nWhen the meat filling is reduced and thick, take it off the heat — the cooler it is when you top the pie, the better. Chop up the fresh rosemary and put it in (if you've got it), and stir in the frozen peas (still frozen). Smooth out the surface of the meat filling, then drop on the potatoes in large dollops. Pull with the back of a spatula to spread the potatoes out toward the pan edges and get everything covered in an even, thin later. If you want, use a fork to make some ridges in the surface that'll brown nice and look pretty.\n\nBake the pie until the potatoes are puffy and the filling is bubbling, about 30 min. Take it out and top it with finely chopped chives, if you have them. Let cool at least 20 minutes before scooping.",
  "thumbnails": {
    "default": {
      "height": 90,
      "url": "https://i.ytimg.com/vi/gAG3S55D9C4/default.jpg",
      "width": 120
    },
    "medium": {
      "height": 180,
      "url": "https://i.ytimg.com/vi/gAG3S55D9C4/mqdefault.jpg",
      "width": 320
    },
    "high": {
      "height": 360,
      "url": "https://i.ytimg.com/vi/gAG3S55D9C4/hqdefault.jpg",
      "width": 480
    },
    "standard": {
      "height": 480,
      "url": "https://i.ytimg.com/vi/gAG3S55D9C4/sddefault.jpg",
      "width": 640
    },
    "maxres": {
      "height": 720,
      "url": "https://i.ytimg.com/vi/gAG3S55D9C4/maxresdefault.jpg",
      "width": 1280
    }
  }
}