{
  "title": "Pesto Alla Genovese | Kenji's Cooking",
  "video_published_at": "2020-06-12T18:00:02Z",
  "start_at": null,
  "end_at": null,
  "video_id": "GYvh3c0olFc",
  "published_at": "2020-06-13T03:43:15Z",
  "description": "Pesto is best in a mortar and pestle. This mortar and pestle is excellent, and at the time of this posting, $24.99: https://www.amazon.com/ChefSofi-Mortar-Pestle-Set-Anti-Scratch/dp/B01HXWT40E?tag=kenjilopezalt-20\n\nAny solid granite, 2-cup capacity mortar and pestle will do, though.\n\nFor the pesto, crush a few cloves of garlic with a big pinch of kosher salt in the bowl of mortar and pestle. Add a quarter cup of pinenuts (they do not need to be toasted, but you can if you'd like) and crush. Add a few cups of basil leaves a handful at a time, crushing them as you go. Add an ounce of grated Parmesan cheese and work the whole thing into a paste that's as smooth or chunky as you'd like. Add a 1/2 cup of extra-virgin olive oil a couple tablespoons at a time, working it into the pesto with a circular motion of the pestle.\n\nTaste and season with salt as desired. Store the pesto in a glass jar with a layer of olive oil over the top in the fridge for up to 4 days.\n\nTo serve it, cook some pasta (this recipe makes enough to sauce about 400g of pasta), reserving a half cup of pasta water. Put the cooked pasta in a bowl, add the pesto and a big splash of the pasta water. toss and stir with tongs or a fork and spoon, adding more pasta water as necessary until it forms a creamy sauce that clings to the pasta.\n\n\nPs: we are testing out a theme song in today’s episode. Exciting homegrown motion graphics and more to come.",
  "thumbnails": {
    "default": {
      "height": 90,
      "url": "https://i.ytimg.com/vi/GYvh3c0olFc/default.jpg",
      "width": 120
    },
    "medium": {
      "height": 180,
      "url": "https://i.ytimg.com/vi/GYvh3c0olFc/mqdefault.jpg",
      "width": 320
    },
    "high": {
      "height": 360,
      "url": "https://i.ytimg.com/vi/GYvh3c0olFc/hqdefault.jpg",
      "width": 480
    },
    "standard": {
      "height": 480,
      "url": "https://i.ytimg.com/vi/GYvh3c0olFc/sddefault.jpg",
      "width": 640
    },
    "maxres": {
      "height": 720,
      "url": "https://i.ytimg.com/vi/GYvh3c0olFc/maxresdefault.jpg",
      "width": 1280
    }
  }
}