{
  "title": "Cranberry Pistachio Shortbread Cookies | Christmas Cookies",
  "video_published_at": "2013-12-08T00:22:01Z",
  "start_at": null,
  "end_at": null,
  "video_id": "HkvUvP8nCYE",
  "published_at": "2014-10-07T02:23:54Z",
  "description": "Watch more How to Make Christmas Cookies videos: http://www.howcast.com/videos/515165-Cranberry-Pistachio-Shortbread-Cookies-Christmas-Cookies\n\nRECIPE: 1 stick unsalted butter, soft; 1/3 c. sugar; 1 tsp vanilla bean paste; Â_ tsp cinnamon; pinch salt; 1 c. all purpose flour; Â_ c. dried cranberries; zest of 1 orange; 1 large egg white; Â_ c. finely-chopped pistachios. Beat butter & sugar in stand mixer w/ paddle. Add vanilla, cinnamon, salt, flour, cranberries & zest; beat till smooth dough forms. Roll dough into log & brush w/ egg white. Roll log in pistachios. Chill Â_ hour before slicing into Â_\" thick cookies. Transfer to sheet; bake @ 350F 12 min. or till lightly golden.\n\nHi. I'm Katie Rosenhaus, and today I'm going to show you how to make cranberry pistachio shortbread cookies, a cookie that's perfect for Christmas. And the reason for that is I have the red with my cranberries, and the outside is covered with the green of the pistachios, and it's just a really festive cookie. So I'm starting in my mixer with one stick of softened butter. And you just want to leave your butter on your countertop for about half an hour until it's just soft to the touch, and then you're ready to go. \n\nSo we're creaming together butter and a third a cup of sugar. I'm going to start my mixer off on low speed, and then crank it up. And the beauty of this cookie dough is that there are no eggs. So if you have people around who are trying to constantly eat your dough, this is one that's totally safe to eat. So that's it. Really fast. My butter and sugar are combined together. They're nice and smooth. So I'm just going to start adding in some of flavorings. And here's just something that I love adding. It's a little bit of orange zest. So with my microplane I'm just going in and scraping the outside of my orange, and that's going to add a really nice citrus balance to the cranberries. Get that in there. I have my cranberries here. These are dried cranberries. \n\nA little bit of vanilla bean paste, and the reason I use vanilla bean paste is I'm getting all of those little bits of vanilla bean in my cookies, instead of just that flavor of the vanilla extract. A touch of salt, and a baker's pinch is always bigger than a regular pinch, but you'll find that salt in recipes really rounds out the flavor. And a cup of flour. So I'm just going to mix until this dough comes together. Start on low, and beat and beat. OK. So we have our cookie dough. So you can see this color is really already beautiful. \n\nWe have the little flecks of orange and red. I'm just going to pull the dough out and pop it right onto a cutting board. Just make sure all the little dry bits are combined. Everything is in. And now you could work with this dough right away, but if you're at home and you have the time, I would recommend just chilling it for about half an hour until it's a little bit more firm, and it will be even easier to work with. But all I'm going to do is roll it out. And you'll see I haven't even floured my countertop. I'm just using my hands to gently roll the dough into a nice log. This is about I would an inch or an inch and a half in diameter. And now for the festive part. \n\nSo I have a little egg white with a brush, and I have pistachios that I've ground in the little food processor. Or you can grind them in a big food processor or whatever you have, but until they're nice and finely ground. So I'm going to brush my log with egg white, and this is going to be our glue. \n\nOf course I grabbed the tiniest brush I could possibly find, but if you get desperate just go in with your hand and rub egg white all over the outside of the cookie, and then of course wash your hands afterwards. So that's the glue. Now when I top it with my pistachios, they're just going to stick to the surface. So you can see I'm going to pat them down. \n\nThey create this beautiful coating all over. So I'm going to do that to the whole log. So my dough is all coated and ready to go, and I'm just going to take a nice, sharp knife, and here's where I'm just going to cut slices. And if your dough is chilled, it's going to cut even more easily, but don't worry if your shapes are a little irregular. We'll go back in a fix them afterwards. OK. So on my baking sheet, I'm just going to space this a little bit apart from each other, so they'll have some room to grow. Right onto the cookie sheet. So that's it. So I'm just going to bake these at about 350 degrees until they're lightly golden around the edge, about 15 minutes. \n\nAnd you could see how beautiful they come out. They really puff, and they get nice and round, and you can see all of those little bits of cranberry running through with the pistachios on the outside. So if you want, dust them with a little bit of powdered sugar",
  "thumbnails": {
    "default": {
      "height": 90,
      "url": "https://i.ytimg.com/vi/HkvUvP8nCYE/default.jpg",
      "width": 120
    },
    "medium": {
      "height": 180,
      "url": "https://i.ytimg.com/vi/HkvUvP8nCYE/mqdefault.jpg",
      "width": 320
    },
    "high": {
      "height": 360,
      "url": "https://i.ytimg.com/vi/HkvUvP8nCYE/hqdefault.jpg",
      "width": 480
    },
    "standard": {
      "height": 480,
      "url": "https://i.ytimg.com/vi/HkvUvP8nCYE/sddefault.jpg",
      "width": 640
    },
    "maxres": {
      "height": 720,
      "url": "https://i.ytimg.com/vi/HkvUvP8nCYE/maxresdefault.jpg",
      "width": 1280
    }
  }
}