{
  "title": "Yummy Egg Recipe that’s So Easy! Chinese Egg Stir Fry w/ Cabbage 中式白菜炒蛋 Chinese Scrambled Egg Recipe",
  "video_published_at": "2019-08-17T22:38:29Z",
  "start_at": null,
  "end_at": null,
  "video_id": "I1BjaVn2JDc",
  "published_at": "2020-07-21T03:09:15Z",
  "description": "This week, we're featuring two super easy recipes. This Chinese style Scrambled Egg with Cabbage is another easy recipe to cook. It's perfect to go with the Stir Fried Shrimp with Ginger & Spring Onion recipe that we released yesterday. \n\nSee the ingredient list below for your easy reference. \n\nWe would like to give special thanks to Shogun by La Gourmet for letting us try out their high-quality non-stick pan in the video respectively. If you like to buy them, you can go to any of the major departmental stores in Singapore such as Isetan, Robinsons, Takashimaya, BHG, OG, Metro or Tangs. This brand is also available in Malaysia, the Philippines, Vietnam and Indonesia.\n\nHope you can recreate this yummy dish in the comfort of your home. Thanks for dropping by our channel. \n\nPlease subscribe to stay tuned to our home cooking videos. \n\nFollow us on: \nYoutube: www.youtube.com/spicenpans \nFacebook www.facebook.com/spicenpans/ \nInstagram www.instagram/spicenpans \nBlog: www.spicenpans.com \n\nChat with us! info@spicenpans.com \n\nThanks for watching! See you soon. \n\nxoxo \nJamie \non behalf of Spice N’ Pans \n\nIngredients: \nServes 3 pax\n\n5 eggs\nA few dashes of white pepper\n2 teaspoons of light soy sauce\n2 teaspoons of chicken stock powder\n2 teaspoons of Chinese cooking wine\n100g of Chinese cabbage\n3 stalks of spring onion (use only the green part)\n\n===\nIf you like this recipe, you might like these too:\nQuick & Easy Egg Foo Young w/ Gravy 芙蓉蛋 Chinese Omelette Recipe\nhttps://www.youtube.com/watch?v=PDsw4jxWBdQ&t=1s\n\nHow to make the Best Egg Foo Young w/ Shrimp & Char Siu + Vegetables 芙蓉蛋 Chinese Omelette Recipe\nhttps://www.youtube.com/watch?v=11D2WLJhmbI\n\nHow to make Silky Smooth Chinese Steamed Egg like a Masterchef 蒸水蛋\nhttps://www.youtube.com/watch?v=v8WAa2rQPd4&t=21s\n\n\nDisclaimer: \nSpice N' Pans is not related to these products and cannot guarantee the quality of the products in the links provided. Links are provided here for your convenience. We can only stand by the brands of the products we used in the video and we highly recommend you to buy them. Even then, preference can be subjective. Please buy at your own risk. Some of the links provided here may be affiliated. These links are important as they help to fund this channel so that we can continue to give you more recipes. Cheers!",
  "thumbnails": {
    "default": {
      "height": 90,
      "url": "https://i.ytimg.com/vi/I1BjaVn2JDc/default.jpg",
      "width": 120
    },
    "medium": {
      "height": 180,
      "url": "https://i.ytimg.com/vi/I1BjaVn2JDc/mqdefault.jpg",
      "width": 320
    },
    "high": {
      "height": 360,
      "url": "https://i.ytimg.com/vi/I1BjaVn2JDc/hqdefault.jpg",
      "width": 480
    },
    "standard": {
      "height": 480,
      "url": "https://i.ytimg.com/vi/I1BjaVn2JDc/sddefault.jpg",
      "width": 640
    },
    "maxres": {
      "height": 720,
      "url": "https://i.ytimg.com/vi/I1BjaVn2JDc/maxresdefault.jpg",
      "width": 1280
    }
  }
}