{
  "title": "Scallion Pancake, Shanghai Street Food-style Congyoubing (葱油饼)",
  "video_published_at": "2018-06-05T03:30:17Z",
  "start_at": null,
  "end_at": null,
  "video_id": "Iblk2-1QNGM",
  "published_at": "2020-07-15T03:06:27Z",
  "description": "We wanted to show you a recipe for a bit of a different style of scallion pancake, the Shanghai street food-style.  The authentic Shanghai version is equally layered but smaller, fried, and really crispy.\n\nIt's a little more involved because we gotta mimic some specialized street food equipment, but it's super worth it.\n\nFor the complete footage of the original street food, check out 4 Wanda's and Guts7's videos here... some great footage:\n\nhttps://youtu.be/IQJ8bjSHALY\nhttps://youtu.be/KDA2ZCJ4ebI\n\nAs always, here's the Reddit link for the recipe:\n\nhttps://www.reddit.com/r/Cooking/comments/8oq3xo/recipe_scallion_pancakes_shanghai_street/\n\nAnd check out our Patreon if you'd like to support the project!\n\nwww.patreon.com/ChineseCookingDemystified\n\nOutro Music: \"Add And\" by Broke For Free \nhttps://soundcloud.com/broke-for-free\n\nABOUT US\n-----------------------------------------------------------------------------------------\nLearn how to cook real deal, authentic Chinese food! We post recipes every Tuesday (unless we happen to be travelling) :)\n\nWe're Steph and Chris - a food-obsessed couple that lives in Shenzhen, China. Steph is from Guangzhou and loves cooking food from throughout China - you'll usually be watching her behind the wok. Chris is a long-term expat from America that's been living in China and loving it for the last nine years - you'll be listening to his explanations and recipe details, and doing some cooking at times as well.\n\nThis channel is all about learning how to cook the same taste that you'd get in China. Our goal for each video is to give you a recipe that would at least get you close to what's made by some of our favorite restaurants here. Because of that, our recipes are no-holds-barred Chinese when it comes to style and ingredients - but feel free to ask for tips about adaptations and sourcing too!",
  "thumbnails": {
    "default": {
      "height": 90,
      "url": "https://i.ytimg.com/vi/Iblk2-1QNGM/default.jpg",
      "width": 120
    },
    "medium": {
      "height": 180,
      "url": "https://i.ytimg.com/vi/Iblk2-1QNGM/mqdefault.jpg",
      "width": 320
    },
    "high": {
      "height": 360,
      "url": "https://i.ytimg.com/vi/Iblk2-1QNGM/hqdefault.jpg",
      "width": 480
    },
    "standard": {
      "height": 480,
      "url": "https://i.ytimg.com/vi/Iblk2-1QNGM/sddefault.jpg",
      "width": 640
    },
    "maxres": {
      "height": 720,
      "url": "https://i.ytimg.com/vi/Iblk2-1QNGM/maxresdefault.jpg",
      "width": 1280
    }
  }
}