{
  "title": "The quintessential Cantonese condiment - Fried Dace with Black Bean",
  "video_published_at": "2021-02-07T00:18:40Z",
  "start_at": null,
  "end_at": null,
  "video_id": "IEC5ZfsOYp0",
  "published_at": "2021-02-08T03:57:48Z",
  "description": "Fried Dace with Black Bean! You've probably seen this at your local Chinese supermarket, but if you didn't know what it was, I'd imagine you probably walked right past it. Next time? Buy this, trust us. I know 'tinned fish' isn't necessarily the most enticing thing in the world for many, but even if you bounce off it as a condiment, it's an absolutely fantastic ingredient.\n\nRecipe is also over here in /r/CasualChina if you prefer your recipes in Reddit form:\n\nhttps://www.reddit.com/r/CasualChina/comments/leahm2/fried_dace_with_black_bean_the_quintessential/\n\n\nWAY TO EAT #1: AS A TOPPING/SIDE FOR WHITE RICE\n\nA classic 'rice killer'. Take a chunk of the fish & black bean, toss it over rice. We also like to sprinkle on a bit of granulated sugar and a touch of the oil from the can. \n\nWAY TO EAT #2: AS A BASE FOR FRIED RICE\n\nFor this recipe, we used Steamed Rice as a base for the fried rice. If you're not sure how to steam rice, check out our \"Best Rice for Fried Rice\" video here: https://youtu.be/XjHQoYAp9I0\n\n* Steamed rice, 250g. This would be from 150g of dried rice. Leftover rice is also ok, you'll just need to break up the clumps and fry for longer than steamed rice.\n* Fish from the can, 1 fish.\n* Black bean from the can, 1 tbsp.\n* Garlic, 2 cloves.\n* Seasoning: 1/4 tsp salt, 1/2 tsp sugar, 1 tsp light soy sauce (生抽)\n\nProcess:\n\n1. Steam your rice as per the above video -or- use leftover rice.\n\n2. Finely mince the fish and the garlic. Roughly chop the black beans.\n\n3. Longyau - get your wok piping hot, shut off the heat, add in the oil - here ~1 tbsp - and give in a swirl to get a non-stick surface.\n\n4. Low flame. Add in the garlic, fish, and black beans. Fry until aromatic, ~1 minute.\n\n5. Swap the flame to high. Add in the rice. Break it up a bit, stir fry together until the rice is loose and the grains are separate, or about two minutes.\n\n6. Season with the 1/4 tsp salt, 1/2 tsp sugar, and swirl the 1 tsp soy sauce over the spatula and around the sides of the wok. Fry for ~30 seconds to mix.\n\nWAY TO EAT #3: AS A BASE FOR FRIED VEGETABLE\n\nIf you can't find Youmaicai/Taiwanese Lettuce, we think Bok Choy would be another good choice here. And while we've never tried it ourselves, Swiss Chard seems like it'd be another logical choice for this flavor profile.\n\n* Youmaicai a.k.a. Taiwanese lettuce (油麦菜/A菜) -or- your veg of choice, 300g. This 'Taiwanese lettuce' may also be seen labelled as A-Choy or Sword Lettuce.\n* Fish from the can, 1/2 fish\n* Black beans from the can, 1 tbsp\n* Oil from the can, 1 tbsp\n* Aromatics: 2 cloves garlic, ~1 inch ginger\n* Seasoning: 1/4 tsp salt, 1/2 tsp sugar, 1 tsp light soy sauce (生抽)\n* Liaojiu a.k.a. Shaoxing wine (料酒/绍酒), ~1 tbsp. For use while stir frying.\n\nProcess:\n\nNote that if you're using a different vegetable (e.g. Bok Choy), you might want to quickly blanch it first. Taiwanese lettuce doesn't need a pre-blanch first because it's, well, lettuce - we just need to separate the stem section and the leaf section (the former takes longer to fry). For more information on how to pre-blanch, check out our stir fried veg 101 video: https://www.youtube.com/watch?v=a-Yu8qOAEYQ\n\nIf you're using blanched bok choy, just add it during step #5 after frying the aromatics and continue with the recipe.\n\n1. Roughly chop the fish and the black beans. Slice the ginger and garlic.\n\n2. Wash the lettuce, rip it in half into the stems and leaves. \n\n3. Longyau - get your wok piping hot, shut off the heat, add in the oil - here ~1 tbsp - and give in a swirl to get a non-stick surface.\n\n4. High flame. Add the aromatics, quick fry, ~15 seconds. Add in the stems. Fry for ~2 minutes, or until the stems obviously wilt a bit. \n\n5. Add the leaves. Fry for ~30 seconds. Scooch it all up the side of the wok.\n\n6. Add the fish and beans, fry a touch in the oil. Swirl in the wine. Quick mix. \n\n7. Season with the 1/4 tsp salt, 1/2 tsp sugar, and swirl in that 1 tsp soy sauce over your spatula and around the side of the wok. Quick mix, toss in the oil from the fish can. Another quick mix. \n\n____________________\nAnd check out our Patreon if you'd like to support the project!\n\nhttp://www.patreon.com/ChineseCookingDemystified\n\nOutro Music: คิดถึงคุณจัง by ธานินทร์ อินทรเทพ\nFound via My Analog Journal (great channel): https://youtu.be/GHaL5H-VYRg",
  "thumbnails": {
    "default": {
      "height": 90,
      "url": "https://i.ytimg.com/vi/IEC5ZfsOYp0/default.jpg",
      "width": 120
    },
    "medium": {
      "height": 180,
      "url": "https://i.ytimg.com/vi/IEC5ZfsOYp0/mqdefault.jpg",
      "width": 320
    },
    "high": {
      "height": 360,
      "url": "https://i.ytimg.com/vi/IEC5ZfsOYp0/hqdefault.jpg",
      "width": 480
    },
    "standard": {
      "height": 480,
      "url": "https://i.ytimg.com/vi/IEC5ZfsOYp0/sddefault.jpg",
      "width": 640
    },
    "maxres": {
      "height": 720,
      "url": "https://i.ytimg.com/vi/IEC5ZfsOYp0/maxresdefault.jpg",
      "width": 1280
    }
  }
}