{
  "title": "Chana masala — Indian-style chickpeas in spicy gravy",
  "video_published_at": "2020-09-24T18:00:12Z",
  "start_at": null,
  "end_at": null,
  "video_id": "iKMI1xkU_oo",
  "published_at": "2020-09-26T02:41:06Z",
  "description": "Thanks to Fetch Rewards for sponsoring this video! Download the app now and use the code RAGUSEA to get 2,000 points when you scan your first receipt! → https://fetch.thld.co/araguseasep Sign up for Fetch Rewards — the easiest way to save money on groceries! This is a limited time offer for my viewers.\n\n***EASY RECIPE, FEEDS 4-6***\n\n2 14 oz (400g) cans chickpeas, drained\n1 14 oz (400g) can crushed tomatoes\n1 4 oz (100g) can diced chiles\n1 tablespoon garam masala\n1 teaspoon onion powder\n1 teaspoon garlic powder\n1 teaspoon dried ginger\nsalt\noil\nvinegar or lemon juice\nfresh cilantro (optional)\n\nHeat a little oil in a pot over medium heat and fry the garam masala until fragrant. Stir in the chiles, tomatoes, chickpeas, garlic powder, onion power, ginger powder and enough water to cover everything. Simmer 20-30 minutes until thickened, taste and add salt and lemon/vinegar to taste, and stir in some cilantro leaves. Serve over basmati rice.\n\n***HARDER RECIPE, FEEDS 4-6***\n\n1.5 cups (500g) dried kabuli chana (or other chickpeas)\n1 large onion\n2-4 fresh chiles\n3-4 fresh tomatoes (or a 14 oz, 400g can of crushed tomatoes)\nhalf a head of garlic\n1 large thumb of ginger\n5-10 green cardamom pods\n2-3 bay leaves\n1 teaspoon cumin seeds\n1/2 teaspoon of coriander seeds\n1/2 teaspoon black peppercorns\n1/2 teaspoon mustard seeds\n1/2 teaspoon fenugreek seeds\n1 black cardamom pod\n1 small piece of cinnamon stick\n1/2 teaspoon turmeric\ntomato paste\nground amchoor or lemon juice\nsalt\nsugar\nghee (or of oil)\nfresh cilantro\n\nSoak the chickpeas for at least a few hours, then boil with a teaspoon of salt until just tender.\n\nPut the cumin, coriander seeds, peppercorns, mustard seeds, fenugreek seeds, black cardamom and cinnamon stick into a dry pan and toast over medium heat until fragrant. Cool and grind to a fine powder.\n\nPeel and roughly chop the onion, garlic and ginger. Roughly chop the tomato and chiles. Heat some ghee in your widest pan over medium heat and fry your fresh-ground masala along with the turmeric until fragrant. Add the garlic and ginger and fry for a moment, then all the rest of the chopped vegetables. Cook, stirring constantly, until enough water has evaporated that things are staring to brown. Deglaze the pan with a little water, then puree the contents. If you want a smooth sauce, push it through a fine mesh strainer.\n\nClean the pan, head some more ghee and fry the green cardamom pods and the bay leaves until fragrant. Put in about a tablespoon of tomato paste and fry it for moment before stirring in the pureed sauce. Stir in the cooked chickpeas along with as much cooking water as you want for the sauce texture you like, and simmer for about 15 minutes.\n\nStir in amchoor powder (or lemon juice), salt, a pinch of sugar and fresh cilantro to taste. Remove the bay leaves and serve over basmati rice.",
  "thumbnails": {
    "default": {
      "height": 90,
      "url": "https://i.ytimg.com/vi/iKMI1xkU_oo/default.jpg",
      "width": 120
    },
    "medium": {
      "height": 180,
      "url": "https://i.ytimg.com/vi/iKMI1xkU_oo/mqdefault.jpg",
      "width": 320
    },
    "high": {
      "height": 360,
      "url": "https://i.ytimg.com/vi/iKMI1xkU_oo/hqdefault.jpg",
      "width": 480
    },
    "standard": {
      "height": 480,
      "url": "https://i.ytimg.com/vi/iKMI1xkU_oo/sddefault.jpg",
      "width": 640
    },
    "maxres": {
      "height": 720,
      "url": "https://i.ytimg.com/vi/iKMI1xkU_oo/maxresdefault.jpg",
      "width": 1280
    }
  }
}