{
  "title": "Tri-flavor biscotti | almond & white chocolate, butterscotch pecan, chocolate peanut butter chip",
  "video_published_at": "2021-05-20T18:00:10Z",
  "start_at": null,
  "end_at": null,
  "video_id": "iMT6qQ8sCH8",
  "published_at": "2021-05-21T03:06:15Z",
  "description": "Become smarter in 5 minutes by signing up for free today: http://cen.yt/mbadamragusea4 — Thanks to Morning Brew for sponsoring today’s video!\n\n***BASE RECIPE, MAKES ~30 BISCOTTI***\n\n1 stick (4 oz, 113g) butter (I used unsalted)\n1 1/3 cups (270g) sugar\n3 eggs\n1/2 teaspoon (3g) salt (I used Morton kosher; maybe cut your salt in half if you're using salted butter)\n1 teaspoon (2g) baking powder\nvanilla\n3-4 cups (360-480g) all-purpose flour\n\nAdditional optional mix-ins: cocoa powder, nuts, various chocolate chips, large-crystal sugar, powdered sugar, food coloring, almond extract (or other extracts), etc.\n\nGet your oven heating to 325ºF/160ºC convection or 350ºF/180ºC conventional.\n\nSoften the butter without melting it — you can leave it out at room temperature for a while or microwave it on low power in 10-15 second intervals, rotating the butter each interval until it's soft.\n\nCombine the butter with the sugar in a large mixing bowl and beat them together until fluffy. Beat in the eggs and a little glug of vanilla until fluffy. Put in the salt, baking powder and 3 cups (360g) flour to begin with, and beat until everything is fully integrated. Keep beating in additional flour until you get a texture that still feels moist but is dry enough that it doesn't stick easily to your hands.\n\nYou could stir in some mix-ins and bake this dough as one loaf, or you could divide it up into three doughs in their own mixing bowls. Here's how I flavored my thirds, using about 1/4 cup each of chips and nuts:\n\n1) Butterscotch chips, pecans, additional vanilla\n\n2) White chocolate chips, a glug of almond extract, slivered almonds, green food coloring (make the color a little more intense than you want it in the end), additional big pinch of flour to balance the extra moisture (try to make the stickiness match the first batch)\n\n3) Two tablespoons (15g) dutch cocoa powder, a little glug of oil to counter the drying effect of the cocoa and an extra pinch of sugar to counter its bitterness, peanut butter chips, macadamia nuts — the texture of this dough should feel a little stiffer and drier, and you might need to knead it by hand to get the cocoa fully integrated\n\nWhen you have all the flavors mixed, get a parchment-lined (or greased and floured) baking sheet and lay out each dough in a long bar shape. You can then top them — I topped flavor #1 with demerara sugar, #2 with more slivered almonds and #3 with powdered sugar.\n\nBake until the loaves feel just firm enough that you could slice them without destroying them — I did 45 minutes. Take the pan out, and let the loaves cool for a few minutes until they are just firm enough to move safely to a cutting board. Slice each loaf into individual biscotti and return them to the pan — no parchment or other non-stick surface is needed at this point, and you can position the biscotti very close to each other.\n\nBake them again until they're as crunchy as you want them, keeping in mind they'll firm up a little more as they cool — I did about 30 minutes.",
  "thumbnails": {
    "default": {
      "height": 90,
      "url": "https://i.ytimg.com/vi/iMT6qQ8sCH8/default.jpg",
      "width": 120
    },
    "medium": {
      "height": 180,
      "url": "https://i.ytimg.com/vi/iMT6qQ8sCH8/mqdefault.jpg",
      "width": 320
    },
    "high": {
      "height": 360,
      "url": "https://i.ytimg.com/vi/iMT6qQ8sCH8/hqdefault.jpg",
      "width": 480
    },
    "standard": {
      "height": 480,
      "url": "https://i.ytimg.com/vi/iMT6qQ8sCH8/sddefault.jpg",
      "width": 640
    },
    "maxres": {
      "height": 720,
      "url": "https://i.ytimg.com/vi/iMT6qQ8sCH8/maxresdefault.jpg",
      "width": 1280
    }
  }
}