{
  "title": "Reverse braised beef shoulder | sweet pickle glaze",
  "video_published_at": "2021-06-17T18:00:12Z",
  "start_at": null,
  "end_at": null,
  "video_id": "ioGbDtIyq-Q",
  "published_at": "2021-06-18T02:01:28Z",
  "description": "Thanks to Noom for sponsoring this video! Take their health survey to get started: http://bit.ly/noom_adamragusea\n\n***RECIPE, SERVES SIX***\n\n1 3 lb (1.36kg) beef chuck roast \n2 shallots\n2 jalapeños\nvinegar (you'll need 1-2 cups, 236-473mL)\nsugar (maybe a quarter cup, 50g)\noil\nsalt\npepper\nmustard\nsalad greens (maybe 100g per person)\n\nCut the roast into a few thick steaks (with the meat fibers running up and down instead of side to side). Just cut it into big pieces that are easy for you to handle — they'll break apart into smaller chunks as you cook. Coat them in oil and a very generous seasoning of salt and pepper — it should seem like there's a little too much salt on them.\n\nLightly brown the meat in a big pan. Pour in enough water to almost cover the meat, cover the pan with a lid or foil, get the heat to a gentle simmer and cook until the meat is almost falling apart — I did about five hours.\n\nWhile you're waiting, you can cut the shallots and peppers into thin slices, put them in a bowl and nearly cover them with vinegar. Stir in a big handful of sugar (don't worry if it doesn't all dissolve immediately), cover and refrigerate. They'll taste like pickles in about a half hour, but longer is better — up to a week.\n\nGently fish the meat out of the pan, breaking it up as little as possible, and let the pieces dry/steam-off on paper towels for a few minutes. If there's still a lot of water in the pan, you could turn up the heat and reduce the liquid down a little bit now, but stop before it starts thickening into a glaze. Pour the liquid into a narrow vessel (a glass or measuring cup), holding back any gross chunks at the bottom of the pan.\n\nWhen the meat is dry and has stopped steaming, transfer it off the paper towels, cover it and put it into the refrigerator. Cover the liquid and refrigerate that as well. (You can do all of this first-thing the morning of dinner, or days before.) Chill until the meat is firm and the fat on top of the braising liquid has gone totally solid.\n\nWhen you're ready to actually make dinner, take the liquid out and lift the fat puck off the top. You could use that fat to re-sear the meat later, but make sure you scrape off any trace of broth or meat bits clinging to the bottom of the puck. (Any remaining water in the fat will spit as you heat it up to searing temperature.) Alternatively you could just throw the fat away, or you could melt it and use it as the oil in the salad dressing you're about to make.\n\nPour the de-fatted broth into a pan and pour in about half of the accumulated juice from your bowl of sweet pickles. Bring to a boil and reduce to a glaze, keeping in mind that it'll thicken a lot more as it cools to eating temperature. (This would be a good time to prep your salad greens.) Be sure to stir it frequently once it starts to really thicken — the sugar is liable to stick to the bottom of the pan and burn. Turn the heat off and let the glaze just sit in the warm pan until you need it.\n\nMake a vinaigrette for your salad by mixing more of your sweet pickle juice with a little mustard and however much oil you like — I do equal parts pickle juice and olive oil.\n\nIn a wide pan, heat a thick film of oil (or your rendered beef fat, assuming you got all the watery stuff scraped off of it) over moderate heat. Take your cold beef out of the fridge, tear off a little chunk and taste for seasoning. (If it seems to need more salt, you could season the pieces, or your could season the glaze.) Lay the pieces in the hot oil and brown them gently on both sides until golden and the interior of the meat feels soft and reheated. \n\nTake the pan off the heat and the meat can sit in there for a few minutes while you get your plates ready and dress your salad (if you want to dress it in advance). Plate each portion of drained meat with some salad and drained pickles. Either spoon the glaze over the meat at the last second or serve it in a little cup on the side.",
  "thumbnails": {
    "default": {
      "height": 90,
      "url": "https://i.ytimg.com/vi/ioGbDtIyq-Q/default.jpg",
      "width": 120
    },
    "medium": {
      "height": 180,
      "url": "https://i.ytimg.com/vi/ioGbDtIyq-Q/mqdefault.jpg",
      "width": 320
    },
    "high": {
      "height": 360,
      "url": "https://i.ytimg.com/vi/ioGbDtIyq-Q/hqdefault.jpg",
      "width": 480
    },
    "standard": {
      "height": 480,
      "url": "https://i.ytimg.com/vi/ioGbDtIyq-Q/sddefault.jpg",
      "width": 640
    },
    "maxres": {
      "height": 720,
      "url": "https://i.ytimg.com/vi/ioGbDtIyq-Q/maxresdefault.jpg",
      "width": 1280
    }
  }
}