{
  "title": "The Food Lab's Sage and Sausage Stuffing (or Dressing)",
  "video_published_at": "2016-11-10T00:22:58Z",
  "start_at": null,
  "end_at": null,
  "video_id": "J5ZraZz-L4A",
  "published_at": "2017-05-22T02:16:45Z",
  "description": "http://www.seriouseats.com/2010/11/how-to-make-the-best-stuffing-for-thanksgiving.html\n\nWhile it can be made with any number of bases, my favorite stuffing is made with bread, broth, eggs, and butter. Essentially it's best to think of it as a savory bread pudding when constructing a recipe. The key to great bread pudding is to use the bread as a sponge to soak up as much flavorful liquid as possible.\n\nNote: dried or fresh fruits and nuts can be folded into the stuffing along with the bread cubes if desired in step 3. Stuffing can be prepared through step 3 and placed in greased casserole dish the day before. Remove from refrigerator and allow to come to room temperature for at least 1 hour before baking the next day. This makes an excellent bird stuffing, and is enough to stuff several small birds or two to three 18 to 22 pound birds.\n\nINGREDIENTS:\n2 1/2 pounds (1.25kg; about 2 loaves) high quality sandwich bread or soft Italian or French bread, cut into 3/4-inch dice, about 5 quarts\n8 tablespoons (1 stick; 4 ounces; 115g) butter\n1 1/2 pounds sage sausage, removed from casing\n1 large onion, finely chopped (about 12 ounces; 350g)\n4 large stalks celery, finely chopped (about 12 ounces; 350g)\n2 cloves garlic, minced or grated on microplane\n1/4 cup minced fresh sage leaves (or 2 teaspoons dried sage leaves)\n32 ounces (4 cups; 1l) low-sodium homemade or store-bought low-sodium chicken or turkey stock\n3 whole eggs\n1/4 cup minced parsley leaves\nKosher salt and freshly ground black pepper\n\nDIRECTIONS:\n1. Adjust oven racks to lower middle and upper middle position. Preheat oven to 275°F. Spread bread evenly over two rimmed baking sheets. Stagger trays on oven racks and bake until completely dried, about 50 minutes total, rotating trays and stirring bread cubes several times during baking. Remove from oven and allow to cool. Increase oven heat to 350°F\n\n2. In large Dutch oven, melt butter over medium high heat until foaming subsides (don't allow butter to brown), about 2 minutes. Add sausage and mash with stiff whisk or potato masher to break up into fine pieces (largest pieces should be no greater than 1/4-inch). Cook, stirring frequently until only a few bits of pink remain, about 8 minutes. Add onions, celery, garlic, and sage and cook, stirring frequently, until vegetables are softened, about 10 minutes. Remove from heat and add half of chicken stock.\n\n3. Whisk remaining chicken stock, eggs, and 3 tablespoons parsley in medium bowl until homogeneous. Stirring constantly with wooden spoon, slowly pour egg mixture into sausage mixture. Add bread cubes and fold gently until evenly mixed.\n\n4. Use part of stuffing to stuff bird if desired. To cook remaining stuffing, transfer to buttered 9 by 13 rectangular baking dish (or 10 by 14 oval dish), cover tightly with aluminum foil, and bake until instant read thermometer reads 150°F when inserted into center of dish, about 45 minutes. Remove foil and continue baking until golden brown and crisp on top, 15 to 20 minutes longer. Remove from oven, let cool for 5 minutes, sprinkle with remaining parsley and serve.\n\nMusic: Bensound.com",
  "thumbnails": {
    "default": {
      "height": 90,
      "url": "https://i.ytimg.com/vi/J5ZraZz-L4A/default.jpg",
      "width": 120
    },
    "medium": {
      "height": 180,
      "url": "https://i.ytimg.com/vi/J5ZraZz-L4A/mqdefault.jpg",
      "width": 320
    },
    "high": {
      "height": 360,
      "url": "https://i.ytimg.com/vi/J5ZraZz-L4A/hqdefault.jpg",
      "width": 480
    },
    "standard": {
      "height": 480,
      "url": "https://i.ytimg.com/vi/J5ZraZz-L4A/sddefault.jpg",
      "width": 640
    },
    "maxres": {
      "height": 720,
      "url": "https://i.ytimg.com/vi/J5ZraZz-L4A/maxresdefault.jpg",
      "width": 1280
    }
  }
}