{
  "title": "How to Make Ramen Like a Pro at Home Feat. Mr. Shono from MENSHO",
  "video_published_at": "2017-02-01T22:17:14Z",
  "start_at": null,
  "end_at": null,
  "video_id": "J8pH_H4caRQ",
  "published_at": "2018-03-15T05:24:36Z",
  "description": "※We couldn't turn off the fan so the sound is not clear. \nPlease make sure to turn on the English subtitle :)\n\nRamen creator Shono-san joins me today to teach a quick and easy ramen recipe you can make at home. With a balance of soup, tare, oil, toppings, and noodles, a ramen feast is just a few hours away.\n\nThis style is known as Takeoka, after the region in Chiba where it is from. The broth is very simple, sometimes only the hot water from boiling the noodles. Noodles are dry, as opposed to fresh. Extra chashu and fresh onion are other staples of Takeoka ramen.\n\nThe site with the full recipe went down a while ago, but I managed to find an old file:\n\nBefore we start with the recipe, let’s check out some of the different Japanese ingredients & condiments used in making ramen:\n\nMirin(味醂) : It’s a type of rice wine similar to sake, but with a lower alcohol content and higher sugar level. It can sometimes be used to accompany sushi and is used in the making of teriyaki sauce. Its flavor is very strong so never use in excess.\nTamari Soy Sauce : This is not your regular soy sauce. It has been made exclusively with soy beans. Cheap soy sauce often contains flour, but this one doesn’t ! It tastes a lot stronger than regular soy sauce, and is much darker.\nSake (酒) : Japanese rice alcohol.\nThe condiments in the video are listed in cc. If you are not used to measuring in cc, just remember that : 1 cc is  1ml. Simple !\n\nMake sure to get all the ingredients ready before starting, as ramen cooking requires speed during the last stages. Here is a list of what you will need :\n\n500g of Pork Belly\n2 Green Onion\n100g of Garlic\nMirin : 1000ml\nSake : 500ml\nTamari Soy Sauce : 500ml\nWater (2L)\n1 Green Onion\nGarlic 50g\nGinger 50g\nCreating a ramen requires to work in layers. First of all, you need to work on the Chashu ! The…what… ?\n\nMAKING THE CHASHU\nchashu-cut\nSource: YouTube\nChar-siu in Chinese is simmered pork belly which is the main topping on most ramen. Like ramen itself, it originated from China but it evolved into a Japanese recipe. It takes a while to prepare it because you need to have it cook slowly in order to make the meat soft so it can melt in your mouth.\n\nTo prepare the Chashu, you will need :\n\n500g of Pork Belly\n1 Green Onion\n100g of Garlic\nMirin : 1000ml\nSake : 500ml\nTamari Soy Sauce : 500ml\nLet’s get on with it, shall we?\n\nCut the green onion into large pieces.\n\nIn order for it to cook faster, cut the pork belly into 3 pieces and put into a large cooking pot. Mix in the cut green onion as well as the garlic. Add the tamari soy sauce, sake, mirin and put on a low heat for 2 hours until the Chashu is cooked.\n\nramen-recipe-soy\nSource: YouTube\nCut it into slices (not too thick, not too thin), and leave to rest.chashu-ramen\n\nON TO THE SOUP!\nNow onto the soup. The ramen of this recipe has a very thick broth with a strong taste. It’s inspired by a ramen shop in Chiba called Umenoya.\n\nramen recipe\nPicture by Ramen Adventures\nRun by three old ladies this shop serves a dark bowl with a very garlic-y soup, topped with raw onions and lots of very seasoned chashu. It’s a 3 hour trip away from Tokyo, but now you can try it directly at home !\n\nHere’s what you’ll need for the soup !\n\nWater (2L)\n1 Green Onion\nGarlic 50g\nGinger 50g\nPut all the ingredients in a cooking pot and let it simmer for 2 hours on low heat. While waiting why not check out some of our other food articles, watch other ramen videos from Brian’s channel, or read a good book ?\n\nOkay, now on to the base of your ramen. Don’t give up we’re almost there !\n\nTo build the layers of your bowl, you will need :\n\nTare : From the pot you’ve used to cook the Chashu, use a colander to keep the cooked soy sauce in a bowl.\nChicken Oil 80ml\nMinced garlic\nDice the onion into small pieces and put it in water in order to reduce the bite of the onion (use a colander to do so).\n\nUnless you can get your hands on real Japanese noodles, you can still use instant ramen noodles. Don’t worry! It’ll still blow your mind.\n\nWith all the condiments next to you, time to build the layers. Noodles take 2 minutes to cook so you only have 2 minutes to make it.\n\nFirst, 80ml of Tare and 30ml of Chicken oil. Make sure to be SUPER PRECISE!! That’s the key to a great ramen, precision! Then add in the thinly cut garlic.\n\nramen recipePour in 200ml of the hot soup.\n\nAdd in the noodles, use chopsticks to lift them once in order to separate them a little bit.\n\nnoodles-recipe\n\nTop it up with the Chashu slices, some bits of green onion, the diced onion, and a sprinkle of ground pepper.\n\nDONE ! \n\n\nBLOG\nhttp://www.ramenadventures.com\nBOOK\nhttp://www.amazon.co.jp/dp/4902800268\nFACEBOOK\nhttps://www.facebook.com/ramenadventure\nINSTAGRAM\nhttps://www.instagram.com/ramenadventures/\nYummy Japan\nhttp://yummyjapan-blog.net/\n\nMusic Credit: https://soundcloud.com/birocratic/",
  "thumbnails": {
    "default": {
      "height": 90,
      "url": "https://i.ytimg.com/vi/J8pH_H4caRQ/default.jpg",
      "width": 120
    },
    "medium": {
      "height": 180,
      "url": "https://i.ytimg.com/vi/J8pH_H4caRQ/mqdefault.jpg",
      "width": 320
    },
    "high": {
      "height": 360,
      "url": "https://i.ytimg.com/vi/J8pH_H4caRQ/hqdefault.jpg",
      "width": 480
    },
    "standard": {
      "height": 480,
      "url": "https://i.ytimg.com/vi/J8pH_H4caRQ/sddefault.jpg",
      "width": 640
    },
    "maxres": {
      "height": 720,
      "url": "https://i.ytimg.com/vi/J8pH_H4caRQ/maxresdefault.jpg",
      "width": 1280
    }
  }
}