{
  "title": "How to Make Home-style Red Braised Pork Belly (红烧肉)",
  "video_published_at": "2017-05-30T04:10:12Z",
  "start_at": null,
  "end_at": null,
  "video_id": "K4E1Y27LWQE",
  "published_at": "2021-03-04T03:32:38Z",
  "description": "This time our guest cook Rob whipped up some Hongshaorou, a.k.a. Red braised pork belly!  An awesome dish, real simple... and with no real exotic ingredients, so it's pretty easy to make if you're outside of China too.\n\nIf you're a bit hesitant because of the pork skin and fat, don't be - after cooking low and slow, the pork skin'll turn into jelly and the fat'll melt in your mouth like butter.\n\nAs always, a detailed recipe and ingredient list is in this /r/cooking post on reddit:\n\nhttps://www.reddit.com/r/Cooking/comments/6e5tw0/recipe_how_to_make_chinese_homestyle_red_braised/\n\nABOUT US\n-----------------------------------------------------------------------------------------\nI'm Chris Thomas from the United States and I've been living as an expat in China now for upwards of nine years, most of which in Shenzhen. I love living here, and the food is absolutely incredible. I read and speak some Chinese, and have been trying to religiously recreate the most authentic versions of the food I've eaten and loved here.\n\nMy partner in these videos is Stephanie Li, my similarly food-and-travel-obsessed long term girlfriend. She's a translator from Guangzhou and is an incredible home cook. Sometimes I'll be behind the wok but usually it'll be her cooking.",
  "thumbnails": {
    "default": {
      "height": 90,
      "url": "https://i.ytimg.com/vi/K4E1Y27LWQE/default.jpg",
      "width": 120
    },
    "medium": {
      "height": 180,
      "url": "https://i.ytimg.com/vi/K4E1Y27LWQE/mqdefault.jpg",
      "width": 320
    },
    "high": {
      "height": 360,
      "url": "https://i.ytimg.com/vi/K4E1Y27LWQE/hqdefault.jpg",
      "width": 480
    },
    "standard": {
      "height": 480,
      "url": "https://i.ytimg.com/vi/K4E1Y27LWQE/sddefault.jpg",
      "width": 640
    },
    "maxres": {
      "height": 720,
      "url": "https://i.ytimg.com/vi/K4E1Y27LWQE/maxresdefault.jpg",
      "width": 1280
    }
  }
}