{
  "title": "Chocolate Ganache Tart | Keep Calm And Bake",
  "video_published_at": "2014-09-20T07:30:01Z",
  "start_at": null,
  "end_at": null,
  "video_id": "k_stuqF82rQ",
  "published_at": "2017-03-16T02:39:57Z",
  "description": "In this episode of Keep Calm and Bake Holly Bell shows you how to make chocolate Ganache tart.\n\nSubscribe! http://www.youtube.com/subscription_center?add_user=Videojugfoodanddrink\nCheck Out Our Channel Page: http://www.youtube.com/user/Videojugfoodanddrink\nLike Us On Facebook! http://www.facebook.com/pages/Food-Drink-Club/382470928450558\nFollow Us On Twitter! http://www.twitter.com/videojugfood\n\nWatch This and Other Related films here:\nhttp://www.videojug.com/film/how-to-make-chocolate-ganache-tart\n\n\nINGREDIENTS:\n250 g Plain Flour\n50 g Icing Sugar\n120 g Butter\n1 Large Egg\n300 ml Double Cream\n50 g Salted Butter, Cubed\n100 g Dark Chocolate, Finely Chopped\n150 g Milk Chocolate, Finely Chopped\n\nSTEP 1: MAKE PASTRY\nMake the pastry by rubbing the butter into the flour and icing sugar (use hands/food processor or KitchenAid on speed 1/2 using flat beater) until you have a breadcrumb like consistency. Then bind together with the egg using either a blunt knife or the flat beater at speed 1 on the KitchenAid. Once you have clumps of pastry pulling together, use your hands to gather into a ball. Wrap in clingfilm and chill in the fridge for 30 minutes.\n\nSTEP 2: PREPARE PASTRY\nRoll the pastry to a thickness of about 3mm and line a 23cm loose bottomed tart tin with it. (I move the pastry by laying both hands under the pastry with palms upwards and fingers spread wide.) Make sure the pastry is pushed into the corners, then run the rolling pin over the top of the tart tin to trim the pastry edges. Line the pastry with greaseproof paper and fill with baking beans/uncooked rice or pulses. Bake in a preheated 180C/Gas 4 oven for 15 minutes then remove the beans and paper and bake until lightly golden brown and baked through. Remove from the oven and allow to cool but leave in the tin.\n\nSTEP 3: MAKE GANACHE\nMake the ganache by boiling the cream in a small saucepan until just boiling. Do not allow to boil for long or the ganache will be grainy. Then add the butter and chocolate and stir until completely smooth. Pour into your blind baked pastry case and leave to set, either on the side at room temperature overnight for a soft set. Or in the fridge which is a lot faster and achieves a hard set. If you use the fridge method the tart will lose a little of its shine though taste not compromised.",
  "thumbnails": {
    "default": {
      "height": 90,
      "url": "https://i.ytimg.com/vi/k_stuqF82rQ/default.jpg",
      "width": 120
    },
    "medium": {
      "height": 180,
      "url": "https://i.ytimg.com/vi/k_stuqF82rQ/mqdefault.jpg",
      "width": 320
    },
    "high": {
      "height": 360,
      "url": "https://i.ytimg.com/vi/k_stuqF82rQ/hqdefault.jpg",
      "width": 480
    },
    "standard": {
      "height": 480,
      "url": "https://i.ytimg.com/vi/k_stuqF82rQ/sddefault.jpg",
      "width": 640
    },
    "maxres": null
  }
}