{
  "title": "Sodium Citrate Mac & Cheese — Silky Smooth",
  "video_published_at": "2019-05-30T18:00:02Z",
  "start_at": null,
  "end_at": null,
  "video_id": "KcM_MZoJWOo",
  "published_at": "2020-08-21T15:57:22Z",
  "description": "A common food additive allows you to make silky-smooth mac & cheese at home. This is basically a fancier version of my dad's recipe. Serves 6-8.\n\n1 lb dried pasta shells\n3 cups milk \n1 cup white wine\n1/2 lb sharp Cheddar\n1/2 smoked Gouda\n1/2 stick butter\n4 teaspoons sodium citrate (easily ordered online)\n1/2 teaspoon mustard powder\n1/2 teaspoon garlic powder\nblack pepper\ncayenne pepper\n\nStart the oven preheating to 350 F and put a pot of water on the boil for the pasta. Grate the cheese.\n\nIn another pot, warm the milk and wine on medium heat. Put in the sodium citrate, mustard and garlic powders, many grinds of pepper and a pinch of cayenne. Put in the butter, cold. Gradually whisk in handfuls of cheese until everything is melted in, then turn off the heat.\n\nSalt the pasta water and par-boil the shells for five minutes.\n\nOil or spray a baking dish that holds at least 2.5 quarts. Pour in the drained pasta and then the cheese sauce. Stir to combine. Cover the dish and bake for 45 minutes.\n\nUncover and bake for an additional 30 minutes until brown on top. If you want it more brown, turn on the broiler at the very end. Let rest 30 min before scooping it out.\n\nIf you're not up for the sodium citrate, try my dad's recipe. It uses American cheese, which already has sodium citrate in it: https://youtu.be/9iP1QXFWYkA\n\nMY COOKING PHILOSOPHY: I don't like weighing or measuring things if I don't have to, and I don't like to be constantly checking a recipe as I cook. I don't care that volume is a bad way of measuring things — it's usually easier. I like for a recipe to get me in the ballpark, and then I like to eyeball and improvise the rest. If you're like me, my goal with these videos is to give you a sense of how the food should look and feel as you're cooking it, rather than give you a refined formula to reproduce.",
  "thumbnails": {
    "default": {
      "height": 90,
      "url": "https://i.ytimg.com/vi/KcM_MZoJWOo/default.jpg",
      "width": 120
    },
    "medium": {
      "height": 180,
      "url": "https://i.ytimg.com/vi/KcM_MZoJWOo/mqdefault.jpg",
      "width": 320
    },
    "high": {
      "height": 360,
      "url": "https://i.ytimg.com/vi/KcM_MZoJWOo/hqdefault.jpg",
      "width": 480
    },
    "standard": {
      "height": 480,
      "url": "https://i.ytimg.com/vi/KcM_MZoJWOo/sddefault.jpg",
      "width": 640
    },
    "maxres": {
      "height": 720,
      "url": "https://i.ytimg.com/vi/KcM_MZoJWOo/maxresdefault.jpg",
      "width": 1280
    }
  }
}