{
  "title": "Science: Does Potato Type Matter? How to Choose the Best Potato for the Right Recipe",
  "video_published_at": "2012-10-26T22:52:01Z",
  "start_at": null,
  "end_at": null,
  "video_id": "kr6j3nvQf28",
  "published_at": "2017-05-29T21:02:27Z",
  "description": "Buy Cook's Science today: http://amzn.to/212U0nC\nThe Science of Good Cooking: http://amzn.to/1O8oGw7\n\nWatch Test Cook Dan Souza illustrate Concept #25, \"All Potatoes Are Not Created Equal,\" with an in-depth kitchen experiment involving brines and blue food dye. Keep your eyes peeled (get it?) for some great mashed-potato action.\n\nLearn more about the experiment (with action photos!):\nhttp://www.americastestkitchenfeed.com/cooking-science/2012/10/we-prove-it-all-potatoes-are-not-created-equal/\n\nAmerica's Test Kitchen is a real 2,500 square foot test kitchen located just outside of Boston that is home to more than three dozen full-time cooks and product testers. Our mission is simple: to develop the absolute best recipes for all of your favorite foods. To do this, we test each recipe 30, 40, sometimes as many as 70 times, until we arrive at the combination of ingredients, technique, temperature, cooking time, and equipment that yields the best, most-foolproof recipe.\n\nEach week, the cast of America's Test Kitchen brings the recipes, testings, and tastings from Cook's Illustrated magazine to life on our public television series. With more than 2 million viewers per episode, we are the most-watched cooking show on public television.\nhttp://www.americastestkitchen.com\n\nMore than 1.3 million home cooks rely on Cook's Illustrated and Cook's Country magazines to provide trusted recipes that work, honest ratings of equipment and supermarket ingredients, and kitchen tips.\nhttp://www.cooksillustrated.com\nhttp://www.cookscountry.com",
  "thumbnails": {
    "default": {
      "height": 90,
      "url": "https://i.ytimg.com/vi/kr6j3nvQf28/default.jpg",
      "width": 120
    },
    "medium": {
      "height": 180,
      "url": "https://i.ytimg.com/vi/kr6j3nvQf28/mqdefault.jpg",
      "width": 320
    },
    "high": {
      "height": 360,
      "url": "https://i.ytimg.com/vi/kr6j3nvQf28/hqdefault.jpg",
      "width": 480
    },
    "standard": {
      "height": 480,
      "url": "https://i.ytimg.com/vi/kr6j3nvQf28/sddefault.jpg",
      "width": 640
    },
    "maxres": {
      "height": 720,
      "url": "https://i.ytimg.com/vi/kr6j3nvQf28/maxresdefault.jpg",
      "width": 1280
    }
  }
}