{
  "title": "How to Make Oyakodon (Japanese Chicken and Egg Rice Bowl)",
  "video_published_at": "2016-08-03T00:21:47Z",
  "start_at": null,
  "end_at": null,
  "video_id": "kSmH01K76lY",
  "published_at": "2017-06-05T00:35:51Z",
  "description": "Oyakodon is a simple Japanese one-pot dish of chicken thighs and eggs flavored with soy sauce and sake. Learn how to make this quick and easy meal!\n\nHere's the full recipe: http://www.seriouseats.com/2016/08/how-to-make-oyakodon-japanese-chicken-egg-rice-bowl.html\n\nRECIPE:\n\nNOTES:\nHomemade dashi is nice, but not necessary for this simple dish, which has so many other strong flavors. Chicken breast can be used in place of chicken thigh if you prefer. Mitsuba is a Japanese herb similar to parsley. It can be found in Japanese grocery stores; omit it if unavailable. Togarashi is Japanese chili powder, which comes in both ichimi (chilies only) and shichimi (chilies blended with other dried aromatics) versions. Either will work on this dish. For a richer finished dish, use 4 eggs, reserving 2 of the yolks. Beat the extra egg whites together with the remaining eggs in step 2, then add the reserved egg yolks to the finished bowls just before serving.\n\nINGREDIENTS:\n1 cup (240ml) homemade dashi, or the equivalent in Hondashi (see note above)\n1 tablespoon (15ml) soy sauce, plus more to taste\n2 tablespoons (30ml) dry sake\n1 tablespoon (15g) sugar, plus more to taste\n1 large onion, slivered (about 6 ounces; 170g)\n12 ounces (340g) boneless, skinless chicken thighs, thinly sliced (see note above)\n3 thinly sliced scallions, divided\n2 stems mitsuba (optional; see note above)\n3 to 4 large eggs (see note above)\nTo Serve:\n2 cups cooked white rice\nTogarashi (see note above)\n\n\nDIRECTIONS\n1. Combine dashi, soy sauce, sake, and sugar in a small saucepan and bring to a simmer over high heat. Adjust heat to maintain a strong simmer. Stir in onion and cook, stirring occasionally, until onion is half tender, about 5 minutes. Add chicken pieces and cook, stirring and turning chicken occasionally, until chicken is cooked through and broth has reduced by about half, 5 to 7 minutes for chicken thighs or 3 to 4 minutes for chicken breast. Stir in half of scallions and all of mitsuba (if using), then season broth to taste with more soy sauce or sugar as desired. The sauce should have a balanced sweet-and-salty flavor.\n\n2. Reduce heat to a bare simmer. Beat eggs lightly with chopsticks in a medium bowl. Pour eggs into pot in a thin, steady stream (see note above), holding your chopsticks over edge of bowl to help distribute eggs evenly (see video above). Cover and cook until eggs are cooked to desired doneness, about 1 minute for runny eggs or 3 minutes for medium-firm.\n\n3. To Serve: Transfer hot rice to a single large bowl or 2 individual serving bowls. Top with egg and chicken mixture, pouring out any excess broth from saucepan over rice. Add an extra egg yolk to center of each bowl, if desired (see note above). Garnish with remaining half of sliced scallions and togarashi. Serve immediately.\n\nMusic: Bensound.com",
  "thumbnails": {
    "default": {
      "height": 90,
      "url": "https://i.ytimg.com/vi/kSmH01K76lY/default.jpg",
      "width": 120
    },
    "medium": {
      "height": 180,
      "url": "https://i.ytimg.com/vi/kSmH01K76lY/mqdefault.jpg",
      "width": 320
    },
    "high": {
      "height": 360,
      "url": "https://i.ytimg.com/vi/kSmH01K76lY/hqdefault.jpg",
      "width": 480
    },
    "standard": {
      "height": 480,
      "url": "https://i.ytimg.com/vi/kSmH01K76lY/sddefault.jpg",
      "width": 640
    },
    "maxres": null
  }
}