{
  "title": "Chinese Roast Duck - Thai Style (MK Suki Duck) เป็ดย่าง MK | Thai Recipes",
  "video_published_at": "2019-08-16T13:00:16Z",
  "start_at": null,
  "end_at": null,
  "video_id": "kzicfCEVmmQ",
  "published_at": "2019-08-28T20:45:48Z",
  "description": "MK Suki is a popular hot pot restaurant chain in Thailand that's known for their Chinese roast duck. But this is different from your typical Chinese BBQ duck from Chinatown in N. America because this is done \"Thai style\". That basically means that the duck comes with a delicious gravy that's enriched with coconut milk. Instead of doing a whole duck, I'm roasting only duck breast to make it more convenient for home cooking. It's really quite easy, and the gravy can be made well in advance. Enjoy!\n\nJOIN US ON PATREON FOR BONUS CONTENT: https://www.patreon.com/pailinskitchen\n\nMY KITCHEN TOOLS & INGREDIENTS: https://kit.co/hotthaikitchen\n\nWRITTEN RECIPE: https://hot-thai-kitchen.com/chinese-roast-duck\n\nMY COOKBOOK: https://hot-thai-kitchen.com/htk-cookbook/\n\nCONNECT WITH ME!\nhttps://facebook.com/HotThaiKitchen\nhttps://instagram.com/HotThaiKitchen\nhttps://twitter.com/HotThaiKitchen\nhttps://www.pinterest.com/hotthaikitchen\n\n----------------\n\nAbout Pai:\n\nPailin “Pai” Chongchitnant is the author of the Hot Thai Kitchen cookbook, co-host of a Canadian TV series One World Kitchen on Gusto TV, and creator and host of the YouTube channel Pailin's Kitchen. \n\nPai was born and raised in southern Thailand where she spent much of her \"playtime\" in the kitchen. She traveled to Canada to study Nutritional Sciences at the University of British Columbia, and was later trained as a chef at Le Cordon Bleu culinary school in San Francisco. \n\nAfter working in both Western and Thai professional kitchens, she decided that her passion really lies in educating and empowering others to cook at home via YouTube videos, her cookbook, and cooking classes. She currently lives in Vancouver, and goes to Thailand every year to visit her family. Visit her at http://hot-thai-kitchen.com",
  "thumbnails": {
    "default": {
      "height": 90,
      "url": "https://i.ytimg.com/vi/kzicfCEVmmQ/default.jpg",
      "width": 120
    },
    "medium": {
      "height": 180,
      "url": "https://i.ytimg.com/vi/kzicfCEVmmQ/mqdefault.jpg",
      "width": 320
    },
    "high": {
      "height": 360,
      "url": "https://i.ytimg.com/vi/kzicfCEVmmQ/hqdefault.jpg",
      "width": 480
    },
    "standard": {
      "height": 480,
      "url": "https://i.ytimg.com/vi/kzicfCEVmmQ/sddefault.jpg",
      "width": 640
    },
    "maxres": {
      "height": 720,
      "url": "https://i.ytimg.com/vi/kzicfCEVmmQ/maxresdefault.jpg",
      "width": 1280
    }
  }
}