{
  "title": "This Monster Veal Parmigiana Is a Red Sauce Classic | Food Skills",
  "video_published_at": "2018-05-14T19:00:02Z",
  "start_at": null,
  "end_at": null,
  "video_id": "kZOvI0vniOY",
  "published_at": "2018-05-15T02:27:28Z",
  "description": "Dripping in sauce and covered in cheese, veal parmigiana is not only a staple of  Italian-American cooking, but one of the world's great comfort foods. At Emilio's Ballato—a last vestige of Manhattan's old-school Italian eaters—the veal parm is a dish made to appease the New York appetite: breaded, pan fried, and coated in a heavy blanketing of melted buffalo mozzarella. Each night, the restaurant's executive chef, Anthony Vitolo, prepares the plate-sized cut of meat as if he's cooking for his extended family. And though Emilio's Ballato is often slapped lovingly with the label of \"red sauce joint,\" the trattoria excels well beyond the basics of marinara and meatballs. Still, as restaurants around the city continue to embrace the high-end and haute, the veal parmigiana at Emilio's Ballato is a must-try for Italian food-lovers the world over.  \n\nSubscribe to First We Feast on YouTube: http://goo.gl/UxFzhK\nCheck out more of First We Feast here:\nhttp://firstwefeast.com/\nhttps://twitter.com/firstwefeast\nhttps://www.facebook.com/FirstWeFeast\nhttp://instagram.com/firstwefeast\n\n\nFirst We Feast videos offer an iconoclastic view into the culinary world, taking you behind-the-scenes with some of the country's best chefs and finding the unexpected places where food and pop culture intersect.",
  "thumbnails": {
    "default": {
      "height": 90,
      "url": "https://i.ytimg.com/vi/kZOvI0vniOY/default.jpg",
      "width": 120
    },
    "medium": {
      "height": 180,
      "url": "https://i.ytimg.com/vi/kZOvI0vniOY/mqdefault.jpg",
      "width": 320
    },
    "high": {
      "height": 360,
      "url": "https://i.ytimg.com/vi/kZOvI0vniOY/hqdefault.jpg",
      "width": 480
    },
    "standard": null,
    "maxres": null
  }
}