{
  "title": "胡椒餅做法 How to Make Pepper Buns",
  "video_published_at": "2019-06-01T07:49:27Z",
  "start_at": null,
  "end_at": null,
  "video_id": "L7BHA7KMEsU",
  "published_at": "2020-07-27T02:54:48Z",
  "description": "胡椒餅做法相傳源自於福建福州，臺灣人稱之為胡椒餅或福州餅，福州人稱之為蔥肉餅。不論是胡椒餅或蔥肉餅，都是當地著名的街頭美食或必吃的夜市小吃。臺灣的「胡椒餅」名稱的由來，除了源自其招牌的胡椒香味以外，也是由於「胡椒餅」與「福州餅」的臺灣話發音十分相近。\n\n市面上常見的胡椒餅多以炭火及圓形鐵桶烤製而成。然而，其實我們也可以自己在家用烤箱自製，只要照著我們這裡的食譜與步驟，就能做出外皮酥脆可口、內餡香濃多汁的胡椒餅，不用大老遠跑去排隊，也能吃到幸福的滋味～\n\n附註說明：\n1. 片中描述的烤溫是指用溫度計測得的實際溫度。\n2. 我們這邊不採用油酥來製作多層次酥皮的原因如下：(1) 採用油酥製作的酥皮會比較容易吸收內餡湯汁而變得軟爛；(2) 不採用油酥能更加凸顯麵皮的麥香味；(3) 採用油酥的熱量較高；(4) 不採用油酥能大幅簡化製作步驟；(5) 我們自認為吃過最好吃的臺灣胡椒餅餅皮也是不用油酥的。\n\n圖文版食譜請見\nhttps://cooking23s.blogspot.com/2019/06/pepper-buns.html\n\nTaiwan's pepper buns or Fuzhou buns allegedly originated in Fuzhou, Fujian, where they are called \"scallion and pork buns\". Both in Taiwan and Fuzhou, they have become one of the most famous street snacks or night-market must-eats. They are called \"pepper buns\" in Taiwan not only because of the signature flavour of pepper, but also because of the similar pronunciations of \"pepper\" and \"Fuzhou\" in Taiwanese. \n\nThe pepper buns we bought on the street are usually made with a coal-fired big circular iron bucket. Actually, they can also be made with an oven at home. Just follow our recipe and steps, and you can make your own crispy and juicy pepper buns by yourself without joining the queues on the street any longer.\n\nFor the detailed recipe article, just hit the following link ----\nhttps://cooking23s.blogspot.com/2019/06/pepper-buns.html\n\nPS, all of the oven temperatures mentioned are actual temperatures.\n\n更多臺式菜餚做法影片\nMore Videos about Taiwanese Dishes\nhttps://youtube.com/playlist?list=PLXvR9JBcPulkIOg7ZbHF0sNCQeExcZabK\n\n#臺灣版\n#MustEat\n#TaiwanStyle\n\n想免費獲得更多美食食譜，現在就訂閱並開啟小鈴鐺。有任何問題，歡迎在底下留言。支持我，請按讚與分享。\n\nSubscribe and hit the notification bell now to see more gourmet cooking tutorials for free. Leave a comment if you have any questions. Hit the \"like\" and \"share\" buttons to show your support.  \n\n美食二三事 Cooking23s\nhttps://cooking23s.blogspot.com\n\n追蹤最新消息 Follow \n➞ YouTube https://youtube.com/c/Cooking23s\n➞ IG https://www.instagram.com/cooking23s\n➞ FB https://www.facebook.com/cooking23s",
  "thumbnails": {
    "default": {
      "height": 90,
      "url": "https://i.ytimg.com/vi/L7BHA7KMEsU/default.jpg",
      "width": 120
    },
    "medium": {
      "height": 180,
      "url": "https://i.ytimg.com/vi/L7BHA7KMEsU/mqdefault.jpg",
      "width": 320
    },
    "high": {
      "height": 360,
      "url": "https://i.ytimg.com/vi/L7BHA7KMEsU/hqdefault.jpg",
      "width": 480
    },
    "standard": {
      "height": 480,
      "url": "https://i.ytimg.com/vi/L7BHA7KMEsU/sddefault.jpg",
      "width": 640
    },
    "maxres": {
      "height": 720,
      "url": "https://i.ytimg.com/vi/L7BHA7KMEsU/maxresdefault.jpg",
      "width": 1280
    }
  }
}