{
  "title": "Coq au vin, simplified",
  "video_published_at": "2020-03-05T19:00:02Z",
  "start_at": null,
  "end_at": null,
  "video_id": "Lloo1Ksr3ms",
  "published_at": "2020-12-25T05:06:13Z",
  "description": "Thanks to Bright Cellars for sponsoring this video! Get 50% OFF your first 6-bottle box: http://bit.ly/BrightCellarsRagusea  Bright Cellars is the monthly wine club that matches you with wine you’ll love. Get started by taking the taste palate quiz to see your personalized matches.\n\n***RECIPE, SERVES 4***\n\n12 oz (350g) bacon (ideally slab bacon)\n6-8 boneless, skinless chicken thighs, 1.5-2 lbs (0.7-1 kg)\nflour (a big pinch)\n1 oz (30g) dried mushrooms\n1 tbsp (15 ml) tomato paste\n1 cup (250 ml) red wine\n1-2 cups (250-500 ml) chicken stock or water\n1-2 teaspoons Herbes de Provence (or any combination of dried thyme, rosemary, oregano, etc)\n1 cup frozen peeled pearl onions (I have no idea what you want to call that in metric)\npepper\nsalt\nvinegar\n12 oz (350g) dried egg noodles\n1 tbsp (15g) butter\nfresh parsley or tarragon for garnish\n\nCut the bacon into chunks, ideally big bite-size chunks from a piece of slab bacon. Put it into a large, cold pan with a lid, then turn the heat on medium. Cook, stirring occasionally, until crispy — up to a half hour if you've got thick chunks.\n\nCoat the chicken thighs in a dusting of flour. \n\nBreak up and very large chunks of the dried mushrooms, accounting for the fact that they'll double in size when rehydrated. (Be warned that some dried mushrooms will have some little worms in them. Seriously. Don't freak out, it's normal, they won't hurt anything, but ideally take them out.) Follow the steeping and filtering instructions on the package if you want to make sure there won't be any grains of sand on them, but I don't care.\n\nIf you want to take some of the bacon fat out, fish out the bacon with the slotted spoon and pour of some of the fat. I leave it in, and just push the bacon over to the side. Fry the chicken thighs in the bacon fat until brown on both sides. Make a well in the center and squeeze in the tomato paste. Fry it until it's about to burn, then deglaze with the red wine. \n\nPour in enough water or stock to almost cover the chicken. Put in the dried mushrooms, dried herbs, some pepper, and a pinch of salt (assuming you aren't using salt pork like I do). Reduce the heat to a simmer and cover.\n\nAfter about a half hour, consider removing the lid if the sauce is looking too loose to you. When the sauce is reduced to your desired thickness and the chicken is as soft as you want it, stir in the frozen onions and let them thaw. When they're ready, taste the sauce for seasoning, and add any additional salt it needs. Also drop in a splash of any vinegar. Take care to not break up the chicken as you stir in the final seasoning.\n\nMeanwhile, boil your egg noodles in salted water per the package instructions, drain, put the butter in with them and let it melt. Right before serving, tear some fresh parsley or tarragon into the noodles and stir to combine.",
  "thumbnails": {
    "default": {
      "height": 90,
      "url": "https://i.ytimg.com/vi/Lloo1Ksr3ms/default.jpg",
      "width": 120
    },
    "medium": {
      "height": 180,
      "url": "https://i.ytimg.com/vi/Lloo1Ksr3ms/mqdefault.jpg",
      "width": 320
    },
    "high": {
      "height": 360,
      "url": "https://i.ytimg.com/vi/Lloo1Ksr3ms/hqdefault.jpg",
      "width": 480
    },
    "standard": {
      "height": 480,
      "url": "https://i.ytimg.com/vi/Lloo1Ksr3ms/sddefault.jpg",
      "width": 640
    },
    "maxres": {
      "height": 720,
      "url": "https://i.ytimg.com/vi/Lloo1Ksr3ms/maxresdefault.jpg",
      "width": 1280
    }
  }
}