{
  "title": "Egg Foo Young, Cantonese style - How to Make the Original Fuyong Dan (芙蓉蛋)",
  "video_published_at": "2017-11-14T05:31:55Z",
  "start_at": null,
  "end_at": null,
  "video_id": "lnRBW7F3TOg",
  "published_at": "2020-08-10T02:52:37Z",
  "description": "Egg Foo Young, a.k.a. Fuyong Dan or Furong Dan.  This dish's made it's way around the world, but we wanted to teach you the original Cantonese way of making it.  In terms of taste and texture, this is much closer to an omelette than its deep-fried takeout counterpart.  It's a pretty easy dish, and a great egg dish to whip up whenever.\n\nNear the end of the video, we used some footage of an American Chinese restaurant called 'Luo's Peking House'.  Cutting this video made me really nostalgic for American-Chinese food, though the host putting mustard and sweet and sour sauce over the already sauced Egg Foo Young is so stereotypically American it made me facepalm ;) Link to the full video here:\n\nhttps://www.youtube.com/watch?v=hnDlWOqjPwM \n\nAs always, here's the reddit link with the detailed, written recipe. A smaller sort of recipe card's inside that link in the comments (if that's what you're looking for, sorry to make ya go fishing through links):  \n\nhttps://www.reddit.com/r/Cooking/comments/7cv8z1/recipe_egg_foo_young_the_original_cantonese_style/\n\nOutro Music: \"Add And\" by Broke For Free \nhttps://soundcloud.com/broke-for-free\n\nABOUT US\n-----------------------------------------------------------------------------------------\nLearn how to cook real deal, authentic Chinese food! We post recipes every Tuesday (unless we happen to be travelling) :)\n\nWe're Steph and Chris - a food-obsessed couple that lives in Shenzhen, China. Steph is from Guangzhou and loves cooking food from throughout China - you'll usually be watching her behind the wok. Chris is a long-term expat from America that's been living in China and loving it for the last nine years - you'll be listening to his explanations and recipe details, and doing some cooking at times as well.\n\nThis channel is all about learning how to cook the same taste that you'd get in China. Our goal for each video is to give you a recipe that would at least get you close to what's made by some of our favorite restaurants here. Because of that, our recipes are no-holds-barred Chinese when it comes to style and ingredients - but feel free to ask for tips about adaptations and sourcing too!",
  "thumbnails": {
    "default": {
      "height": 90,
      "url": "https://i.ytimg.com/vi/lnRBW7F3TOg/default.jpg",
      "width": 120
    },
    "medium": {
      "height": 180,
      "url": "https://i.ytimg.com/vi/lnRBW7F3TOg/mqdefault.jpg",
      "width": 320
    },
    "high": {
      "height": 360,
      "url": "https://i.ytimg.com/vi/lnRBW7F3TOg/hqdefault.jpg",
      "width": 480
    },
    "standard": {
      "height": 480,
      "url": "https://i.ytimg.com/vi/lnRBW7F3TOg/sddefault.jpg",
      "width": 640
    },
    "maxres": {
      "height": 720,
      "url": "https://i.ytimg.com/vi/lnRBW7F3TOg/maxresdefault.jpg",
      "width": 1280
    }
  }
}