{
  "title": "Chicken Tikka Masala चिकन टिक्का मसाला #FRD2014",
  "video_published_at": "2014-04-30T14:00:04Z",
  "start_at": null,
  "end_at": null,
  "video_id": "Lsk6nWGhtfI",
  "published_at": "2014-07-23T00:46:02Z",
  "description": "Namaste ! Salam aleikum ! Sat sri akaal ! Such Incredible flavors in this western indian-inspired dish ! So delicious, creamy and easy to make :) \n\n***********************\n*  LOVE & SUPPORT  *\n***********************\nSupport my work on : https://www.patreon.com/frenchguycooking\n--\nPatreon is a cool way for creators to achieve a sustainable income by being financially supported by their lovely community ! You get to do something GOOD and, icing on cake, you also get different types of rewards !  \n\n****************\n*  SUBTITLES  *\n****************\nYou want to Help everyone understand that F* French ??\nSubmit your own subtitle in any language here : http://www.youtube.com/timedtext_cs_panel?tab=2&c=UCPzFLpOblZEaIx2lpym1l1A\n\n***************\n*  MERCH      *\n***************\nI have my own BRAND ! Stickers, posters and Pizza Shirt and Power-drill guns in the kitchen :) Buy them and support the French Guy's adventures on : http://www.dftba.com/frenchguycooking\n\n***************\n* FACEBOOK *\n***************\nhttp://www.facebook.com/frenchguycooking for mouth watering photos and good discussions ;)\n\n*****************\n* INSTAGRAM *\n*****************\nhttp://instagram.com/frenchguycooking\n\n*************\n* TWITTER *\n*************\nhttp://www.twitter.com/frenchguycookin\n\n**************************\n* COOKBOOK PROJECT *\n**************************\nI am thinking of making an über cool cookbook, so if you are interested, drop me a line there : http://www.frenchguycooking.com/the-cookbook-project\n\nLots of love,\n\nAlex\nIngredients & Instructions :\n-----------------------------------\nServes 4 to 6\n1 hour 30 minutes\nNutrition: 458 cals, 23g fat (5.3g saturated), 44.1g protein, 13.9g carbs, 11.5g sugar, 1.2g salt\n2 chopping boards\n2 knives\nFrying pan\nMeasuring spoons\nPestle and mortar (optional) Food processor (standard blade) Large casserole pan with lid Wooden spoon\nWeighing scales Tin opener\nIngredients\n4 skinless chicken breasts, preferably higher-welfare 2 onions\na thumb-sized piece of fresh ginger\n1⁄2 a bunch of fresh coriander\n1 fresh red chilli\ngroundnut or vegetable oil\nsea salt and freshly ground black pepper 1 x 400g tin of chopped tomatoes\n1⁄2 x 400ml tin of light coconut milk\na small handful of flaked almonds, to serve fluffy rice, to serve\nfat-free natural yoghurt, to serve\n1 lemon, to serve\nfor the tikka masala paste\n1-2 fresh red chillies\n2 cloves of garlic\na thumb-sized piece of fresh ginger 1 teaspoon cumin seeds\n1 teaspoon coriander seeds 1 teaspoon cayenne pepper 1 tablespoon smoked paprika 2 teaspoons garam masala 1⁄2 teaspoon sea salt\n2 tablespoons groundnut oil\n￼2 tablespoons tomato purée\na small bunch of fresh coriander 1⁄2 tablespoon desiccated coconut 2 tablespoons ground almonds\n1. To make the curry paste, halve, deseed and roughly chop the chillies, then peel the garlic and ginger.\n2. Put a frying pan over a medium-high heat and add the cumin and coriander seeds. Lightly toast for a few minutes, or until golden brown and smelling delicious, then remove from the heat.\n3. Add the toasted spices to a pestle and mortar and grind until fine, or put them in a food processor and whiz to a powder.\n4. Once you've ground them, add the toasted spices to a food processor along with the remaining paste ingredients and whiz to a smooth paste, then put to one side.\n5. Slice the chicken breasts lengthways into 2cm strips.\n6. On a clean chopping board, peel, halve and finely slice the onions. Peel and finely slice the ginger, then pick the coriander leaves and\nput to one side, finely chopping the stalks along with the chilli.\n7. Place a large casserole pan over a medium-high heat and add a\ncouple of lugs of oil. Once hot, add the onions, chilli, ginger and coriander stalks, then cook for around 10 minutes, or until softened and lightly golden.\n8. Add the chicken and roughly 140g of the tikka masala paste, stirring well so everything is nicely coated. Season with salt and pepper, add the tomatoes and coconut milk (save the rest for another day), then bring everything to the boil.\n9. Turn the heat down to medium-low, cover and simmer for 20 minutes, then take the lid off and cook for further 5 minutes, or until the meat\nis tender and the sauce has reduced, stirring occasionally.\n10. Divide the curry between bowls, sprinkle over the almonds and coriander leaves. Serve with fluffy rice, a dollop of yoghurt and lemon wedges for squeezing over.\nPop any leftover curry paste in a sealed jar and keep it in the fridge for up to 2 weeks -- this way you'll be able to knock up a quick curry in next to no time.\n\nAdapted from Jamie's Food Revolution Day Recipe © Jamie Oliver \nhttp://www.foodrevolutionday.com/chicken-tikka-masala/",
  "thumbnails": {
    "default": {
      "height": 90,
      "url": "https://i.ytimg.com/vi/Lsk6nWGhtfI/default.jpg",
      "width": 120
    },
    "medium": {
      "height": 180,
      "url": "https://i.ytimg.com/vi/Lsk6nWGhtfI/mqdefault.jpg",
      "width": 320
    },
    "high": {
      "height": 360,
      "url": "https://i.ytimg.com/vi/Lsk6nWGhtfI/hqdefault.jpg",
      "width": 480
    },
    "standard": {
      "height": 480,
      "url": "https://i.ytimg.com/vi/Lsk6nWGhtfI/sddefault.jpg",
      "width": 640
    },
    "maxres": {
      "height": 720,
      "url": "https://i.ytimg.com/vi/Lsk6nWGhtfI/maxresdefault.jpg",
      "width": 1280
    }
  }
}