{
  "title": "How to Make Cantonese Stir Fried Sticky Rice (生炒糯米饭)",
  "video_published_at": "2017-07-04T05:04:17Z",
  "start_at": null,
  "end_at": null,
  "video_id": "M4ve-tqU0i8",
  "published_at": "2020-08-10T02:58:32Z",
  "description": "This rice is the best fried rice you'll ever eat.  It's an old school Cantonese dish... and personally one of my favorite things to eat in China, period.\n\nA special thanks to our guest cook Dawei for whipping this up.  It's a dish with a lot of technique to it, and he's got it in spades.  As always, here's the reddit post with the detailed recipe and ingredient list:\n\nhttps://www.reddit.com/r/Cooking/comments/6l6g13/recipe_how_to_make_stirfried_sticky_rice_%E7%94%9F%E7%82%92%E7%B3%AF%E7%B1%B3%E9%A5%AD/\n\nABOUT US\n-----------------------------------------------------------------------------------------\nLearn how to cook real deal, authentic Chinese food! We post recipes every Tuesday (unless we happen to be travelling) :)\n\nWe're Steph and Chris - a food-obsessed couple that lives in Shenzhen, China. Steph is from Guangzhou and loves cooking food from throughout China - you'll usually be watching her behind the wok. Chris is a long-term expat from America that's been living in China and loving it for the last nine years - you'll be listening to his explanations and recipe details, and doing some cooking at times as well.\n\nThis channel is all about learning how to cook the same taste that you'd get in China. Our goal for each video is to give you a recipe that would at least get you close to what's made by some of our favorite restaurants here. Because of that, our recipes are no-holds-barred Chinese when it comes to style and ingredients - but feel free to ask for tips about adaptations and sourcing too!",
  "thumbnails": {
    "default": {
      "height": 90,
      "url": "https://i.ytimg.com/vi/M4ve-tqU0i8/default.jpg",
      "width": 120
    },
    "medium": {
      "height": 180,
      "url": "https://i.ytimg.com/vi/M4ve-tqU0i8/mqdefault.jpg",
      "width": 320
    },
    "high": {
      "height": 360,
      "url": "https://i.ytimg.com/vi/M4ve-tqU0i8/hqdefault.jpg",
      "width": 480
    },
    "standard": {
      "height": 480,
      "url": "https://i.ytimg.com/vi/M4ve-tqU0i8/sddefault.jpg",
      "width": 640
    },
    "maxres": {
      "height": 720,
      "url": "https://i.ytimg.com/vi/M4ve-tqU0i8/maxresdefault.jpg",
      "width": 1280
    }
  }
}