{
  "title": "Oven Fries — CRISPIER Than Deep-Fried",
  "video_published_at": "2019-06-27T18:00:04Z",
  "start_at": null,
  "end_at": null,
  "video_id": "m6kcANnAJSo",
  "published_at": "2019-11-28T00:38:21Z",
  "description": "Oven fries that are better than deep-fried? Maybe. Easier and cleaner? Definitely! Thanks to Squarespace for sponsoring this video. Go to Squarespace.com for a free trial, and when you’re ready to launch, go to http://squarespace.com/ragusea and add code “RAGUSEA\" at checkout to save 10% off your first purchase of a website or domain.\n\nI suppose this is more of a techniques than a recipe. Take whatever potatoes you want. Peel them, or don't. Cut them into fry-like shapes, being sure to get roughly equal thickness, and cut them maybe twice as thick as you want them — they'll shrink a lot during cooking. I do one large Russet potato per person. Boil them until you're afraid they're going to fall apart — I do about eight minutes. Gently drain them and lay them on a pan wide enough to hold them all in a single layer. Drizzle on enough oil to thoroughly coat all the pieces. Shake the pan to coat the pieces and get the fries evenly distributed. \n\nRoast at 450ºF. Check on them after 45 minutes — add more oil if they look dry, and move around any pieces that seem to be cooking unevenly. Roast them some more until they're brown and crispy, maybe another 45 minutes. Be careful not to overcook them — very brown will taste burned. You can pull them when they're still a little floppy, because they will harden as they cool. The ones I made in the video are just a bit overcooked.\n\nPlace kitchen towel or a couple layers of paper towel in a large bowl, and dump the fries in. Let the towel soak up the excess oil, and then whip it out. Season the fries in the bowl and then toss. I use coarse salt, pepper, garlic powder, chopped cilantro and grated parmesan.\n\nMY COOKING PHILOSOPHY: I don't like weighing or measuring things if I don't have to, and I don't like to be constantly checking a recipe as I cook. I don't care that volume is a bad way of measuring things — it's usually easier. I like for a recipe to get me in the ballpark, and then I like to eyeball and improvise the rest. If you're like me, my goal with these videos is to give you a sense of how the food should look and feel as you're cooking it, rather than give you a refined formula to reproduce.",
  "thumbnails": {
    "default": {
      "height": 90,
      "url": "https://i.ytimg.com/vi/m6kcANnAJSo/default.jpg",
      "width": 120
    },
    "medium": {
      "height": 180,
      "url": "https://i.ytimg.com/vi/m6kcANnAJSo/mqdefault.jpg",
      "width": 320
    },
    "high": {
      "height": 360,
      "url": "https://i.ytimg.com/vi/m6kcANnAJSo/hqdefault.jpg",
      "width": 480
    },
    "standard": {
      "height": 480,
      "url": "https://i.ytimg.com/vi/m6kcANnAJSo/sddefault.jpg",
      "width": 640
    },
    "maxres": {
      "height": 720,
      "url": "https://i.ytimg.com/vi/m6kcANnAJSo/maxresdefault.jpg",
      "width": 1280
    }
  }
}