{
  "title": "Jamaretti Cookies - Everyday Food with Sarah Carey",
  "video_published_at": "2013-11-29T13:00:02Z",
  "start_at": null,
  "end_at": null,
  "video_id": "MWx2xiGIHhk",
  "published_at": "2014-11-15T02:00:53Z",
  "description": "Are you ready to make a great cookie? Today's recipe is not only delicious and easy, but it makes a big batch, so it's perfect for sharing with all of your friends and family during the holidays. It's a \"jamaretti\" cookie (a.k.a. an amaretti cookie with a jam center) with a sugar glaze. These little treats are every bit as delightful as jam-filled thumbprints but take about half the time to make since they're sliced after baking (meaning you don't need a single cookie cutter to make this recipe). And since this dough can be prepped and frozen up to a week in advance, you can plan ahead for your next cookie swap! Happy holidays.\n\nSarah's Tip of the Day: \nFor a more evenly glazed cookie, drizzle glaze through a zip-top bag with the tip snipped off.\n\nSubscribe for more easy and delicious recipes: http://full.sc/P8YgBt\n\n---------------------------------------------------------------\n\nGET MORE\nSubscribe to Martha Stewart Living\nSign Up to Receive Video Recipes Daily\n\nINGREDIENTS\n2 1/4 cups flour (spooned and leveled), plus more for work surface\n1 teaspoon baking powder\n1/2 teaspoon fine salt\n1/2 teaspoon ground cinnamon\n1/2 cup almond paste\n3/4 cup sugar\n1 stick unsalted butter, room temperature\n2 large eggs\n1/2 cup jam (apricot, blackberry, or raspberry)\n1 cup confectioners' sugar\n4 teaspoons whole milk\n\nCOOK'S NOTE\nThis dough can be prepped and frozen up to a week in advance. Just thaw it in the refrigerator overnight.\n\nDIRECTIONS\nSTEP 1\nWhisk together flour, baking powder, salt, and cinnamon. In a food processor, pulse almond paste and sugar until smooth. Add butter and eggs and blend until smooth. Add flour mixture and pulse until dough forms. Divide into 4 equal pieces, wrap in plastic, and chill 30 minutes.\nSTEP 2\nPreheat oven to 350 degrees. On a lightly floured surface roll each piece into a 10-inch log. Transfer logs to two parchment-lined baking sheets and flatten to about 2 inches across. Bake until just dry, 12 to 15 minutes.\nSTEP 3\nRemove from oven; with the handle of a wooden spoon, make a trench down each log. Spread 2 tablespoons jam into each trench. Bake until golden brown, 8 to 10 minutes more. Let cool on sheets on wire racks.\nSTEP 4\nWhisk together confectioners' sugar and milk until smooth. Drizzle glaze over logs. Let glaze harden, 20 minutes. With a serrated knife, cut logs on the diagonal into 1-inch slices. (Store in airtight containers, up to 1 week.)\n\n---------------------------------------------------------------\n\nGet the Full Recipe: http://full.sc/1blFfH1\n\nMore Sweet Treat Recipes: http://full.sc/Q9cvnf\n\n---------------------------------------------------------------\n\nWant more? Sign up to get my video recipe email, served daily.\nGet recipe emails: http://www.marthastewart.com/edf\nLike Everyday Food: http://www.facebook.com/EverydayFood\nFollow Everyday Food: https://twitter.com/everydayfood\nEveryday Food Pinterest: http://pinterest.com/everydayfood\n\nSarah Carey is the editor of Everyday Food magazine and her job is to come up with the best ways to make fast, delicious food at home. But she's also a mom to two hungry kids, so the question \"What's for dinner?\" is never far from her mind -- or theirs, it seems! Her days can get crazy busy (whose don't?), so these videos are all about her favorite fast, fresh meals -- and the tricks she uses to make it all SO much easier.\n\nJamaretti Cookies - Everyday Food with Sarah Carey\nhttp://www.youtube.com/user/everydayfoodvideos",
  "thumbnails": {
    "default": {
      "height": 90,
      "url": "https://i.ytimg.com/vi/MWx2xiGIHhk/default.jpg",
      "width": 120
    },
    "medium": {
      "height": 180,
      "url": "https://i.ytimg.com/vi/MWx2xiGIHhk/mqdefault.jpg",
      "width": 320
    },
    "high": {
      "height": 360,
      "url": "https://i.ytimg.com/vi/MWx2xiGIHhk/hqdefault.jpg",
      "width": 480
    },
    "standard": {
      "height": 480,
      "url": "https://i.ytimg.com/vi/MWx2xiGIHhk/sddefault.jpg",
      "width": 640
    },
    "maxres": null
  }
}