{
  "title": "Grown-Up Comfort Classics: Stovetop Mac and Cheese and Turkey Meatloaf",
  "video_published_at": "2019-01-06T21:50:31Z",
  "start_at": null,
  "end_at": null,
  "video_id": "N3VQ0aYr5gE",
  "published_at": "2019-01-08T01:27:21Z",
  "description": "Hosts Bridget Lancaster and Julia Collin Davison unlock the secrets to Simple Stovetop Macaroni and Cheese. Science expert Dan Souza explains the proper way to use a whisk. In the Equipment Corner, expert Adam Ried reveals his top pick for large saucepans. Next, test cook Becky Hays makes the perfect Turkey Meatloaf with Ketchup-Brown Sugar Glaze. Finally, gadget critic Lisa McManus reviews lid holders.\n\nMake Our Simple Stovetop Mac and Cheese: https://cooks.io/2R67xAE\nMake Our Turkey Meatloaf with Ketchup-Brown Sugar Glaze: https://cooks.io/2SAmhEL\nBuy Our Winning Large Saucepan: https://cooks.io/2sbhXQU\n\nABOUT US: Located in Boston’s Seaport District in the historic Innovation and Design Building, America's Test Kitchen features 15,000 square feet of kitchen space including multiple photography and video studios. It is the home of Cook’s Illustrated magazine and Cook’s Country magazine and is the workday destination for more than 60 test cooks, editors, and cookware specialists. Our mission is to test recipes over and over again until we understand how and why they work and until we arrive at the best version.\n\nIf you like us, follow us:\nhttp://americastestkitchen.com\nhttp://twitter.com/testkitchen\nhttp://instagram.com/testkitchen\nhttp://pinterest.com/testkitchen",
  "thumbnails": {
    "default": {
      "height": 90,
      "url": "https://i.ytimg.com/vi/N3VQ0aYr5gE/default.jpg",
      "width": 120
    },
    "medium": {
      "height": 180,
      "url": "https://i.ytimg.com/vi/N3VQ0aYr5gE/mqdefault.jpg",
      "width": 320
    },
    "high": {
      "height": 360,
      "url": "https://i.ytimg.com/vi/N3VQ0aYr5gE/hqdefault.jpg",
      "width": 480
    },
    "standard": {
      "height": 480,
      "url": "https://i.ytimg.com/vi/N3VQ0aYr5gE/sddefault.jpg",
      "width": 640
    },
    "maxres": {
      "height": 720,
      "url": "https://i.ytimg.com/vi/N3VQ0aYr5gE/maxresdefault.jpg",
      "width": 1280
    }
  }
}