{
  "title": "Simple chicken & rice bakes",
  "video_published_at": "2020-05-14T18:00:17Z",
  "start_at": null,
  "end_at": null,
  "video_id": "ntd_Y2eywc4",
  "published_at": "2020-08-17T20:20:38Z",
  "description": "Thanks to Haus for sponsoring this video! The first 100 people who click this link and use my code ADAMRAGUSEA at checkout will get $10 off their first two-bottle purchase and free shipping: https://bit.ly/hausadamragusea\n\n***WHITE RICE RECIPE, SERVES 6-8***\n\n1 lb (.5 kg) chicken breast\n1 large onion\n3-4 carrots\n2 cups (350 g) long- or medium-grain white rice\n4 cups (32 oz, 830 ml) chicken stock\n1 cup (150 g)  frozen peas\n2 teaspoons Herbs de Provence (or other poultry-friendly herbs)\n1 teaspoon garlic powder\nolive oil\nsalt\npepper\nlemons\n\nGet oven heating to 400 F / 200 C. In a large oven-safe pot, heat an ample coating of olive oil on medium-high heat. When shimmering, brown the chicken on both sides. While the chicken is browning, roughly chop the onion. Remove the browned chicken to a plate (it won't be done on the inside yet), and get the onions frying in the pot.\n\nWhile the onions are going, roughly chop the carrots into small bitesize pieces and add them to the pot. Chop the chicken up into small bitesize pieces. Add the dry rice to the pot, stir and let it toast for a minute. Pour in the chicken stock and scrape the bottom of the pan clean.\n\nPut the chicken in the pot, along with the Herbs de Provence, garlic powder, a lot of pepper, and two big pinches of salt. Put the lit on the pot, put the pot in the oven and bake for 20-30 minutes, or until the liquid has absorbed all the loose moisture. When the rice is out of the oven, stir in the frozen peas (don't bother thawing them first). Taste and consider stirring in some more salt.\n\nServe with a lemon wedge for squeezing.\n\n***BROWN RICE RECIPE, SERVES 8-10***\n\n1.5 lbs (.7 kg) chicken thighs\n1 large onion\n4-5 carrots\n1 broccoli crown\n3 cups (525 g) brown rice\n4 cups (32 oz, 830 ml) chicken stock\n1 cup water (optional)\n1 cup soy sauce\n1 tablespoon Chinese Five-Spice powder\nsalt\noil\ncilantro\nlimes\n\nGet oven heating to 400 F / 200 C. In a large oven-safe pot, heat an ample coating of oil on medium-high heat. When shimmering, brown the chicken on both sides. While the chicken is browning, roughly chop the onion. Remove the browned chicken to a plate (it won't be done on the inside yet), and get the onions frying in the pot. Roughly chop the carrots and broccoli into small bitesize pieces.\n\nPut the dry rice in the pan, stir and let it toast for a minute. Add the dry rice to the pot, stir and let it toast for a minute. Pour in the chicken stock and scrape the bottom of the pan clean. Put in the water (skip the water if you want a firmer texture in the rice grains), soy sauce, carrots, broccoli and five-spice powder. Chop up the chicken into small bitesize pieces and add it to the pot. Put the lid on the pot, put the pot in the oven and cook for 45-60 minutes, or until the liquid has absorbed all the loose moisture.\n\nWhen the rice is out of the oven, taste it and consider stirring in more salt. Serve topped with torn cilantro leaves, and with a lime wedge for squeezing.",
  "thumbnails": {
    "default": {
      "height": 90,
      "url": "https://i.ytimg.com/vi/ntd_Y2eywc4/default.jpg",
      "width": 120
    },
    "medium": {
      "height": 180,
      "url": "https://i.ytimg.com/vi/ntd_Y2eywc4/mqdefault.jpg",
      "width": 320
    },
    "high": {
      "height": 360,
      "url": "https://i.ytimg.com/vi/ntd_Y2eywc4/hqdefault.jpg",
      "width": 480
    },
    "standard": {
      "height": 480,
      "url": "https://i.ytimg.com/vi/ntd_Y2eywc4/sddefault.jpg",
      "width": 640
    },
    "maxres": {
      "height": 720,
      "url": "https://i.ytimg.com/vi/ntd_Y2eywc4/maxresdefault.jpg",
      "width": 1280
    }
  }
}