{
  "title": "Food Lab Basics: POV Spaetzle From Scratch (5 minute Homemade Pasta)",
  "video_published_at": "2020-03-27T23:54:38Z",
  "start_at": null,
  "end_at": null,
  "video_id": "ntwZfErKJEg",
  "published_at": "2021-01-03T04:49:04Z",
  "description": "For more cooking science, get my book, The Food Lab: Better Home Cooking Through Science, here: http://www.kenjilopezalt.com/order\n\nSpaetzle is the easiest pasta I know to make from scratch. The actual pasta bit of this recipe is done in under three minutes!\n\nNote: I do not intend to offend any Swabians watching or reading this. I apologize that the recipe I'm sharing is not strictly traditional. It is an adaptation I've made based on testing and adjusting it to suit my own personal taste. I encourage anyone watching this who wants to make spaetzle to experiment for themselves (it's quick and inexpensive to test), and do it however they like. Also, my German pronunciation  is terrible, so I stick to the American pronunciation. Maybe I'll get a voice coach some day ;)\n\nThanks!\n\nHere's the basic recipe I'm using in the video:\nCombine 70g(1/2 cup) flour, 1 large egg, about 40ml (2.5 tablespoons) milk, a pinch of salt and pepper, and if desired, some finely minced herbs like parsley or chives. A pinch of ground nutmeg is also excellent and common with it. Whisk well and adjust texture with milk. It should flow like lava.\n\nYou can also make the recipe with the same volume of water instead of milk. I like the texture and richness milk adds to it. It's very forgiving, so go with whatever you'd like.\n\nAt the restaurant, we make large batches of batter, mix it a little longer, and let it rest overnight before boiling. You can do this at home too, if you prefer. Longer mixing makes them a little chewier and puffier, while resting the batter overnight improves flavor (similar to how resting cookie dough or Yorkshire pudding batter can help flavor: https://sweets.seriouseats.com/2013/12/the-food-lab-the-best-chocolate-chip-cookies.html).\n\nDrop the batter into a pot of salted boiling water using a spaetzle-maker or by pressing it through the holes of a colander using a spatula. Boil for a minute, then remove from water. You can then toss in oil and chill it at this point.\n\nFinish it by sauteing in a pan with brown butter, or however else you want. This version uses cabbage and onion, similar to, say, Hungarian Halusky. Just plain onions and bacon is also great. So is mixing it with a good melting cheese like gruyere. Or if you want to go crazy, fry some kimchi and bacon, add the spaetzle, add some gochujang and water (or dashi), then cook it down until glazed and spicy and delicious. Apologize to your German friends.",
  "thumbnails": {
    "default": {
      "height": 90,
      "url": "https://i.ytimg.com/vi/ntwZfErKJEg/default.jpg",
      "width": 120
    },
    "medium": {
      "height": 180,
      "url": "https://i.ytimg.com/vi/ntwZfErKJEg/mqdefault.jpg",
      "width": 320
    },
    "high": {
      "height": 360,
      "url": "https://i.ytimg.com/vi/ntwZfErKJEg/hqdefault.jpg",
      "width": 480
    },
    "standard": {
      "height": 480,
      "url": "https://i.ytimg.com/vi/ntwZfErKJEg/sddefault.jpg",
      "width": 640
    },
    "maxres": {
      "height": 720,
      "url": "https://i.ytimg.com/vi/ntwZfErKJEg/maxresdefault.jpg",
      "width": 1280
    }
  }
}