{
  "title": "Why French macarons and coconut macaroons have the same name",
  "video_published_at": "2021-01-18T19:00:10Z",
  "start_at": null,
  "end_at": null,
  "video_id": "nzcHeO43kgE",
  "published_at": "2021-02-04T03:49:29Z",
  "description": "Thanks to Harry's for sponsoring this video! Start the New Year with some savings; New customers can redeem a Harry's Trial Set for just $3 when you go to: https://harrys.com/adamragusea\n\nYOU MUST WATCH \"Samurai Cop,\" a completely bonkers 1991 \"Lethal Weapon\" rip-off made by an Iranian director named Amir Shervan who had fled the revolution and was trying to establish himself in Hollywood. It did not work: https://www.amazon.com/Samurai-Cop-Matt-Hannon/dp/B01G4DXMMO\n\n1617 cookbook with the first-known English-language French macaroon recipe: http://lcweb2.loc.gov/service/rbc/rbc0001/2013/2013pennell59509/2013pennell59509.pdf\n\nJohn Dickie's 2007 book that traces the etymology of \"macaroni\" to \"maccare,\" \"Delizia! The Epic History of Italians and their Food\": https://johndickie.net/books/delizia/\n\nJoumana Accad's recipe for lawziyeh, a possible Arabic progenitor of the European macaroon: https://www.tasteofbeirut.com/almond-cookies/\n\nMy old recipe (an anti-recipe, really) for French macaroons: https://youtu.be/tsCvAijBn4Y\n\n***RECIPE FOR COCONUT MACAROONS***\n\n1 14 oz bag sweetened, shredded coconut\n1 14 oz can sweetened, condensed milk\n2 egg whites\nvanilla\nsalt\n\nHeat the oven to 325ºF (160ºC). Mix the coconut and the milk in a big bowl, along with a big splash of vanilla and a pinch of salt. Beat the egg whites to stiff peaks, and fold them into the coconut mixture. Shape the coconut into little balls and bake them until just golden around the edges — about 30 min. If you want, melt some chocolate in the microwave and dip the macaroons in it (or drizzle the chocolate over) and cool until the chocolate is firm. It helps to just barely melt the chocolate, to not mess up its tempering.",
  "thumbnails": {
    "default": {
      "height": 90,
      "url": "https://i.ytimg.com/vi/nzcHeO43kgE/default.jpg",
      "width": 120
    },
    "medium": {
      "height": 180,
      "url": "https://i.ytimg.com/vi/nzcHeO43kgE/mqdefault.jpg",
      "width": 320
    },
    "high": {
      "height": 360,
      "url": "https://i.ytimg.com/vi/nzcHeO43kgE/hqdefault.jpg",
      "width": 480
    },
    "standard": {
      "height": 480,
      "url": "https://i.ytimg.com/vi/nzcHeO43kgE/sddefault.jpg",
      "width": 640
    },
    "maxres": {
      "height": 720,
      "url": "https://i.ytimg.com/vi/nzcHeO43kgE/maxresdefault.jpg",
      "width": 1280
    }
  }
}