{
  "title": "Authentic Cantonese Sausage, at home",
  "video_published_at": "2021-02-21T00:33:42Z",
  "start_at": null,
  "end_at": null,
  "video_id": "oLkiIvVc6YY",
  "published_at": "2021-02-21T04:59:09Z",
  "description": "Lap Cheong! This sweet Cantonese sausage barely needs an introduction - it's awesome fried along with some veg, excellent topped over a claypot rice - or even just tossed on a bit of white rice in the rice cooker directly. \n\n0:00 - What Is Lap Cheong?\n0:52 - How to tell a Quality Lap Cheong\n1:44 - Lap Cheong Recipe\n7:03 - \"Chinese Sausage\"?\n\nWritten recipe is also over here at /r/CasualChina if you prefer your recipes in Reddit form:\n\nhttps://www.reddit.com/r/CasualChina/comments/loktre/recipe_cantonese_lap_cheong_%E5%B9%BF%E5%BC%8F%E8%85%8A%E8%82%A0_oc/\n\nINGREDIENTS\n\nMakes 8 sausages. Feel free to scale up for a bigger batch.\n\n* Pork; 350g lean and 150g fat. We used the ham cut (后腿), you can also use a combination of loin (外脊) and fatback (猪油) if that ham cut is hard to find.\n\n* Casings: ~30mm dried hog casings (肠衣). Feel free to play around with this too. I believe this is the type we used: https://www.amazon.com/VIFERR-Non-Toxic-2-Layered-Homemade-Flavorous/dp/B07WRZRPNS/\n\n* Marinade for the Lean: 7.5g salt, 30g sugar, 3g Prague Powder #1, 20g light soy sauce (生抽), 15g Fenjiu (汾酒) -or- Rose Wine (玫瑰露酒). As of the time of writing, Rose Wine is out of stock on Amazon, but you should be able to buy this bottle in most Chinese supermarkets abroad: https://uedata.amazon.com/Rose-Cooking-Wine-Kuei-Chiew/dp/B00H4A11DE\n\n* Water, 75g.\n\nPlus sugar for making the candied pork fat.\n\nPROCESS\n\n1. Separate the lean and fat. Dice each into pea-sized pieces. Re-weigh each to make sure you're still at 350g/150g after trimming.\n\n2. Make the candied pork fat: blanch the pork fat for ~2 min, rinse and let it drain for a minute or two. Lay in a bowl with alternating layers of pork fat and sugar. Cover, leave in the fridge overnight.\n\n3. Mix the lean with the 'marinade for the lean'. Cover, fridge overnight.\n\n4. Next day, cut out ~6ft of your casing and soak in warm water for 20 minutes. If you're not using dried casings (e.g. if you're using the standard Western salted casings), prepare them according to how said casings should be prepped.\n\n5. Rinse the sugar off the pork fat, drain for a minute or two. Combine the lean with the fat, together with the 75g of water. Mix very well, ~3-5 minutes.\n\n6. Scrunch your casing up the bottom of a funnel, leaving ~2 inches of casing remaining at the end. Tie an overhand knot at the end of the casing.\n\n7. Stuff the filling through the funnel with the wide end of a (Chinese-style) chopstick. Be patient, this will take some time. Once you stuff it with ~2 inches remaining at the end of it, tie another overhand knot to close it up.\n\n8. Using two toothpicks or needles, puncture the sausage every half inch or so down the whole casing. Turn 90 degrees, and repeat. Turn another 90 degrees, repeat. Turn a final 90 degrees, and finish puncturing the sausage. \n\n9. Cut out four ~8 inch sections of baker's twine, tie it in a loop. Separate the sausage into individual Lap Cheongs by laying the loop of twine under the sausage, looping it through the loop, and tightening. \n\n10. Dry the sausage. Give the sausages a quick rinse, pat the, dry and put in the oven at 50C for 24 hours. Then hang in a cool, dry, sunny place for ~3 days.\n\n_____________\nAnd check out our Patreon if you'd like to support the project!\n\nhttp://www.patreon.com/ChineseCookingDemystified\n\nOutro Music: คิดถึงคุณจัง by ธานินทร์ อินทรเทพ\nFound via My Analog Journal (great channel): https://youtu.be/GHaL5H-VYRg",
  "thumbnails": {
    "default": {
      "height": 90,
      "url": "https://i.ytimg.com/vi/oLkiIvVc6YY/default.jpg",
      "width": 120
    },
    "medium": {
      "height": 180,
      "url": "https://i.ytimg.com/vi/oLkiIvVc6YY/mqdefault.jpg",
      "width": 320
    },
    "high": {
      "height": 360,
      "url": "https://i.ytimg.com/vi/oLkiIvVc6YY/hqdefault.jpg",
      "width": 480
    },
    "standard": {
      "height": 480,
      "url": "https://i.ytimg.com/vi/oLkiIvVc6YY/sddefault.jpg",
      "width": 640
    },
    "maxres": {
      "height": 720,
      "url": "https://i.ytimg.com/vi/oLkiIvVc6YY/maxresdefault.jpg",
      "width": 1280
    }
  }
}