{
  "title": "Garaeddeok (long cylinder shaped rice cake: 가래떡)",
  "video_published_at": "2013-01-17T21:38:40Z",
  "start_at": null,
  "end_at": null,
  "video_id": "oMz4t12DIGQ",
  "published_at": "2020-07-22T23:51:19Z",
  "description": "http://www.maangchi.com/recipe/garaeddeok\nIngredients:\n2 cups of short grain rice flour\n½ ts salt\n¾ cup of boiling water if using a microwave, 1 cup of boiling water if using a steamer\n1 ts sesame oil* If you want to make your own homemade rice flour, check this out.\nDirections:\nMaking rice cake with a microwave:\n\nCombine the rice flour, salt, and boiling water in a bowl.\nCover it with plastic wrap, leaving a small gap to let the steam release. Microwave for 2 minutes.\nMix the rice cake dough with a rice scoop or wooden spoon.\nRe-cover with the plastic wrap and cook for another 2 minutes.\nSpread ½ ts sesame oil on your cutting board. Put the hot rice cake in the oily spot on the cutting board. Pound it with a pestle for about 5 minutes, until it becomes smooth and elastic.\nMaking rice cake with a steamer:\n\nCombine the rice flour, salt, and boiling water in a bowl.\nLine a steamer rack with parchment paper. Add the rice cake dough and steam for about 25 minutes over hight heat.\nSpread ½ ts sesame oil on your cutting board. Put the hot rice cake in the oily spot on the cutting board. Pound it with a pestle for about 5 minutes, until it becomes smooth and elastic. The rest of process is the same as the  method of using a microwave oven.\nPrepare the rice cake for ddeokbokki:\n\nCut it into 8 equal pieces, then roll each piece out into a 4 inch long cylinder shaped rice cake.\nPut ½ ts sesame oil onto your hands and gently rub the rice cakes to coat them in a thin sheen of oil. This will give them a nice flavor and keep them from sticking to each other.\nPrepare the rice cake for ddeokguk (rice cake soup):\n\nCut it into 2 equal pieces, then roll each piece out into two 10 inch long cylinder shaped rice cakes.\nLet them cool at room temperature for several hours, then slice diagonally into thin discs.\nUse right away, or put in a plastic bag and freeze for later use. This amount is for 1 serving of ddeokguk, so if you want to make two bowls of soup, make two batches.",
  "thumbnails": {
    "default": {
      "height": 90,
      "url": "https://i.ytimg.com/vi/oMz4t12DIGQ/default.jpg",
      "width": 120
    },
    "medium": {
      "height": 180,
      "url": "https://i.ytimg.com/vi/oMz4t12DIGQ/mqdefault.jpg",
      "width": 320
    },
    "high": {
      "height": 360,
      "url": "https://i.ytimg.com/vi/oMz4t12DIGQ/hqdefault.jpg",
      "width": 480
    },
    "standard": {
      "height": 480,
      "url": "https://i.ytimg.com/vi/oMz4t12DIGQ/sddefault.jpg",
      "width": 640
    },
    "maxres": {
      "height": 720,
      "url": "https://i.ytimg.com/vi/oMz4t12DIGQ/maxresdefault.jpg",
      "width": 1280
    }
  }
}