{
  "title": "Pot Roast with Mashed Baked Potatoes",
  "video_published_at": "2019-11-21T19:00:02Z",
  "start_at": null,
  "end_at": null,
  "video_id": "ORcTvgK-vPg",
  "published_at": "2019-11-26T20:30:20Z",
  "description": "One of the best bang-for-buck meals of all time. Thanks to Turo for sponsoring this video! Skip the rental counter. Sign up for Turo here: https://turo.onelink.me/1712264037/7c6abb30 Use promo code Ragusea15 for $15 off your first trip!\n\n***RECIPE, FEEDS 6-8 PEOPLE***\n\nFOR THE POT ROAST\n\n2.5-3 lb beef chuck roast\n1 large onion\n1-2 stalks celery\n1 lb large carrots\n1-2 cups red wine (about half a bottle)\n28 oz can crushed tomatoes\n2-3 tablespoons tomato paste\n1/4 cup flour\n2-3 tablespoons Worcestershire sauce\n1-2 tablespoons balsamic vinegar\noil\nsalt\npepper\ngarlic powder\nfresh rosemary\n\nFOR THE POTATOES\n\n2 lbs baking potatoes (Russets), or a mixture of Russets and Yukon Golds\n1-2 sticks (4-8 ounces) butter, ideally cultured butter\nHalf a head of garlic\n1/2-1 cup milk\nsalt\npepper\n\nIf you want to limit the amount of fat in the final dish, trim any large globs of fat out of the inside of the meat — don't worry about mangling it. Put a thin film of oil into a large Dutch oven on medium heat, then slowly brown the meat, taking care to not let anything burn on the bottom of the pan. Start the oven pre-heating to 350 F.\n\nWhile the meat is browning, peel and cut the onion into thin quarter-circles and chop the celery into small pieces. When the meat is brown, remove it to a plate and put in the vegetables. Keep the vegetables moving and cook them until you're worried the fond on the pan is going to burn, then put in the tomato paste and the flour and stir aggressively to disperse the flour through the fat in the pan. \n\nWhen you're REALLY worried stuff is gonna burn, pour in the wine and start scraping the bottom with a wooden spoon. Pour in the tomatoes and the Worcestershire sauce, and sprinkle on a couple teaspoons of garlic powder. Stir to incorporate, then return the meat and any juices that collected in the plate. Toss the meat in the sauce, put the lid on the pot, and put the pot in the oven.\n\nPut the potatoes in the oven too, right on the rack, and cook until easily pierced with a fork, 1-1.5 hours. Remove the potatoes and let them cool for a moment. Put a large pan on medium heat and put in the butter to slowly melt. Meanwhile, peel and chop the garlic. Put the garlic into the hot butter then immediately turn the heat off. If anything looks or smells like it's going to burn, move the pan to a cooler surface. Cut the potatoes in half, scoop out the flesh and pass it through a ricer into the pan. Mix with enough milk to give you the texture you want, and season with salt and pepper to taste. Cover and keep warm until dinner.\n\nPeel the carrots and cut them into large chunks of roughly equal mass.\n\nAfter 2-3 hours total in the oven, the meat should be soft enough that you could pull it apart with forks (but don't actually do that yet). Put the carrots into the pot, get them coated in the sauce but not submerged, and return the pot to the oven WITHOUT THE LID. Let cook until the carrots are just tender enough to be pierced with a fork, about an hour.\n\nRemove the pot from the oven. Chop up a few stems of fresh rosemary and put that in, along with some salt, pepper and the vinegar. Stir to incorporate. The meat will start breaking up when you stir, which is a good thing. Taste the sauce and add any additional seasoning or vinegar, then stir one last time. If any of the meat has not yet broken apart into manageable chunks, pull it apart with forks.\n\nThat's it. Eat.",
  "thumbnails": {
    "default": {
      "height": 90,
      "url": "https://i.ytimg.com/vi/ORcTvgK-vPg/default.jpg",
      "width": 120
    },
    "medium": {
      "height": 180,
      "url": "https://i.ytimg.com/vi/ORcTvgK-vPg/mqdefault.jpg",
      "width": 320
    },
    "high": {
      "height": 360,
      "url": "https://i.ytimg.com/vi/ORcTvgK-vPg/hqdefault.jpg",
      "width": 480
    },
    "standard": {
      "height": 480,
      "url": "https://i.ytimg.com/vi/ORcTvgK-vPg/sddefault.jpg",
      "width": 640
    },
    "maxres": {
      "height": 720,
      "url": "https://i.ytimg.com/vi/ORcTvgK-vPg/maxresdefault.jpg",
      "width": 1280
    }
  }
}