{
  "title": "Crispy Chicken Parm",
  "video_published_at": "2019-03-23T15:22:16Z",
  "start_at": null,
  "end_at": null,
  "video_id": "p-LY9b1u_io",
  "published_at": "2019-11-27T03:21:18Z",
  "description": "***RECIPE, SERVES FOUR***\n\nTwo chicken breasts\nGlug of white wine\nSalt\nPepper\nOlive oil\nFour cloves of garlic, chopped\nOne shallot, chopped\nTwo tablespoons of tomato paste\nOne 28-ounce can of crushed tomatoes\nHandful of flour\nOne egg, beaten\nTwo cups of Panko\nGrated Parmesan or pecorino cheese\nHalf-pound of spaghetti\nFresh basil leaves, torn\n\nCut the chicken breasts to half their original thickness, yielding four equal pieces. Pound them out on both sides, ideally with a spiked meat mallet. Season both sides liberally with salt and pepper. Put the chicken in a bowl with some of the chopped garlic and just enough white wine to coat. Toss and refrigerate.\n\nFor the tomato sauce, fry the shallots and the remaining garlic in olive oil until soft. Put in the tomato paste and fry briefly, then the canned tomatoes and a glug of white wine. Reduce heat to a simmer, and cook for about 30 minutes, stirring frequently to keep it from burning.\n\nWhen the sauce is about ready, prepare to bread the chicken by putting the flour and breadcrumbs onto separate plates and the beaten egg in a bowl. Grate a large pile of cheese onto the breadcrumbs and toss to mix it in. Dry the marinade off the chicken on paper towels.\n\nPut a pot of salted water on the boil for the spaghetti.\n\nCoat each piece of chicken in flour, then egg, then breadcrumbs/cheese.\n\nPour a heavy coating of olive oil into a wide pan on medium heat. Fry the chicken gently, two pieces at a time, until golden on both sides and the internal temperature reads 160 F — 6-8 minutes. Remove cooked chicken to a cooling rack. You’ll probably need to add more olive oil for the second batch.\n\nStart the spaghetti cooking when you start frying the second batch of chicken, and drain it when finished.\n\nAdd basil to the tomato sauce, pour some sauce into the drained spaghetti and toss. Divide spaghetti onto four serving plates and top with grated cheese. Place a few dollops of sauce around the outside of each plate and place the chicken pieces. Dip each bite of chicken into the sauce as you eat.\n\nMY COOKING PHILOSOPHY:\nI don't like weighing or measuring things if I don't have to, and I don't like to be constantly checking a recipe as I cook. I don't care that volume is a bad way of measuring things — it's usually easier. I like for a recipe to get me in the ballpark, and then I like to eyeball and improvise the rest. If you're like me, my goal with these videos is to give you a sense of how the food should look and feel as you're cooking it, rather than give you a refined formula to reproduce.",
  "thumbnails": {
    "default": {
      "height": 90,
      "url": "https://i.ytimg.com/vi/p-LY9b1u_io/default.jpg",
      "width": 120
    },
    "medium": {
      "height": 180,
      "url": "https://i.ytimg.com/vi/p-LY9b1u_io/mqdefault.jpg",
      "width": 320
    },
    "high": {
      "height": 360,
      "url": "https://i.ytimg.com/vi/p-LY9b1u_io/hqdefault.jpg",
      "width": 480
    },
    "standard": {
      "height": 480,
      "url": "https://i.ytimg.com/vi/p-LY9b1u_io/sddefault.jpg",
      "width": 640
    },
    "maxres": {
      "height": 720,
      "url": "https://i.ytimg.com/vi/p-LY9b1u_io/maxresdefault.jpg",
      "width": 1280
    }
  }
}