{
  "title": "Sichuan Tofu Rice, Douhuafan, from scratch (豆花饭)",
  "video_published_at": "2019-05-17T01:51:43Z",
  "start_at": null,
  "end_at": null,
  "video_id": "Pgm4W9LwzDg",
  "published_at": "2020-08-08T22:33:33Z",
  "description": "Douhuafan! One of our favorite dishes, and what I strongly believe to be the best tofu dish on the planet.\n\nThe basic idea of this is to make a meal out of it - top some white rice with fresh homemade Sichuan-style Douhua, smother each bite with spicy chili sauce, and drink the tofu liquid as a soup. It's a great dish - if you love tofu, you'll love it - if you don't like tofu, you'll still really like it.\n\nVegetarian friendly, too. And with the exception of that Mujiangzi oil, basically everything should be very available in the West. If opting for lemongrass oil, use common sense when cooking with essential oils - no more than a couple drops, and be sure to buy from a source you trust (there's a lot of garbage essential oils out there). If you're concerned, you could alternatively add a bit of lemongrass syrup instead (the sort used to flavor mixed drinks), which unlike essential oils are actually regulated by the FDA.\n\nWritten recipe is over here on /r/cooking:\n\nhttps://www.reddit.com/r/Cooking/comments/bq3esr/recipe_sichuan_spicy_tofu_rice_douhuafan_%E8%B1%86%E8%8A%B1%E9%A5%AD/\n\nIf you happen to find yourself in Shenzhen, the name of the restaurant is “高三姐豆花饭”, the Dianping is here: http://www.dianping.com/shop/22637660\n\nAnd check out our Patreon if you'd like to support the project!\n\nhttp://www.patreon.com/ChineseCookingDemystified\n\nOutro Music: \"Add And\" by Broke For Free \nhttps://soundcloud.com/broke-for-free\n\nABOUT US\n-----------------------------------------------------------------------------------------\nLearn how to cook real deal, authentic Chinese food! We post recipes every Tuesday (unless we happen to be travelling) :)\n\nWe're Steph and Chris - a food-obsessed couple that lives in Shenzhen, China. Steph is from Guangzhou and loves cooking food from throughout China - you'll usually be watching her behind the wok. Chris is a long-term expat from America that's been living in China and loving it for the last eleven years - you'll be listening to his explanations and recipe details, and doing some cooking at times as well.\n\nThis channel is all about learning how to cook the same taste that you'd get in China. Our goal for each video is to give you a recipe that would at least get you close to what's made by some of our favorite restaurants here. Because of that, our recipes are no-holds-barred Chinese when it comes to style and ingredients - but feel free to ask for tips about adaptations and sourcing too!",
  "thumbnails": {
    "default": {
      "height": 90,
      "url": "https://i.ytimg.com/vi/Pgm4W9LwzDg/default.jpg",
      "width": 120
    },
    "medium": {
      "height": 180,
      "url": "https://i.ytimg.com/vi/Pgm4W9LwzDg/mqdefault.jpg",
      "width": 320
    },
    "high": {
      "height": 360,
      "url": "https://i.ytimg.com/vi/Pgm4W9LwzDg/hqdefault.jpg",
      "width": 480
    },
    "standard": null,
    "maxres": null
  }
}