{
  "title": "How to Make Chicken Scarpariello (Italian Sweet and Sour Chicken With Sausage)",
  "video_published_at": "2017-01-16T17:12:35Z",
  "start_at": null,
  "end_at": null,
  "video_id": "Q8qW3TtN0ao",
  "published_at": "2018-04-30T01:06:29Z",
  "description": "Chicken scarpariello, the Italian-American dish of chicken braised with sausage and peppers in a sweet and sour sauce is one of those perfect Tuesday night meals. It's punchy, it's not for the timid, but it's ultimately very easy to make, requiring just a single sauté pan or Dutch oven, about 20 minutes on the stovetop, and a half hour in the oven.\n\n\nWHY THIS RECIPE WORKS:\n\n- A flavor-packed, sweet and sour, hearty weeknight chicken and sausage dinner.\n- Intensely browning chicken thighs produces flavor for the whole dish.\n- Chicken thighs stay nice and tender while their skin crisps.\n- The liquid from a jar of pickled cherry peppers provides a vinegary - base for the pan sauce.\n\nSPECIAL EQUIPMENT:\n\nstraight-sided sauté pan or Dutch oven\n\nINGREDIENTS:\n\n2 1/2 pounds bone-in, skin-on chicken thighs (6 to 8 thighs; 1.15kg)\nKosher salt and freshly ground black pepper\n1 tablespoon vegetable oil\n3 to 4 links sweet or hot Italian sausage (about 1 1/2 pounds; 700g)\n1 medium onion, thinly sliced (about 6 ounces; 170g)\n1 large red bell pepper, thinly sliced (about 6 ounces; 170g)\n2 tablespoons finely minced fresh sage leaves (about 8g)\n6 cloves garlic, thinly sliced\n8 hot or sweet pickled cherry peppers, thinly sliced, along with 1/4 cup (60ml) pickling liquid from the jar\n1 cup (240ml) dry white wine\n1 cup homemade or store-bought low-sodium chicken stock\n2 tablespoons sugar\n\nDIRECTIONS:\n\n1. Adjust oven rack to center position and preheat oven to 350°F (175°C). Season chicken generously with salt and pepper. Heat oil in a 4- to 5-quart straight-sided sauté pan or Dutch oven over medium-high heat until shimmering. Add chicken, skin side down, and cook without moving it until well browned and crisp, about 8 minutes total, lowering heat if it starts to smoke excessively. Flip chicken and brown lightly on second side, about 3 minutes. Transfer chicken to a large plate and set aside.\n\n2. Return the skillet to heat without draining it and add the sausage. Cook until well-browned on the first side, about 1 1/2 minutes, reducing the heat if it starts smoking. Flip the sausage and cook on the second side until browned, about 1 1/2 minutes longer. Remove the pan from heat, transfer the sausage to a cutting board, and cut each one into 3 to 4 slices.\n\n3. Return pan to heat and add onion and pepper and cook, stirring and scraping up browned bits with a wooden spoon, until softened and starting to brown, about 4 minutes. Add sage and garlic, stir to combine, and cook until fragrant, about 1 minute.\n\n4. Add pickled cherry peppers and their liquid, stirring and scraping up browned bits from the bottom of the pan with a wooden spoon. Add wine and let liquid reduce by half, about 2 minutes. Add chicken stock and stir to combine. Return sausage to pan, toss to combine, then nestle chicken pieces skin-side-up in the pan, nestling them down into the sauce, vegetable, and sausage.\n\n5. Transfer to the oven and cook until chicken is crisp and tender, about 30 minutes. Serve immediately, spooning sauce, vegetables and sausage around chicken pieces.",
  "thumbnails": {
    "default": {
      "height": 90,
      "url": "https://i.ytimg.com/vi/Q8qW3TtN0ao/default.jpg",
      "width": 120
    },
    "medium": {
      "height": 180,
      "url": "https://i.ytimg.com/vi/Q8qW3TtN0ao/mqdefault.jpg",
      "width": 320
    },
    "high": {
      "height": 360,
      "url": "https://i.ytimg.com/vi/Q8qW3TtN0ao/hqdefault.jpg",
      "width": 480
    },
    "standard": {
      "height": 480,
      "url": "https://i.ytimg.com/vi/Q8qW3TtN0ao/sddefault.jpg",
      "width": 640
    },
    "maxres": {
      "height": 720,
      "url": "https://i.ytimg.com/vi/Q8qW3TtN0ao/maxresdefault.jpg",
      "width": 1280
    }
  }
}