{
  "title": "The Ultimate Afternoon Tea Sandwiches - Recipe Tutorial with Will Torrent",
  "video_published_at": "2016-02-11T15:56:34Z",
  "start_at": null,
  "end_at": null,
  "video_id": "QOTRuK_aCWM",
  "published_at": "2018-05-23T03:54:02Z",
  "description": "Learn how to make the two classic afternoon tea sandwiches with master pâtissier, Will Torrent, and bring this high tea tradition right up to date in your own home. Try Will's cucumber sandwiches with yuzu and chive butter or his delicious smoked salmon sandwiches with whipped cream cheese - both recipes are taken from his gorgeous new book, Afternoon Tea at Home, and can be found below. The book is published by Ryland Peters & Small with stunning photography by Matt Russell, find out more about it here: http://rylandpeters.com/afternoon-tea...\n\n\nCUCUMBER SANDWICHES WITH YUZU AND CHIVE BUTTER\n\n100 g/7 tablespoons butter, softened\n2 teaspoons yuzu or lemon juice\n1 tablespoon finely chopped fresh chives\nsalt and freshly ground black pepper, to taste\n½ large cucumber\n2 teaspoons cider vinegar\n8 slices white bread\n\nMakes 24\n\nBeat the butter until really soft and spreadable.\n\nGradually add the yuzu or lemon juice, mix in and season with salt and black pepper. Add the chives and mix to combine.\n\nPeel the cucumber and thinly slice into rounds. Tip the slices into a bowl, add the cider vinegar and toss to coat.\n\nLay half of the bread slices out on the work surface and spread with half of the yuzu and chive butter.\n\nArrange the cucumber slices on top as neatly and evenly as possible and season with salt and pepper. Spread the remaining bread with the yuzu and chive butter and press on top of the cucumber-topped bread, butter-side down.\n\nGently press the sandwiches together and trim off the crusts using a serrated knife. Cut the sandwiches into neat rectangles or triangles to serve.\n\n\nSMOKED SALMON SANDWICHES WITH WHIPPED CREAM CHEESE\n\n150 g/1 stick plus\n2 tablespoons butter, softened\n1 teaspoon lemon zest and 2 teaspoons juice\nsalt and freshly ground black pepper, to taste\n300 g/10 oz. cream cheese\n8 thin slices brown bread\n400 g/14 oz. thinly sliced smoked salmon\n\nMakes 24\n\nBeat the butter until really soft and spreadable, add the lemon zest and juice, season with salt and black pepper and mix in.\n\nIn another bowl beat the cream cheese with a wooden spoon or rubber spatula (or in a food processor/mixer if you have one) until really light, season with black pepper and mix well.\n\nLay the bread out on the work surface and spread with a thin layer of the lemon butter. Spread half of the slices with the whipped cream cheese and lay the smoked salmon on the remaining buttered slices of bread.\n\nSandwich the two together and using a serrated knife trim off the crusts. Cut each sandwich into dainty bite-sized rectangles or triangles to serve.\n\n\nCREDITS\n\nBoth recipes are taken from Afternoon Tea at Home by Will Torrent © Ryland Peters & Small 2016: http://www.rylandpeters.com/afternoon-tea-at-home\nVideo by Story Culture: http://www.storyculture.co.uk/\nFind out more about Will Torrent here: http://www.willtorrent.com/",
  "thumbnails": {
    "default": {
      "height": 90,
      "url": "https://i.ytimg.com/vi/QOTRuK_aCWM/default.jpg",
      "width": 120
    },
    "medium": {
      "height": 180,
      "url": "https://i.ytimg.com/vi/QOTRuK_aCWM/mqdefault.jpg",
      "width": 320
    },
    "high": {
      "height": 360,
      "url": "https://i.ytimg.com/vi/QOTRuK_aCWM/hqdefault.jpg",
      "width": 480
    },
    "standard": {
      "height": 480,
      "url": "https://i.ytimg.com/vi/QOTRuK_aCWM/sddefault.jpg",
      "width": 640
    },
    "maxres": {
      "height": 720,
      "url": "https://i.ytimg.com/vi/QOTRuK_aCWM/maxresdefault.jpg",
      "width": 1280
    }
  }
}