{
  "title": "Korean-style short ribs — pan seared/braised method",
  "video_published_at": "2020-08-20T18:00:07Z",
  "start_at": null,
  "end_at": null,
  "video_id": "qsf8RlQW8Hw",
  "published_at": "2020-08-20T19:44:42Z",
  "description": "For unlimited access to the world’s top documentaries and non­fiction series, enter the promo code ‘ragusea’ when prompted and your membership is completely free for the first month: http://go.thoughtleaders.io/1863120200817 Thanks to CuriosityStream for sponsoring this video! \n\nMy earlier video about the science of marination: https://youtu.be/Rz1X0RP3Mfw\n\n***RECIPE, SERVES 4-6 PEOPLE***\n\n3-5 lb (1.4-2.3 kg) beef short ribs, either flanken cut or English cut\n1 pear, ideally an Asian variety\n1 bunch of scallions\na few garlic cloves\na thumb of ginger\nsoy sauce\nrice vinegar\nsugar (any kind)\nsesame oil\ntoasted sesame seeds for garnish\na couple bunches of any dark, leafy green, washed and roughly chopped (optional side)\nrice for side\n\nIf using English-cut short ribs, butterfly them per the video. If using flanken cut, consider washing them in a bowl of water to get off any bone fragments.\n\nPeel the garlic and the ginger. Peel and core the pear. Cut the white parts off the scallions and reserve the green parts for garnish later. Either grate all of the above, or put it in a food processor, along with about 1/2 cup (120 ml) soy sauce and a couple tablespoons each of sugar and vinegar. When everything is combined and smooth, taste it. It should taste good, but too sweet/salty/acidic. \n\nConsider adding more sugar, vinegar, soy sauce, etc, and put in a few drops of sesame oil to taste (it can go bitter if it gets too much abuse in the food processor, hence adding it toward the end). Combine the marinade with the meat in a sealable container, along with just enough water to help the marinade coat and cover everything. Refrigerate overnight.\n\nRemove the meat from the marinade and scrape off as much from the surface as you can. Place the meat in a single layer in your widest pan. (You may need to cook in two batches, or use two pans.) Pour in enough water to come halfway up the meat, then turn the heat on high. Flip the meat once or twice as the water boils out. As soon as most of the water is gone, you'll notice things starting to brown rapidly. Turn the heat way down and don't let anything burn. Flip the meat frequently and let it gently brown on all sides before taking it out to rest.\n\nIf making the greens, put as many of them in the pan as you can fit. They'll wilt quickly, so you'll be able to get in more as they shrink. Pour in some of the leftover marinade. Cook, stirring constantly, until they're just soft.\n\nSlice up the ribs, serve them with rice and greens, garnish them with sesame seeds and the thinly sliced scallion tops.",
  "thumbnails": {
    "default": {
      "height": 90,
      "url": "https://i.ytimg.com/vi/qsf8RlQW8Hw/default.jpg",
      "width": 120
    },
    "medium": {
      "height": 180,
      "url": "https://i.ytimg.com/vi/qsf8RlQW8Hw/mqdefault.jpg",
      "width": 320
    },
    "high": {
      "height": 360,
      "url": "https://i.ytimg.com/vi/qsf8RlQW8Hw/hqdefault.jpg",
      "width": 480
    },
    "standard": {
      "height": 480,
      "url": "https://i.ytimg.com/vi/qsf8RlQW8Hw/sddefault.jpg",
      "width": 640
    },
    "maxres": {
      "height": 720,
      "url": "https://i.ytimg.com/vi/qsf8RlQW8Hw/maxresdefault.jpg",
      "width": 1280
    }
  }
}