{
  "title": "Really Deviled Deviled Eggs",
  "video_published_at": "2016-12-08T18:05:56Z",
  "start_at": null,
  "end_at": null,
  "video_id": "r6IDXli0WSQ",
  "published_at": "2017-05-27T22:47:01Z",
  "description": "http://www.seriouseats.com/recipes/2011/09/great-deviled-eggs-recipe.html\n\nThese eggs, inspired by the ones served at The Spotted Pig in New York, are punchy and light, just like a bar snack should be. The video shows a half batch of the recipe.\n\nNote: For the best results, use really really good olive oil. I like overstuffing the eggs, which leaves you with a few extra whites. Just eat'em (or feed them to the dog). Older eggs (a couple weeks old) will peel more easily than very fresh eggs.\n\nINGREDIENTS\n1 dozen large eggs, not too fresh\n2 tablespoons mayonnaise, preferably home made\n1 tablespoon dijon mustard\nUp to 1 tablespoon white wine vinegar\n1/2 teaspoon Frank's Red Hot sauce\n1/4 cup extra virgin olive oil (see note)\nKosher salt\nFreshly ground black pepper\n3 tablespoons thinly sliced chives\nCrushed red pepper or hot paprika\nCrunchy sea salt (like Maldon)\n\nDIRECTIONS\n\n1. Add 1 tray of ice cubes to a large bowl and fill with water. Fill a large pot with 1 inch of water. Place steamer insert inside, cover, and bring to a boil over high heat. Add eggs to steamer basket, cover, and continue cooking over high heat for 12 minutes. Immediately place eggs in a bowl of ice water and allow to cool for at least 15 minutes before peeling under cool running water. Slice each egg in half lengthwise.\n\n2. Place all of the yolks in the bowl of a food processor. Select 16 of the best looking egg white halves and set aside. Reserve the remaining 8 for another use. Add mayonnaise, mustard, half of vinegar, and hot sauce to food processor and process until smooth, scraping down sides of bowl as necessary.\n\n3. mWith machine running, slowly drizzle in 2 tablespoons of olive oil. Season mixture to taste with salt and remaining vinegar (if desired). Transfer to zipper-lock bag. Filling and egg white halves can be stored in the refrigerator up to overnight before filling and serving.\n\n4. Cut off corner of zipperlock bag and pipe filling mixture into egg whites, overstuffing each hole. Drizzle with remaining olive oil, sprinkle with black pepper, chives, crushed red pepper, and sea salt. Serve immediately.",
  "thumbnails": {
    "default": {
      "height": 90,
      "url": "https://i.ytimg.com/vi/r6IDXli0WSQ/default.jpg",
      "width": 120
    },
    "medium": {
      "height": 180,
      "url": "https://i.ytimg.com/vi/r6IDXli0WSQ/mqdefault.jpg",
      "width": 320
    },
    "high": {
      "height": 360,
      "url": "https://i.ytimg.com/vi/r6IDXli0WSQ/hqdefault.jpg",
      "width": 480
    },
    "standard": {
      "height": 480,
      "url": "https://i.ytimg.com/vi/r6IDXli0WSQ/sddefault.jpg",
      "width": 640
    },
    "maxres": {
      "height": 720,
      "url": "https://i.ytimg.com/vi/r6IDXli0WSQ/maxresdefault.jpg",
      "width": 1280
    }
  }
}