{
  "title": "New York-style pizza at home, v2.0",
  "video_published_at": "2020-02-13T20:26:59Z",
  "start_at": null,
  "end_at": null,
  "video_id": "SDpCzJw2xm4",
  "published_at": "2020-05-11T04:57:34Z",
  "description": "Thanks to Audible for sponsoring this video! Start listening with a 30-day Audible trial. Choose one audiobook and two Audible Originals absolutely \rfree: http://audible.com/adamragusea or text adamragusea to 500-500.\n\nIt's still possible to make NY-style pizza at home, though my technique has changed of late. For reference, here's my first pizza video, from a year ago: https://youtu.be/lzAk5wAImFQ\n\nMy video about how dough changes as it ages in the fridge: https://youtu.be/o4ABOKdHEUs\n\nMy video about pizza stones vs. pizza steels: https://youtu.be/UWVEgoEGnkY\n\n***RECIPE, MAKES FOUR PIZZAS***\n\n(NOTE: Quantities here are slightly updated from those shown in the video)\n\nFor the dough\n2 1/4 cups (530 ml) warm water\n1 tbsp sugar (12g) sugar\n1 tbsp (9g) active dry yeast\n2 tbsp (30 ml) olive oil\n1 tbsp (18 g) kosher salt\n5 cups (600g) bread flour, plus more for working the dough\nadditional oil for greasing the dough\ncornmeal, semolina flour, or coarse-ground whole wheat flour for dusting\n\nFor the sauce\n1 28 oz (828 ml) can crushed tomatoes (I like Pastene 'Kitchen Ready')\n2-4 tbsp (30-60 ml) olive oil\n1 tsp (4g) sugar\n2 tsp (a fraction of a gram, I don't know) dried oregano\n\nFor the cheese\n24-32 oz (680-910 g) whole-milk, low-moisture mozzarella, freshly grated (6-8 oz / 170-225 g per pizza)\ngrated parmesan for dusting (maybe 10 g per pizza?)\n\nStart the dough by combining the water, sugar and yeast in a large bowl and let sit for a few minutes. If the yeast goes foamy, it's alive and you're good to proceed (if it doesn't, it's dead and you need new yeast). Add the olive oil and salt and 5 cups (600g) of bread flour. Mix until just combined, then start kneading. Add just enough additional flour to keep the dough workable (i.e. not too sticky) and kneed until you can stretch some of the dough into a thin sheet without it tearing. (NOTE: You will probably need to add a lot more flour. The quantity I give here is just a base line to get your started.)\n\nDivide the dough into four equal balls and put them in four containers (ideally glass) and lightly coat the balls and the interior of their containers with olive oil. Cover, and either rise at room temperature for two hours, or put them in the refrigerator and let them rise for 1-7 days. (I prefer the long, cold rise.)\n\nWhen you want to bake, put a pizza stone or pizza steel into your oven (mine works best on a high rack position but every oven is different) and preheat to your highest possible temperature, ideally convection, for a full hour.\n\nFor the sauce, simply mix together the ingredients.\n\nLiberally dust a pizza peel with cornmeal (or something similar). Take the cold dough out of the fridge and dust it in flour. Stretch to the widest size and shape that will fit on your peel and stone/steel. Top with just enough sauce to lightly coat the surface. Dust the sauce layer with parmesan, then cover with the mozzarella. Transfer the pizza to the stone/steel and bake until the crust is well-browned and the cheese has browned a bit (but, ideally, has not started oozing out an orange grease layer), 6-7 minutes.",
  "thumbnails": {
    "default": {
      "height": 90,
      "url": "https://i.ytimg.com/vi/SDpCzJw2xm4/default.jpg",
      "width": 120
    },
    "medium": {
      "height": 180,
      "url": "https://i.ytimg.com/vi/SDpCzJw2xm4/mqdefault.jpg",
      "width": 320
    },
    "high": {
      "height": 360,
      "url": "https://i.ytimg.com/vi/SDpCzJw2xm4/hqdefault.jpg",
      "width": 480
    },
    "standard": {
      "height": 480,
      "url": "https://i.ytimg.com/vi/SDpCzJw2xm4/sddefault.jpg",
      "width": 640
    },
    "maxres": {
      "height": 720,
      "url": "https://i.ytimg.com/vi/SDpCzJw2xm4/maxresdefault.jpg",
      "width": 1280
    }
  }
}