{
  "title": "Biang Biang Noodles, with Chili oil topping (油泼面)",
  "video_published_at": "2019-03-06T02:59:14Z",
  "start_at": null,
  "end_at": null,
  "video_id": "SiBnK5DcWCU",
  "published_at": "2020-05-06T04:21:35Z",
  "description": "Biang Biang noodles are an awesome handmade noodle from Xi'an that've seemed to finally cross the Pacific. Sometimes called 'hand ripped' in English, these are a simple homestyle noodle that look impressive but're actually quite easy.\n\nThere's a bunch of different toppings you can toss on Biang Biang noodles - from Tomato and Egg to Stewed Pork - but these week we went with a classic chili oil based topping called You Po Mian. \n\nRecipe is over here on /r/cooking:\n\nhttps://www.reddit.com/r/Cooking/comments/axyghr/recipe_biang_biang_noodles_with_chili_oil_topping/\n\nAnd check out our Patreon if you'd like to support the project!\n\nhttp://www.patreon.com/ChineseCookingDemystified\n\nOutro Music: \"Add And\" by Broke For Free \nhttps://soundcloud.com/broke-for-free\n\nABOUT US\n-----------------------------------------------------------------------------------------\nLearn how to cook real deal, authentic Chinese food! We post recipes every Tuesday (unless we happen to be travelling) :)\n\nWe're Steph and Chris - a food-obsessed couple that lives in Shenzhen, China. Steph is from Guangzhou and loves cooking food from throughout China - you'll usually be watching her behind the wok. Chris is a long-term expat from America that's been living in China and loving it for the last nine years - you'll be listening to his explanations and recipe details, and doing some cooking at times as well.\n\nThis channel is all about learning how to cook the same taste that you'd get in China. Our goal for each video is to give you a recipe that would at least get you close to what's made by some of our favorite restaurants here. Because of that, our recipes are no-holds-barred Chinese when it comes to style and ingredients - but feel free to ask for tips about adaptations and sourcing too!",
  "thumbnails": {
    "default": {
      "height": 90,
      "url": "https://i.ytimg.com/vi/SiBnK5DcWCU/default.jpg",
      "width": 120
    },
    "medium": {
      "height": 180,
      "url": "https://i.ytimg.com/vi/SiBnK5DcWCU/mqdefault.jpg",
      "width": 320
    },
    "high": {
      "height": 360,
      "url": "https://i.ytimg.com/vi/SiBnK5DcWCU/hqdefault.jpg",
      "width": 480
    },
    "standard": null,
    "maxres": null
  }
}