{
  "title": "Jiggly Fluffy Japanese Cheesecake",
  "video_published_at": "2017-02-02T17:00:23Z",
  "start_at": null,
  "end_at": null,
  "video_id": "TeoS_fQWvkY",
  "published_at": "2017-06-26T17:57:31Z",
  "description": "Customize & buy the Tasty Cookbook here: http://bzfd.it/2fpfeu5\n\nHere is what you'll need!\n\nFluffy Jiggly Japanese Cheesecake\nServings: 6-8\n\nINGREDIENTS\n⅔ cup (130 milliliters) milk\n4 ounces (100 grams) cream cheese\n7 tablespoons (100 grams ) butter\n8 egg yolks\n½ cup (60 grams) flour\n½ cup (60 grams) cornstarch\n13 large egg whites\n⅔ cup (130 grams) granulated sugar\nParchment paper\nStrawberries, to serve\nPowdered sugar, to serve\n\nPREPARATION\nPreheat oven to 320°F/160°C.\nIn a small pot over medium heat, whisk the milk, cream cheese, and butter until smooth. Remove from heat and cool.\nIn a large bowl, whisk the egg yolks until smooth, then slowly drizzle in the cream mixture, stirring until evenly combined.\nSift in the flour and the cornstarch, whisking to make sure there are no lumps.\nIn another large bowl, beat the egg whites with a hand mixer until you see soft peaks when lifting the mixer up from the egg whites. \nGradually add the sugar while continuing to beat until you see hard peaks when lifting the mixer up.\nTake about ¼ of the egg whites and fold them into the egg yolk mixture, then repeat with the remaining egg whites until the batter is evenly combined.\nPlace a 4-inch parchment paper strip around the edge of a 9x3-inch cake pan that is already lined with parchment at the bottom. If you are using a springform pan, make sure to wrap the bottom and sides completely in foil, twice, to prevent any leakage.\nPour the batter into the parchment-lined pan and shake to release any large air bubbles.\nPlace the filled pan into a larger baking pan or dish lined with 2 paper towels at the bottom. The paper towels ensure that the heat is distributed evenly along the bottom of the pan. Fill the larger pan about 1-inch with hot water.\nBake for 25 minutes, then reduce the heat to 280°F/135°C, and bake for another 55 minutes, until the cake has risen to almost double its height.\nRemove from oven, and carefully, invert the cake onto your dominant hand and peel off the paper. Be extremely careful, the cake will be hot. You can also invert the cake onto a plate, but this will cause the cake to deflate more. \nSprinkle the top of the cake with powdered sugar, slice, and serve with strawberries while still warm!\nEnjoy! \n\n\n\n\nCheck us out on Facebook! - facebook.com/buzzfeedtasty\n\nMUSIC\nAsian Movement_Full\nLicensed via Warner Chappell Production Music Inc.\n\nCreated by https://www.buzzfeed.com/bfmp/videos/9227",
  "thumbnails": {
    "default": {
      "height": 90,
      "url": "https://i.ytimg.com/vi/TeoS_fQWvkY/default.jpg",
      "width": 120
    },
    "medium": {
      "height": 180,
      "url": "https://i.ytimg.com/vi/TeoS_fQWvkY/mqdefault.jpg",
      "width": 320
    },
    "high": {
      "height": 360,
      "url": "https://i.ytimg.com/vi/TeoS_fQWvkY/hqdefault.jpg",
      "width": 480
    },
    "standard": {
      "height": 480,
      "url": "https://i.ytimg.com/vi/TeoS_fQWvkY/sddefault.jpg",
      "width": 640
    },
    "maxres": {
      "height": 720,
      "url": "https://i.ytimg.com/vi/TeoS_fQWvkY/maxresdefault.jpg",
      "width": 1280
    }
  }
}