{
  "title": "Cranberry-Orange Loaves - Everyday Food with Sarah Carey",
  "video_published_at": "2013-12-13T13:00:02Z",
  "start_at": null,
  "end_at": null,
  "video_id": "u3Ccr7ojxM0",
  "published_at": "2014-10-24T05:41:39Z",
  "description": "If you think you don't like fruitcake, you might want to reconsider -- that is, after trying out this couldn't-be-easier (and couldn't-be-tastier) recipe for cranberry-orange loaves. Baked in mini loaf pans, these adorable treats would make lovely holiday gifts for anyone on your list (they can be stored in an airtight container for three days or frozen, unglazed, for three weeks). Of course, the hardest part about gifting this delicious quick bread is getting it out of your own kitchen. Spread some seasonal joy with these cheerful sweets.\n\nSarah's Tip of the Day: \nIf you're really feeling generous, make larger versions of these mini quick breads. Divide the batter between two 4 1/2-by-8 1/2-inch loaf pans and bake for 50 to 60 minutes.\n\nSubscribe for more easy and delicious recipes: http://full.sc/P8YgBt\n\n---------------------------------------------------------------\n\nPREP: 30 MINS TOTAL TIME: 1  HOUR  30 MINS\nYIELD:Makes 12 2 1/2-by-4 1/2-inch loaves\n\nINGREDIENTS:\n2 sticks unsalted butter, room temperature, plus more for pan\n3 1/2 cups all-purpose flour (spooned and leveled), plus more for pan\n1 tablespoon baking powder\n1 teaspoon fine salt\n1 cup whole milk\n2 tablespoons grated orange zest plus 10 tablespoons orange juice, divided\n2 cups granulated sugar\n4 large eggs\n1 1/2 cups dried cranberries, chopped\n2 cups confectioners' sugar\n\nDIRECTIONS\nSTEP 1\nPreheat oven to 350 degrees. Butter and flour 12 2 1/2-by-4 1/2-inch loaf pans. Whisk together flour, baking powder, and salt. In another bowl, mix together milk and 1/2 cup juice. In a large bowl, using a mixer, beat butter and granulated sugar on medium-high until light and fluffy, 8 minutes. Add zest, then eggs, one at a time, beating well and scraping down bowl as needed. With mixer on low, add flour mixture in three additions, alternating with milk mixture; beat until combined. Fold in cranberries.\nSTEP 2\nTransfer batter to prepared pans and bake until a skewer inserted in center comes out with a few moist crumbs, 45 to 50 minutes. Let cool in pans on a wire rack set in a rimmed baking sheet, 30 minutes. Remove loaves from pans and let cool completely on rack.\nSTEP 3\nWhisk confectioners' sugar and remaining 2 tablespoons juice to make glaze. Drizzle over loaves and let stand until set. (Store in airtight containers, 3 days, or freeze unglazed, 3 weeks.)\n\n---------------------------------------------------------------\n\nGet the Full Recipe: http://full.sc/1j0B5s1\n\nMore Sweet Treat Recipes: http://full.sc/Q9cvnf\n\n---------------------------------------------------------------\n\nWant more? Sign up to get my video recipe email, served daily.\nGet recipe emails: http://www.marthastewart.com/edf\nLike Everyday Food: http://www.facebook.com/EverydayFood\nFollow Everyday Food: https://twitter.com/everydayfood\nEveryday Food Pinterest: http://pinterest.com/everydayfood\n\nSarah Carey is the editor of Everyday Food magazine and her job is to come up with the best ways to make fast, delicious food at home. But she's also a mom to two hungry kids, so the question \"What's for dinner?\" is never far from her mind -- or theirs, it seems! Her days can get crazy busy (whose don't?), so these videos are all about her favorite fast, fresh meals -- and the tricks she uses to make it all SO much easier.\n\nCranberry-Orange Loaves - Everyday Food with Sarah Carey\nhttp://www.youtube.com/user/everydayfoodvideos",
  "thumbnails": {
    "default": {
      "height": 90,
      "url": "https://i.ytimg.com/vi/u3Ccr7ojxM0/default.jpg",
      "width": 120
    },
    "medium": {
      "height": 180,
      "url": "https://i.ytimg.com/vi/u3Ccr7ojxM0/mqdefault.jpg",
      "width": 320
    },
    "high": {
      "height": 360,
      "url": "https://i.ytimg.com/vi/u3Ccr7ojxM0/hqdefault.jpg",
      "width": 480
    },
    "standard": {
      "height": 480,
      "url": "https://i.ytimg.com/vi/u3Ccr7ojxM0/sddefault.jpg",
      "width": 640
    },
    "maxres": null
  }
}