{
  "title": "How to Make Dan Dan Noodles",
  "video_published_at": "2017-09-16T03:45:14Z",
  "start_at": null,
  "end_at": null,
  "video_id": "uhYEy3PA0RI",
  "published_at": "2017-09-17T01:50:43Z",
  "description": "This recipe is excerpted from my upcoming book, a follow up to my 2015 book The Food Lab. You can find more info and stay up-to-date on its release at kenjilopezalt.com\n\nDan dan noodles are a classic Sichuan dish of noodles tossed in a spicy and numbing chili sauce with ground pork. It's incredibly simple to make, even if you don't have access to fresh Chinese noodles (just cook dried pasta in water with about 1/4 teaspoon of baking soda per quart and it'll give the pasta the flavor and bouncy texture of Chinese wheat noodles!). Some of the ingredients can be a little tough to find in western supermarkets, but all of them last a long time in the fridge (like, months or years), so just grab some on a trip to the Asian market, or order them online.\n\nPickled mustard root: https://www.amazon.com/WuJiang-Preserved-Mustard-Stems-Shredded/dp/B01MU55QLK/?tag=kenjilopezalt-20\n\nRoasted chili oil (or use homemade recipe below): https://www.amazon.com/Spicy-Chili-Crisp-Oil-Sauce/dp/B00G8WQQZ2/?tag=kenjilopezalt-20\n\nChinkiang vinegar: https://www.amazon.com/Gold-Plum-Chinkiang-Vinegar-18-6/dp/B00BUIKGU0/?tag=kenjilopezalt-20\n\nRecipes:\n\nNote: For best results, use fresh Chinese lo mein-style noodles. If they are unavailable, you can use fresh or dried pasta such as spaghetti or even tagliatelle. For a bouncier texture and flavor that emulates Chinese noodles, add 1/4 teaspoon of baking soda per quart of water when cooking the pasta.\n\nServes 4 to 6 as an appetizer or as part of a larger meal\n\nFor the Pork:\n2 tablespoons (30ml) vegetable oil\n6 ounces (120g) ground or finely chopped pork\n1 teaspoon ground Sichuan peppercorns\n2 cloves garlic, minced\n1/2-inch knob ginger, minced\n2 ounces (about ¼ cup) minced preserved mustard root or stem (ya cai or zha cai, see note)\n\nFor the Sauce:\n1 tablespoon (15ml) soy sauce\n2 tablespoons (30ml) Chinkiang vinegar\n1 to 2 tablespoons (15 to 30ml) store-bought or homemade roasted chili oil\n\nTo Serve:\n1 pound fresh Chinese noodles (see note)\n4 to 5 thinly sliced scallions\n\n\n1. For the Pork: Rub a thin film of oil into the bottom of a wok using a paper towel. Heat the wok over high heat until smoking. Add the remaining oil, the pork, and the Sichuan peppercorns. Cook, stirring and tossing and using a spatula to break up the pork until it is no longer pink, about 1 minute. Continue cooking until the pork starts to brown slightly, about 1 minute longer. Add the garlic and ginger and cook, stirring, until fragrant, about 30 seconds. Add the preserved mustard root and cook, stirring, until fragrant, about 30 seconds. Transfer mixture to a bowl and set aside.\n\n2. Bring a large pot of salted water to a boil. Pour soy sauce, vinegar, and chili oil in the bottom of a large serving bowl.\n\n3. When the water is boiling, add the noodles and cook according to the package directions until barely cooked through, just a couple minutes. Use a ladle to transfer about ¾ cup of boiling water from the noodle pot to the serving bowl. \n\n4. Drain the noodles and transfer them to the bowl. Spoon the pork mixture on top and garnish with scallions. Serve immediately, tossing the noodles in the sauce at the table before serving.\n\nMIXED ROASTED CHILI OIL\n\n2 ounces mixed dried chilies, such as arbol, Sichuan, pasilla, California, and ancho\n1 ½ cups neutral oil such as canola, vegetable, or safflower\n2 (1/4-inch) slices fresh ginger\n1 tablespoon Sichuan peppercorns (optional)\n2 tablespoons sesame seeds (optional)\n\n1. Place the chilies on a microwave-safe plate and microwave on high power at 15 second intervals and hot, pliant, and toasty-smelling. Depending on the power of your microwave this can take between 45 seconds and up to a few minutes. Do not let the chilies smoke or burn. Alternatively, toast the chilies on a rimmed baking sheet in a 375°F (200°C) oven until toasty-smelling, about 3 minutes.\n\n2. Using a pair of kitchen shears, trim the stems, ribs, and seeds from the chilies and discard.\n\n3. Transfer the chilies to a blender or food processor and add 1 cup of oil. Pulse until the chilies are finely chopped (you can leave them chunkier for more texture, or chop them very fine for more intense flavor and heat).\n\n4. Transfer oil/chili mixture to a small saucepan. Add remaining oil, ginger, Sichuan peppercorns (if using), and sesame seeds (if using). Set over medium heat and cook, stirring the pot frequently, until the mixture is gently sizzling. Remove from heat and let cool completely. Transfer to a mason jar. Tightly sealed in the refrigerator or a cool, dark cabinet, the chili oil should keep for several months.",
  "thumbnails": {
    "default": {
      "height": 90,
      "url": "https://i.ytimg.com/vi/uhYEy3PA0RI/default.jpg",
      "width": 120
    },
    "medium": {
      "height": 180,
      "url": "https://i.ytimg.com/vi/uhYEy3PA0RI/mqdefault.jpg",
      "width": 320
    },
    "high": {
      "height": 360,
      "url": "https://i.ytimg.com/vi/uhYEy3PA0RI/hqdefault.jpg",
      "width": 480
    },
    "standard": {
      "height": 480,
      "url": "https://i.ytimg.com/vi/uhYEy3PA0RI/sddefault.jpg",
      "width": 640
    },
    "maxres": {
      "height": 720,
      "url": "https://i.ytimg.com/vi/uhYEy3PA0RI/maxresdefault.jpg",
      "width": 1280
    }
  }
}