{
  "title": "Beer Chicken Stew with Biscuit Topping",
  "video_published_at": "2019-10-24T18:00:06Z",
  "start_at": null,
  "end_at": null,
  "video_id": "uRFWnL1tg7o",
  "published_at": "2021-01-11T04:28:06Z",
  "description": "Tuck into this cozy AF cross between chicken & dumplings and a pot pie, courtesy of my friend Ben Harrison, co-host of funny, irreverent Star Trek review podcasts \"The Greatest Generation\" and \"The Greatest Discovery,\" as well as the war movie review podcast \"Friendly Fire.\"\n\n***LINKS/CREDITS***\n\nThe Greatest Generation (reviewing Star Trek: The Next Generation, and now Deep Space Nine, with Adam Pranica): https://art19.com/shows/the-greatest-generation\n\nThe Greatest Discovery (reviewing Star Trek: Discovery, Picard, and all other new Star Trek stuff happening now, with Adam Pranica): https://art19.com/shows/the-greatest-discovery\n\nFriendly Fire (reviewing war movies, with Adam Pranica and musician / history buff John Roderick): https://art19.com/shows/friendly-fire\n\nGreatest Generation podcast photos in the video by Brian Irwin. Friendly Fire photos by Laura Duffy.\n\nBen shot the footage in this video. I edited it.\n\n***RECIPE FROM BEN***\n\n.5 Lbs bacon\nAbout 2 cups of diced aromatic veggies. Whatever you want. I used: shallots, fennel and carrots. You could probably do apples, other root veggies, garlic, onion. Empty out the fridge.\nA few of cut up mushrooms\n4 boneless skinless chicken thighs dredged in flour\n1 beer. A lager or a brown ale.\n1 recipe of buttermilk biscuits: https://youtu.be/BhXLxDctHL8\nHerbs that you like. I do a few sprigs of thyme, generally, or maybe sage\nChop the bacon up and cook it off in the bottom of a dutch oven. When it’s crispy, remove it from the pan with a slotted spoon and set it aside.\n\nIn the hot bacon fat, brown the chicken thighs on both sides. You don’t need to cook them through, just get some brown on them. Set them aside as well.\n\nAssess how much fat is in the bottom of the pan. I often remove about half so my dinner isn’t greasy.\n\nAdd the chopped up veggies to the fat and let them brown up and soften.\n\nAdd your mushrooms and let them cook a bit. Once they have softened a bit, put the bacon and chicken back in the pot with their juices. This would be a good time to season your stew, so add salt, pepper and whatever other herbs/spices. This is a good time to preheat your oven to 450°.\n\nPour in your beer. You’re looking to just cover the contents of the pot, so if one beer isn’t enough, fill the can with water and add water until there’s enough liquid. Bring it to a boil and then lower the heat and simmer to reduce it a bit.\n\nMake biscuit dough and cut out biscuits. Keep them in the fridge until the stew is ready. Melt some butter with herbs and pepper in a small pan.\n\nAfter about 30 or 40 minutes of simmering, the stew should be somewhat thickened and reduced. Float the uncooked biscuits on top of the broth. Brush the top with the herbed melted butter, and put the entire pot into your oven. Cook for 20 to 25 minutes or until the biscuits are nice and brown on top.\n\nServe with more of that beer!",
  "thumbnails": {
    "default": {
      "height": 90,
      "url": "https://i.ytimg.com/vi/uRFWnL1tg7o/default.jpg",
      "width": 120
    },
    "medium": {
      "height": 180,
      "url": "https://i.ytimg.com/vi/uRFWnL1tg7o/mqdefault.jpg",
      "width": 320
    },
    "high": {
      "height": 360,
      "url": "https://i.ytimg.com/vi/uRFWnL1tg7o/hqdefault.jpg",
      "width": 480
    },
    "standard": {
      "height": 480,
      "url": "https://i.ytimg.com/vi/uRFWnL1tg7o/sddefault.jpg",
      "width": 640
    },
    "maxres": {
      "height": 720,
      "url": "https://i.ytimg.com/vi/uRFWnL1tg7o/maxresdefault.jpg",
      "width": 1280
    }
  }
}