{
  "title": "POV No Knead Bread",
  "video_published_at": "2020-04-14T14:45:37Z",
  "start_at": null,
  "end_at": null,
  "video_id": "uWbl3Sr2y1Y",
  "published_at": "2020-04-16T04:47:07Z",
  "description": "You will make dough today. You will bake bread tomorrow. Even on your very first try, it will be great.\n\nNo-knead bread has been around for a long time, but because really popular in 2007 when Mark Bittman published Jim Lahey's recipe in the New York Times.\n\nThe technique uses two distinct tricks to make bread-baking easier and better at home. The no-knead process involves mixing together the ingredients for a high-hydration dough, then letting them sit overnight, allowing the yeast and enzymes to do the work of kneading for you.\n\nThe trick of baking it within a dutch oven is the more interesting part to me. It traps steam, allowing you to replicate the effects of a commercial bakery oven, giving you a thicker, crisper crust and better oven spring for superior hole structure.\n\nIt's also dead simple to do.\n\nhttps://www.seriouseats.com/2011/06/the-food-lab-the-science-of-no-knead-dough.html\n\nPLEASE READ!\n\nThe coronavirus has hit many folks hard, including first responders and hospital workers, individuals and families who were already food insecure, and service industry employees who are, for the large part, currently out of a job.\n\nMy goal is to help fix both these problems in the best way I know how to contribute: organizing people, and cooking food.\n\nIf you would like to donate to our free meal fund, head to https://www.toasttab.com/wursthall/ where you can buy a boxed meal for someone in need. These boxes go directly to the frontline workers and food insecure families who have been hit hardest by the coronavirus pandemic. They also allow me to hire back my kitchen team to cook and pack these meals (in a safe, clean way). So far we have served nearly 500 meals, and the number goes up every week.\n\nIf you would like to make a monthly recurring donation of any size, head to my Patreon account at https://www.patreon.com/kenjilopezalt. 100% of the proceeds go directly to the free meal fund. You can also help by buying my books at bookshop.org/shop/kenjilopezalt where 100% of my sales commission goes to the free meal fund, and an additional 10% goes to independent book stores around the country.\n\nFinally, stay safe. Here is my guide to food safety and the coronavirus, written with the consultation of virologists, food safety experts, and infectious disease specialists, and kept up to date as new research emerges: https://www.seriouseats.com/2020/03/food-safety-and-coronavirus-a-comprehensive-guide.html#comment-anchor-452226",
  "thumbnails": {
    "default": {
      "height": 90,
      "url": "https://i.ytimg.com/vi/uWbl3Sr2y1Y/default.jpg",
      "width": 120
    },
    "medium": {
      "height": 180,
      "url": "https://i.ytimg.com/vi/uWbl3Sr2y1Y/mqdefault.jpg",
      "width": 320
    },
    "high": {
      "height": 360,
      "url": "https://i.ytimg.com/vi/uWbl3Sr2y1Y/hqdefault.jpg",
      "width": 480
    },
    "standard": {
      "height": 480,
      "url": "https://i.ytimg.com/vi/uWbl3Sr2y1Y/sddefault.jpg",
      "width": 640
    },
    "maxres": {
      "height": 720,
      "url": "https://i.ytimg.com/vi/uWbl3Sr2y1Y/maxresdefault.jpg",
      "width": 1280
    }
  }
}