{
  "title": "Pasta With Butternut Squash, Brown Butter, and Sage",
  "video_published_at": "2017-02-21T18:25:26Z",
  "start_at": null,
  "end_at": null,
  "video_id": "wf4Rz1Wozkc",
  "published_at": "2017-07-15T01:04:29Z",
  "description": "Brown butter-based pasta sauces are some of the simplest things around. They're emulsions made with a flavorful fat and pasta cooking water that coats the pasta in a thin, creamy sheen of flavor. Throw in some sautéed squash and some sage and you've got yourself a great 30-minute meal. It's a classic fall and winter dish that can be made right on the stovetop.\n\n\nWHY THIS RECIPE WORKS\n\n- Lemon juice adds flavor and halts the butter from over-browning when forming the sauce.\n- Concentrating the pasta starch by using a small amount of cooking water helps the sauce emulsify into a creamy coating.\n\n\nINGREDIENTS\n\n2 tablespoons extra-virgin olive oil (30ml)\n1 pound butternut squash, peeled, seeded, and cut into 1/2-inch cubes (450g; about 1/2 large squash)\nKosher salt and freshly ground black pepper\n2 tablespoons unsalted butter (30g)\n1 small shallot, finely minced (about 1 ounce; 30g)\n1 handful fresh sage leaves, finely minced (about 1/2 ounce; 15g)\n1 tablespoon juice from 1 lemon (15ml)\n1 pound small cupped, tubular, or ridged pasta such as orecchiette, penne, farfalle, or rotini (450g)\n1 ounce grated fresh Parmigiano-Reggiano cheese (30g)\n\nDIRECTIONS\n\n1. Heat olive oil in a large stainless steel or cast-iron skillet over high heat until very lightly smoking. Immediately add squash, season with salt and pepper, and cook, stirring and tossing occasionally, until well-browned and squash is tender, about 5 minutes. Add butter and shallots and continue cooking, stirring frequently, until butter is lightly browned and smells nutty, about 1 minute longer. Add sage and stir to combine (sage should crackle and let off a great aroma). Remove from heat and stir in lemon juice. Set aside.\n\n\n2. In a medium saucepan, combine pasta with enough room temperature or hot water to cover by about 2 inches. Season with salt. Set over high heat and bring to a boil while stirring frequently. Cook, stirring frequently, until pasta is just shy of al dente, about 2 minutes less than the package directions. Drain pasta, reserving a couple cups of the starchy cooking liquid.\n\n3. Add pasta to skillet with squash along with a splash of pasta water. Bring to a simmer over high heat and cook until the pasta is perfectly al dente, stirring and tossing constantly and adding a splash of water as needed to keep the sauce loose and shiny. Off heat, stir in Parmigiano-Reggiano. Adjust seasoning with salt and pepper and texture with more pasta water as needed. Serve immediately, topped with more cheese at the table.",
  "thumbnails": {
    "default": {
      "height": 90,
      "url": "https://i.ytimg.com/vi/wf4Rz1Wozkc/default.jpg",
      "width": 120
    },
    "medium": {
      "height": 180,
      "url": "https://i.ytimg.com/vi/wf4Rz1Wozkc/mqdefault.jpg",
      "width": 320
    },
    "high": {
      "height": 360,
      "url": "https://i.ytimg.com/vi/wf4Rz1Wozkc/hqdefault.jpg",
      "width": 480
    },
    "standard": {
      "height": 480,
      "url": "https://i.ytimg.com/vi/wf4Rz1Wozkc/sddefault.jpg",
      "width": 640
    },
    "maxres": {
      "height": 720,
      "url": "https://i.ytimg.com/vi/wf4Rz1Wozkc/maxresdefault.jpg",
      "width": 1280
    }
  }
}