{
  "title": "Mario Batali Presents: Oxtail Ragu at Lupa",
  "video_published_at": "2012-10-01T14:53:32Z",
  "start_at": null,
  "end_at": null,
  "video_id": "wswaovGsrzk",
  "published_at": "2017-07-25T01:33:47Z",
  "description": "http://www.mariobatali.com\nhttp://www.luparestaurant.com/\n\nIn this installment of Mario Batali presents Chef Darren Weston of Lupa Restaurant makes there famous oxtail ragu with fresh garganelli.\n\nChef Darren Weston places the oxtail in a brine solution (containing salt and sugar) for up to two days.  Next he chops up carrots, celery, and onions fairly small in order to give body to the dish.  Then he makes the soffrito, which is created by placing carrots, celery, and onions into a food processor and blended into a fine substance, almost like a paste.  Next he places it in a pan mixed with olive oil and slowly cooks it at about 200/250 degrees.  Then he begins building the ragu by taking a heavy bottom dutch oven, putting it over medium-high heat, and adding a little bit of olive oil.  Just before the smoke point he places in the oxtail to get a sear and removes it.  Then he adds the chopped up carrots, onion, and celery from before to the same dutch oven.  He sautés this mixture, seasons with salt and pepper, adds some white wine and reduces it down.  Then he adds the soffritto sauce, some basic tomato sauce, and whole cherry tomatoes and stirs it all together.  After the ingredients are all mixed he adds the oxtail back in.  He then proceeds to add a little bit of water, brings it to a boil, and then reduces it down.  He lets it go uncovered, simmering for a couple of hours, and until the meet is very tender and is separating from the bone.  \n\nThen, to make the pasta use a 2:1 ratio of flour to egg yolks (just the yolks).  Add a little bit of olive oil.  mix, and roll the dough out as thin as possible.  Using a pizza cutter or knife cut the dough into equal size squares.  Then, using a little wooden board wrap the square around a straw and roll it into a tube shape.\n\nThen, once the meat is falling off of the bones, pick off all the meat and discard the bones.  Cook the pasta.  Place the oxtail ragu sauce in a pan and add butter, fresh parsley, celery leaves, and a little bit of orange zest.  Then, add the cooked pasta and a little bit of the cooking water to the pan.  Lastly, add in a little cheese.  Adding cheese should always be the last step!\n\nThis episode of Mario Batali Presents was produced by Via Alta Productions LLC in collaboration with Cowboy Bear Ninja.",
  "thumbnails": {
    "default": {
      "height": 90,
      "url": "https://i.ytimg.com/vi/wswaovGsrzk/default.jpg",
      "width": 120
    },
    "medium": {
      "height": 180,
      "url": "https://i.ytimg.com/vi/wswaovGsrzk/mqdefault.jpg",
      "width": 320
    },
    "high": {
      "height": 360,
      "url": "https://i.ytimg.com/vi/wswaovGsrzk/hqdefault.jpg",
      "width": 480
    },
    "standard": {
      "height": 480,
      "url": "https://i.ytimg.com/vi/wswaovGsrzk/sddefault.jpg",
      "width": 640
    },
    "maxres": {
      "height": 720,
      "url": "https://i.ytimg.com/vi/wswaovGsrzk/maxresdefault.jpg",
      "width": 1280
    }
  }
}