{
  "title": "Slow-roast beef eye of round, with mushroom jus and baked mash",
  "video_published_at": "2020-05-07T18:00:09Z",
  "start_at": null,
  "end_at": null,
  "video_id": "X0XpFwKKxXQ",
  "published_at": "2020-12-25T04:57:32Z",
  "description": "Thanks to Bright Cellars for sponsoring this video! Get 50% OFF your first 6-bottle box: https://bit.ly/BrightCellarsRagusea2 Bright Cellars is the monthly wine club that matches you with wine that you’ll love. Get started by taking the taste palate quiz to see your personalized matches.\n\n***RECIPE, FEEDS 6-8***\n\nFor the beef and jus/gravy\n\n1 3-4 lb (1.5 kg) eye of round roast\n1 head of garlic\na few sticks of rosemary and/or thyme\nbutter\nsalt\npepper\noil\n1 quart (4 cups, 28 oz, 830 ml) beef stock\n1/2-1 cup (100-200 ml) red wine (optional)\n1-3 tablespoons dried mushroom powder\n1-3 tablespoons onion powder\n1 teaspoon mustard powder\n2 teaspoons cornstarch (or 1/2 teaspoon xanthan gum)\n\nFor the potatoes\n\n3-4 lbs (1.5 kg) potatoes (like yukon golds for this)\n1 stick (4 oz, 113 g) butter\n8 oz (225 g) cheddar cheese, grated\n4 egg yolks\nmilk\nsalt\npepper\n\nHeat a large, oven-safe pan to medium-high, and heat your oven to 170 F / 75 C (of whatever temperature around there that your oven will hold). Crush the garlic cloves — no need to peel them if they don't have a lot of black mold. Coat the roast in oil, salt and pepper. Sear the beef on all sides. When it's almost done, put in a bunch of butter (maybe 2-4 oz, 50-100 g) the garlic and rosemary/thyme. Coat the roast in the melted butter, position it fat-side-up in the pan and transfer to the pan to the oven. Roast until the internal temperature is 125-130 F / 50-55 C for medium rare to medium, 5-6 hours.\n\nCut the potatoes into even chunks for boiling (I would only bother peeling them if they're baking potatoes) and boil them until fork-tender. Drain them, return them to the hot pot, melt in the butter, put in the cheese, egg yolks, lots of pepper and a pinch of salt to begin with. Mash until smooth. Add more salt to taste, and milk until you get the texture of stiff mashed potatoes. Grease a wide baking dish, scoop the potatoes in and brush the top with melted butter. When the roast comes out, up the oven to 400 F / 200 C and bake for about a half hour. If the top isn't very brown by the end, turn on the broiler.\n\nLet the roast rest on a cutting board. Turn the heat on high under the pan that contains the roast drippings, garlic, herbs, etc. Stir constantly when it starts sizzling. When it seems about to burn, deglaze with the wine (if not using wine, use the stock). Put in the beef stock, mushroom powder, onion powder and mustard powder and bring to a boil. Reduce the liquid by a third to a half. If thickening with cornstarch, mix it with a just enough water to make a slurry. If using xanthan gum, mix it with just enough oil to dissolve it. Add the thickener to the liquid, let boil for a minute, then taste for thickness and seasoning. (NOTE: This amount of thickening is designed to get you something that could still be called a jus. If you want a gravy, you'll need more thickener.) Strain, and discard the solids.\n\nSlice the roast as thin as possible against the grain. Scoop some potatoes on a plate, flood the plate with hot jus (hot enough to reheat the now-cold meat), put on some beef on the jus, and garnish with curly parsley if you're feeling tacky.",
  "thumbnails": {
    "default": {
      "height": 90,
      "url": "https://i.ytimg.com/vi/X0XpFwKKxXQ/default.jpg",
      "width": 120
    },
    "medium": {
      "height": 180,
      "url": "https://i.ytimg.com/vi/X0XpFwKKxXQ/mqdefault.jpg",
      "width": 320
    },
    "high": {
      "height": 360,
      "url": "https://i.ytimg.com/vi/X0XpFwKKxXQ/hqdefault.jpg",
      "width": 480
    },
    "standard": {
      "height": 480,
      "url": "https://i.ytimg.com/vi/X0XpFwKKxXQ/sddefault.jpg",
      "width": 640
    },
    "maxres": {
      "height": 720,
      "url": "https://i.ytimg.com/vi/X0XpFwKKxXQ/maxresdefault.jpg",
      "width": 1280
    }
  }
}