{
  "title": "Shaxian Peanut Sauce Noodles (沙县拌面)",
  "video_published_at": "2020-10-23T23:01:10Z",
  "start_at": null,
  "end_at": null,
  "video_id": "yvIZ19IN2yY",
  "published_at": "2020-10-25T03:13:04Z",
  "description": "Peanut sauce mixed noodles! These are a classic - and my personal favorite - at the ever popular chain in China, Shaxian snacks (a.k.a. Shaxian Delicacies). They're rich, saucy, and surprisingly pretty easy as well.\n\n______________\n\nSo as I said in the video, this relies on three components:\n\n* Peanut sauce\n* Scallion lard\n* Seasoned soy sauce\n\nIn the below recipe, we'll be making enough of each component for four snack sized bowls of noodles. That said, MAKE MORE. Scale these up. I think the best way to enjoy this would be to make bigger batches and always have them lying around to whip up more noodles.\n\nFOR THE PEANUT SAUCE:\n\n* 1/4 cup of peanut oil (花生油)\n* 1/4 cup of all natural peanut butter\n\nHeat your peanut oil up until faint wisps of smoke are starting to appear, ~200C. \n\nShut off the heat and add in the peanut butter. Mix well. Turn the flame to low and cook, stirring constantly, until it reaches a 'peanut butter roux' sort of color.\n\nNote that we are specifically using Chinese semi-refined peanut oil, like this: https://www.pacgourmet.com/lion-and-globe-peanut-oil/ (unfortunately I don't know a ton about how it's made). If you are using a refined peanut oil like you find at Western supermarkets, we'd recommend mixing in a teaspoon of toasted sesame oil AFTER your peanut sauce's done frying.\n\nFOR THE SCALLION LARD:\n\n* 3 tbsp lard (猪油)\n* 10g scallion (葱)\n\nHeat the lard with the scallion over a medium-low flame. Stir periodically - keep an eye on it but no need to hover. Cook until the scallions are brown and crispy - this should take ~10 minutes from the point your lard has melted.\n\nIf you are a vegetarian (or if lard is annoying to source), just use peanut oil for this. If you've already made a batch of scallion oil for scallion oil noodles, dim sum items, or whatever... just use what you have on hand. Lard gives the noodles some richness and a nice mouthfeel but it's not mandatory.\n\nFOR THE SEASONED SOY SAUCE\n\n* 2 tbsp light soy sauce (生抽)\n* 2 tbsp water\n* 2 tsp sugar\n\nMix the ingredients, bring to a boil over a medium flame. Fin.\n\nNote that many Chinese or Asian supermarkets carry products called 'seasoned soy sauce' or 'seasoned soy sauce for seafood', like this: https://www.amazon.com/Lee-Kum-Seasoned-Sauce-Seafood/dp/B0000DJYWR If you're looking for a shortcut, you can use this kind of product instead of making your own seasoned soy sauce.\n\nFOR THE NOODLES:\n\n(The basic idea of the noodle plate is a 3-2-1 ratio of peanut sauce to seasoned soy sauce to scallion lard. A bit of water or stock is added to thin the sauce out and make it easier to mix, and it's seasoned with salt and MSG.)\n\n* 1 tbsp peanut sauce\n* 2 tsp seasoned soy sauce\n* 1 tsp scallion lard\n* 2 tsp water -or- stock\n* 1/8 tsp salt\n* 1/4 tsp MSG\n\n(After you do this a couple times, feel free to eyeball the water/stock.)\n\nWe'll be making a small plate of 60g of dried noodles. As Steph said in the outro, most traditional is some alkaline noodles with a bit of tapioca starch kneaded into the dough. That said, even in Shaxian sometimes you see this with non-alkaline noodles. Go nuts. Wanna use the dried pasta you have in your cupboard? Go for it, just know that it'll be different.\n\nFirst mix all the above ingredients on a separate plate. Boil your noodles according to the package, or until a touch past al dente. Move the noodles over to the plate, and mix well.\n\nNote that when moving over to the plate, street vendors in Shaxian seem to bring some of the noodle-boiling water over along for the ride. The additional liquid seems to help the sauce come together. So don't be paranoid about straining the noodles too much! \n\nTop with some sliced scallion and add some blanched veg on the side (we used baby bok choy).\n\nAnd check out our Patreon if you'd like to support the project!\n\nhttp://www.patreon.com/ChineseCookingDemystified\n\nOutro Music: คิดถึงคุณจัง by ธานินทร์ อินทรเทพ\nFound via My Analog Journal (great channel): https://youtu.be/GHaL5H-VYRg",
  "thumbnails": {
    "default": {
      "height": 90,
      "url": "https://i.ytimg.com/vi/yvIZ19IN2yY/default.jpg",
      "width": 120
    },
    "medium": {
      "height": 180,
      "url": "https://i.ytimg.com/vi/yvIZ19IN2yY/mqdefault.jpg",
      "width": 320
    },
    "high": {
      "height": 360,
      "url": "https://i.ytimg.com/vi/yvIZ19IN2yY/hqdefault.jpg",
      "width": 480
    },
    "standard": {
      "height": 480,
      "url": "https://i.ytimg.com/vi/yvIZ19IN2yY/sddefault.jpg",
      "width": 640
    },
    "maxres": {
      "height": 720,
      "url": "https://i.ytimg.com/vi/yvIZ19IN2yY/maxresdefault.jpg",
      "width": 1280
    }
  }
}