{
  "title": "Kenji's Cooking Show | Keema Matar",
  "video_published_at": "2020-05-11T08:30:41Z",
  "start_at": null,
  "end_at": null,
  "video_id": "z3zs76WmYdk",
  "published_at": "2021-03-30T04:06:08Z",
  "description": "Keema matar is a classic Mughal dish popular all over the Indian subcontinent. It's typically made with ground lamb or goat cooked with peas, but today I had pork and beef so that's what I used. I also mixed some fava beans in with the peas. It's delicious and a good place to dip your toes into the wonderful world of spices and South Asian curries.\n\nHere I also pair it with homemade naan (I'll put up a video for that separately at some point) and potatoes cooked with spices that, since in the process of editing this video, I realize are similar to a thing called \"Bombay Potatoes,\" which I will now go and obsessively look up, as is custom.\n\nRecipe:\n\nEquipment:\nSpice grinder or mortar and pestle\nAssorted bowls\nA wok or Dutch oven\nA wooden spoon\nA box grater\n\nIngredients:\n1 pound ground meat (such as lamb or beef)\n1 cup water\n4 tablespoons butter\n1 large onion, finely diced\n1 small cinnamon stick\n1 star anise pod\n2 bay leaves\nSalt\n4 cloves garlic\n1 (2-inch) knob of ginger, peeled and cut into disks\n1 small hot pepper, such as Serrano or japlapeño, finely minced\n1 tablespoon freshly ground cumin seed\n2 teaspoons freshly ground coriander seed\n1/2 teaspoon ground cardamom\n1 teaspoon ground turmeric\n1 teaspoon ground dried chili (such as kashmiri powder, or any other spicy chili powder you'd like, or not spicy if you don't want spice)\n1 large beefsteak tomato, cut in half\n1/2 pound shelled fresh peas or frozen peas, thawed\nBig handful chopped fresh cilantro\n\n1. Combine the meat and water in a bowl and squeeze with your fingers to make a kinda loose meat sludge. Wash your hands and set the meat aside.\n\n2. Heat butter in a wok or Dutch oven until melted. Add the onion, cinnamon stick,  star anise pod, and bay leaves and cook over medium-high heat, stirring, until onion is deeply browned, about 10 minutes. Add garlic, ginger, and minced hot pepper and cook, stirring, until fragrant, about 1 minute. Add the ground spices and cook, stirring, until fragrant, about 30 seconds.\n\n3. Hold the cut-side of one tomato half against the large holes of a box grater with the open palm of your hand against its skin. Grate the tomato directly into the wok, leaving the skin behind. Stir the wok, then add the meat/water mixture and stir again.\n\n4. Cook, covered, until the sauce has reduced to a rich gravy, about 12 minutes. Stir in peas and cook for a minute longer, then stir in the cilantro. Serve.\n\nGrilled potato salad recipe:\nhttps://www.seriouseats.com/2015/06/how-to-make-easy-grilled-potato-salad-lemon-vinaigrette-summer-bbq.html\n\nThe knives I'm using here (these are not ads, I do not take sponsorships or do ads):\nWusthof 3.5-inch paring knife: https://www.amazon.com/W%C3%BCsthof-4066-7-09-Paring-knife/dp/B00009YB1O/\n\nKAN Core knife: https://www.amazon.com/KAN-8-inch-Damascus-Ambidextrous-Hammered/dp/B079QH1VTD",
  "thumbnails": {
    "default": {
      "height": 90,
      "url": "https://i.ytimg.com/vi/z3zs76WmYdk/default.jpg",
      "width": 120
    },
    "medium": {
      "height": 180,
      "url": "https://i.ytimg.com/vi/z3zs76WmYdk/mqdefault.jpg",
      "width": 320
    },
    "high": {
      "height": 360,
      "url": "https://i.ytimg.com/vi/z3zs76WmYdk/hqdefault.jpg",
      "width": 480
    },
    "standard": {
      "height": 480,
      "url": "https://i.ytimg.com/vi/z3zs76WmYdk/sddefault.jpg",
      "width": 640
    },
    "maxres": {
      "height": 720,
      "url": "https://i.ytimg.com/vi/z3zs76WmYdk/maxresdefault.jpg",
      "width": 1280
    }
  }
}