{
  "title": "How to Make Pasta Puttanesca",
  "video_published_at": "2016-09-07T14:53:40Z",
  "start_at": null,
  "end_at": null,
  "video_id": "ZJMUIDEJ6ls",
  "published_at": "2017-06-01T23:39:46Z",
  "description": "Spaghetti Puttanesca is a perfect weeknight dish - if you don't mind the garlic breath. It's made from inexpensive pantry staples and packs a powerful punch of flavor. Best of all, it's ready in just about 15 minutes start to finish.\n\nhttp://www.seriouseats.com/2016/02/how-to-make-spaghetti-puttanesca-pasta-week.html\n\n\"Puttanesca\" literally translates to \"in the style of prostitutes,\" supposedly because the pungent aromas of garlic, anchovies, capers, and olives tossed with pasta were how Neapolitan prostitutes would lead customers to their doors. This is one of those stories that seem, in the words of Douglas Adams, apocryphal or at least wildly inaccurate. That said, it's a fitting title—puttanesca packs an aromatic punch and then some.\n\nWHY IT WORKS:\n\n- Using a low volume of water for the pasta increases the water's starchiness, which will help to bind the sauce.\n- Finishing the pasta in the sauce coats each noodle with flavor.\n\nNOTES:\n\nI don't recommend using a Microplane, grater, or garlic press in this application, as the garlic will end up burning before it can really flavor the oil. Check out our guide on how to chop capers and olives for detailed instructions.\n\nINGREDIENTS:\n\n1/2 pound (225g) dried spaghetti\nKosher salt\n6 tablespoons (90ml) extra-virgin olive oil, divided\n4 medium cloves garlic, thinly sliced or finely chopped by hand (see note above)\n4 to 6 anchovy fillets, finely chopped (1 1/2 to 2 tablespoons; 20–30ml chopped anchovy)\nLarge pinch red pepper flakes\n1/4 cup capers, drained and chopped (about 2 ounces; 60g) (see note above)\n1/4 cup chopped pitted black olives (about 2 ounces; 60g) (see note above)\n1 cup (225g) whole peeled tomatoes, preferably San Marzano, roughly broken up by hand (about half a 14 ounce can)\nSmall handful minced fresh parsley leaves\n1 ounce (30g) finely grated Pecorino Romano or Parmesan cheese, plus more for serving\nFreshly ground black pepper\n1 (5-ounce; 140g) can oil-packed tuna (optional)\n\nDIRECTIONS\n\n1. Place spaghetti in a large skillet, sauté pan, or saucepan and cover with water. Add a small pinch of salt. Bring to a boil over high heat, stirring occasionally to prevent pasta from sticking.\n\n2. Meanwhile, in a medium skillet, combine 4 tablespoons (60ml) oil, garlic, anchovies, and red pepper flakes. Cook over medium heat until garlic is very lightly golden, about 5 minutes. (Adjust heat as necessary to keep it gently sizzling.) Add capers and olives and stir to combine.\n\n3. Add tomatoes, stir to combine, and bring to a bare simmer. Continue to simmer until pasta is cooked to just under al dente (about 1 minute less than the package recommends).\n\n4. Using tongs, transfer pasta to sauce. Alternatively, drain pasta through a colander, reserving 1 cup of the cooking water. Add drained pasta to sauce.\n\n5. Add a few tablespoons of pasta water to sauce and increase heat to bring pasta and sauce to a vigorous simmer. Cook, stirring and shaking the pan and adding more pasta water as necessary to keep sauce loose, until pasta is perfectly al dente, 1 to 2 minutes longer. (The pasta will cook more slowly in the sauce than it did in the water.) Stir in remaining olive oil, parsley, and cheese.\n\n6. Season with salt and pepper. (Be generous with the pepper and scant with the salt—the dish will be plenty salty from the other ingredients.) If using, stir in canned tuna and break it up with a fork. Serve immediately with more grated cheese at the table.\n\nMusic: Bensounds.com",
  "thumbnails": {
    "default": {
      "height": 90,
      "url": "https://i.ytimg.com/vi/ZJMUIDEJ6ls/default.jpg",
      "width": 120
    },
    "medium": {
      "height": 180,
      "url": "https://i.ytimg.com/vi/ZJMUIDEJ6ls/mqdefault.jpg",
      "width": 320
    },
    "high": {
      "height": 360,
      "url": "https://i.ytimg.com/vi/ZJMUIDEJ6ls/hqdefault.jpg",
      "width": 480
    },
    "standard": {
      "height": 480,
      "url": "https://i.ytimg.com/vi/ZJMUIDEJ6ls/sddefault.jpg",
      "width": 640
    },
    "maxres": {
      "height": 720,
      "url": "https://i.ytimg.com/vi/ZJMUIDEJ6ls/maxresdefault.jpg",
      "width": 1280
    }
  }
}