{
  "title": "Super Easy Fall-Off-the-Bone Chinese Style Ribs 气压锅中式排骨 One Pot Chinese Pork Recipe -Pressure Cooker",
  "video_published_at": "2019-05-17T22:28:49Z",
  "start_at": null,
  "end_at": null,
  "video_id": "zuJNkNliAMs",
  "published_at": "2020-05-20T20:42:40Z",
  "description": "This is an off-the-bone pork recipe - one that you must must must must try. No joke - try! Okay, I've nothing much to write because I'm on a holiday. Pardon us okay. :)\n\nSee the ingredient list below for your easy reference. \n\nWe would like to give special thanks to La Gourmet for letting us try out their high quality multi-cooker pot in the video respectively. The multi-cooker can be used as a rice cooker, a pressure cooker, a stir frying pot, a pot to keep your food warm, a double boiler --- so many functions! If you like to buy La Gourmet multi-cooker pot, you can get it here https://s.lazada.sg/s.VMGH or you can also go to any of the major departmental stores in Singapore such as Isetan, Robinsons, Takashimaya, BHG, OG, Metro or Tangs. These two brands are also available in most major departmental stores in Malaysia. La Gourmet products are also sold in Philippines and Indonesia.\n\nHope you can recreate this yummy dish in the comfort of your home. Thanks for dropping by our channel. \n\nPlease subscribe to stay tuned to our home cooking videos. \n\nFollow us on: \nYoutube: www.youtube.com/spicenpans \nFacebook www.facebook.com/spicenpans/ \nInstagram www.instagram/spicenpans \nBlog: www.spicenpans.com \n\nChat with us! info@spicenpans.com \n\nThanks for watching! See you soon. \n\nxoxo \nJamie \non behalf of Spice N’ Pans \n\nIngredients: \nServes 3 - 4 pax\n\n500g of prime ribs (you can also use spare ribs or beef ribs)\n1 piece star anise\n1 piece of cinnamon bark (5 - 7 cm)\n1 thumb size young ginger - minced\n2 pieces shallots minced\n4 cloves of garlic - minced\n1 cup of Chinese rice wine\n2 tablespoons of brown sugar\n1 tablespoon of hoisin sauce\n1 tablespoon of oyster sauce\n2 tablespoons of low sodium light soy sauce\n2 tablespoons of premium dark sauce \n2 tablespoons of rice vinegar (or apple cider)\nEnough water to cover the ribs\n\n===\nIf you like this recipe, you might like these too:\n\nBraised Pig’s Stomach w/ Mushrooms & Sea Cucumber \nhttps://youtu.be/zj_JkAx7n7A\n\nLotus Leaf Rice\nhttps://youtu.be/NKFoCtnzQnM\n\nFish Maw Seafood Soup\nhttps://youtu.be/bPVnQMfp9xM\n\nDisclaimer: \nSpice N' Pans is not related to these products and cannot guarantee the quality of the products in the links provided. Links are provided here for your convenience. We can only stand by the brands of the products we used in the video and we highly recommend you to buy them. Even then, preference can be subjective. Please buy at your own risk. Some of the links provided here may be affiliated. These links are important as they help to fund this channel so that we can continue to give you more recipes. Cheers!",
  "thumbnails": {
    "default": {
      "height": 90,
      "url": "https://i.ytimg.com/vi/zuJNkNliAMs/default.jpg",
      "width": 120
    },
    "medium": {
      "height": 180,
      "url": "https://i.ytimg.com/vi/zuJNkNliAMs/mqdefault.jpg",
      "width": 320
    },
    "high": {
      "height": 360,
      "url": "https://i.ytimg.com/vi/zuJNkNliAMs/hqdefault.jpg",
      "width": 480
    },
    "standard": {
      "height": 480,
      "url": "https://i.ytimg.com/vi/zuJNkNliAMs/sddefault.jpg",
      "width": 640
    },
    "maxres": {
      "height": 720,
      "url": "https://i.ytimg.com/vi/zuJNkNliAMs/maxresdefault.jpg",
      "width": 1280
    }
  }
}